{
  "num": 1014,
  "url": "https://xkcd.com/1014",
  "title": "Car Problems",
  "img": "https://imgs.xkcd.com/comics/car_problems.png",
  "alt": "Or if you replace your car, we'll be happy to set it on fire again so you can take another crack at getting that shot.",
  "year": "2012",
  "month": "2",
  "day": "8",
  "transcript": "[Megan stands in front of a projection on a screen and points with a stick to the picture shown of a blue car with yellow head lights standing on a gray road with green grass behind. She has an audience consisting of Cueball standing in front of Black Hat who is sitting and leaning back in a chair and Danish standing behind him.]\nMegan: Attention, please. \nMegan: This is a photo of my car as of two weeks ago.[Zoom in on Megan only, still in front of the screen, but pointing on a new projection of the same car engulfed in red and yellow flames, with lots of black smoke above the flames.]\nMegan: And this is my car as I found it this morning. \nMegan: Can anyone tell me what's wrong with this picture?[Zoom in on her audience who all ponders, Cueball with a hand on his chin, Black Hat sitting up straight and Danish scratching the back of her head.][Zoom out to all four in a frame-less panel, seen from the side so the screen with the color picture is seen almost from the side. It is possible to see that there is colors on the screen but not what the picture looks like. All three respond to Megan, who is standing with her pointer down; Cueball now has his hands down, Black Hat still sits straight, and Danish now has a hand to her chin.]\nCueball: The white balance, for one.\nDanish: Focus is a bit too close.\nBlack Hat: The chromatic aberration suggests you bought your camera because it had \"The most megapixels\".[Zoom in on Megan only, who violently swishes her pointing stick up towards the screen behind her (off panel). The other three are outside the panel to the right, and two of them makes comments. It is not possible to say which of the three speaks.]\nMegan: The car is on fire!\nOff panel voice 1: Maybe you should use the insurance money to get a better camera.\nOff panel voice 2: Yeah."
}