{
  "num": 1027,
  "url": "https://xkcd.com/1027",
  "title": "Pickup Artist",
  "img": "https://imgs.xkcd.com/comics/pickup_artist.png",
  "alt": "Son, don't try to play 'make you feel bad' with the Michael Jordan of making you feel bad.",
  "year": "2012",
  "month": "3",
  "day": "9",
  "transcript": "[Hairy and Cueball sitting at a table.]\nHairy: I've been learning tricks from pickup artist forums.\nCueball: Pickup artists are dehumanizing creeps who see relationships as adversarial and women as sex toys.[Close-up of Hairy's head, with a faint outline of Black hat and Danish sitting at a table in the background.]\nHairy: No, it's just a bunch of tips! Like negging: you belittle chicks to undermine their self-confidence so they'll be more vulnerable and seek your approval.[Close-up of Cueball's head.]\nCueball: Just talk to them like a fucking human being.\nHairy: Nah, that's a sucker's game.\nHairy: Ok— wish me luck![Small frame across top of panel reads Meanwhile... and Danish is sitting at a table with Black hat standing next to the table holding a bowling ball under his arm.]\nBlack Hat: I'm going to the bathroom to roll a bowling ball down under the line of stalls.\nDanish: Cool.[Close up of Cueball's head, with Hairy approaching Danish's table in the background.]\nCueball: Oh no.[Hairy and Danish at a table. Hairy is standing up and leaning on the table.]\nHairy: You look like you're on a diet. That's great!\nHairy: How's the fruit plate?[Close-up of Danish's head.]\nDanish: Ooh- are we negging?\nDanish: Let me try![Close-up of Danish's head, with her hand raised.]\nDanish: You look like you're going to spend your life having one epiphany after another, always thinking you've finally figured out what's holding you back, and how you can finally be productive and creative and turn your life around.\nDanish: But nothing will ever change. That cycle of mediocrity isn't due to some obstacle. It's who you are.\nDanish: The thing standing in the way of your dreams\nDanish: is that the person having them is you.[Hairy and Danish at a table. Hairy is standing up.]\nDanish: Ok, your turn! Ooh, try insulting my hair!\nHairy: I think I need to go home and think about my life.\nDanish: It won't help."
}