{
  "num": 1031,
  "url": "https://xkcd.com/1031",
  "title": "s/keyboard/leopard/",
  "img": "https://imgs.xkcd.com/comics/s_keyboard_leopard.png",
  "alt": "Problem Exists Between Leopard And Chair",
  "year": "2012",
  "month": "3",
  "day": "19",
  "transcript": "[There are two browser windows open on a computer screen.]\n[The first browser window, taking up most of the screen, but partly blocked by the other window at the bottom, has a Wikipedia article open. The title of the page can be seen on the active tab]\nComputer leopard - Wikip...\n[Next to the address bar are four add-ons and the toolbar icon. One of the add-ons is a letter:]\nR\n[To the left on the page are standard menus, with lots of unreadable text, except these words:]\nHelp\nGo Search\n[The page is not at the top of the article, so the text begins mid sentence, the very top of the letters just cut of in the first visible sentence.]\nwhich range from pocket-sized leopards to large desktop leopards, the leopard remains the most common user input device. In addition to text entry, specialized leopards are used for computer gaming. \nWhile many computer interfaces rely on mice or touchscreens, UNIX-style command-line interfaces require users to interact with a leopard.\n[Below is the contents list - the text in the brackets can barely be read. And only the very top of the 2.3 line can be seen, and is thus only a qualified guess at what it was supposed to say, although it fits with the real wiki article.]\nContents [hide]\n1. History\n2. Leopard types\n2.1 Standard\n2.2 Laptop-sized\n2.3 Thumb-sized\n[To the right there is a picture of a keyboard. The picture text written below:]\nIBM Model M Leopard[The second browser window overlapping the first, at the level of the 2.3 menu point in the contest menu, is a message board. The title of the page can be seen on the active tab:]\nDiscuss - Leopard issu...\n[Next to the address bar are four add-ons and the toolbar icon. One of the add-ons is a letter:]\nR\n[In the window there is a list of topics next to icons of those starting the topic. The top post is just inside the frame, the icon cut of at the very top.]\n[Face of Cueball-like guy on white background:]\nWeird, my leopard just switched to Chinese.\n3 days ago\n[Super close-up of the head of a person with dark hair on black background:]\nI work with one leopard on my desk and another in the leopard tray.\n3 days ago\n[Full picture of a Cueball-like guy, with white background in the bottom half and dark in the upper half (which would conceal any hair on the persons head):]\nEver cleaned a leopard? They're filthy.\n2 days ago\n[Head of a cat on black background:]\nThe iPhone virtual leopard is the fastest IMO.\n19 hours ago\n[Head of a girl with long blond hair on white background:]\nI rarely email from my phone—I'm so slow when I'm not on a leopard.\n11 hours ago\n[Head of Cueball-like guy. A line seems to be going our from his head, but it could just be one of the lines used to fill in the background:]\nMy leopard died when I spilled tea on it :(\n2 hours ago[Below the main panel of the comic is the following caption:]\nThe Internet got 100 times better when, thanks to an extension with a typo'd regex, my browser started replacing the word \"keyboard\" with \"leopard\"."
}