{
  "num": 1036,
  "url": "https://xkcd.com/1036",
  "title": "Reviews",
  "img": "https://imgs.xkcd.com/comics/reviews.png",
  "alt": "I plugged in this lamp and my dog went rigid, spoke a sentence of perfect Akkadian, and then was hurled sideways through the picture window. Even worse, it's one of those lamps where the switch is on the cord.",
  "year": "2012",
  "month": "3",
  "day": "30",
  "transcript": "[Cueball and Megan stand in a store looking at a lamp that Cueball points at on a table in front of them. There is another table behind them with another lamp and next to it stands a box with a picture of yet a different type of lamp in the bottom right corner. Both lamps have a price tag dangling from their shade. Above them (and their spoken text) is a frame with a caption:]\nShopping before online reviews:\nCueball: This lamp is pretty.\nMegan: And affordable.\nCueball: Let's get it.\nMegan OK! [Exactly the same setting as above except now Megan holds up her smartphone in one hand looking down at it while typing on it with the other hand. Above them (and their spoken text) is a frame with a caption:]\nShopping now:\nCueball: This lamp is pretty.\nMegan: It's got 1½ stars on Amazon. Reviews all say to avoid that brand.[To the left of Cueball there is another lamp on a table. But he is now looking at his smartphone instead. Megan has turned away from him but is also looking at her smartphones. There are no lamps next to her.]\nCueball: This one has good reviews.\nMegan: Wait, one guy says when he plugged it in, he got a metallic taste in his mouth and his cats went deaf.\nCueball: Eek. \nCueball: What about- ...no, review points out it resembles a uterus.[Cueball is holding his smartphone up in front of his face, Megan, looking at him, is holding her smartphone but has her arms down. There are no lamps shown.]\nCueball: OK, I found a Swiss lampmaker with perfect reviews. Her lamps start at 1,300 Francs and she's only reachable by ski lift.\nMegan: You know, our room looks fine in the dark."
}