{
  "num": 1052,
  "url": "https://xkcd.com/1052",
  "title": "Every Major's Terrible",
  "img": "https://imgs.xkcd.com/comics/every_majors_terrible.png",
  "alt": "Someday I'll be the first to get a Ph. D in 'Undeclared'.",
  "year": "2012",
  "month": "5",
  "day": "7",
  "transcript": "[Headings to the left and above the 36 panels:]\nEvery Major's Terrible\nto the tune of Gilbert & Sullivan's\nModern Major-General Song\n(Which you may know from Tom Lehrer's Elements. \nIf not, just hum Supercalifragilisticexpialidocious.)[To make it easier to read the lyrics, the lyrics text is double indented. If someone says the line, their name stands above the line they say. If no one says the line it is just written after the description. Unless otherwise stated, the text is inside the frame of the panel above the drawing. If any other text is present it will be written after the lyrics.][Panel 1: Cueball sitting with his chin on fist on a gray rock. Next to him is a mathematical expression \"2 + a picture of yellow glowing light bulb  = picture of Cueball in sailboat on a blue sea\".]\nPhilosophy's just math sans rigor, sense, and practicality\nExpression: 2+  =\n[Panel 2: A black and brown cannon standing on a green hill fires and a dashed line indicates the cannonball's trajectory. The line splits in two twice ending up at 4 cannonballs.]\nAnd math's just physics unconstrained by precepts of reality.\n[Panel 3: A student in robes and square academic cap receives a diploma from a dean on a brown podium, while Cueball, diploma in hand, runs away on the green lawn, arms in the air, shedding both robe and cap.]\nA business major's just a thing you get so you can graduate\n[Panel 4: Ponytail wearing goggles and holding a flask with the periodic table in the background.  Three stars and circle lines around her head indicates that she is dizzy.]\nAnd chemistry's for stamp collectors high on methylacetate.\n[Panel 5: Cueball holds up hands questioningly.]\nCueball:\nWhy anyone who wants a job would study lit's a mystery\n[Panel 6: Cueball holding his chin.]\nCueball:\nUnless their only other choice were something like art history.\n[Panel 7: The text is above this panels frame, which is only about two third of the other frames. In the frame is a close-up of Cueball as a graduate wearing yellow embroidered robe and yellow tasseled mortarboard.]\nA BA in communications guarantees that you'll achieve\n[Panel 8: The text is above this panels frame, which is only about two third of the other frames. In the frame  is again the same Cueball graduate. Only now he is emerged in blue water. A wicker basket flows to the left, where air bubbles escape from Cueball. To the right are two fish.]\nA little less than if you'd learned to underwater basket-weave\n[Panel 9: Cueball holding a gray frog at arm's length.]\nCueball:\nI'd rather eat a Fowler's toad than major in biology,\nFrog: Ribbit\n[Panel 10: Megan indicating to the left a scruffy individual and an individual holding a chainsaw, and to the right another scruffy individual holding a chainsaw.]\nAnd social psych is worse than either psych or sociology.\n[Panel 11: Cueball stands in front of a brown desk holding a gray course catalog. Behind the desk sits a man with glasses and hair at the back of his head. He sits on his gray office chair. There is a stack of papers on the desk.]\nCueball:\nThe thought of picking any one of these is too unbearable.\n[Panel 12: Same picture as panel 11, only now Cueball tosses the course catalog over his shoulder.]\nCueball:\nJust put me down as \"Undecided\"—Every major's terrible. \n[Panel 13: The text is above this panels frame, which is only about two third of the other frames. In the frame is a seismograph chart with four traces; about halfway across one trace begins oscillating vigorously.]\nNow, if you can't prognosticate, that's OK in seismology,\n[Panel 14: A bearded man with white hair states a formula with his left arm lifted.]\nBut if your hindsight's weak as well, you'd best stick to theology.\nBearded man: X ∴ ∃X\n[Panel 15: Two lines with gray parenthesis.]\nCS will make each day a quest to find a missing close-paren.\nCode: (((()((((()(\nCode: ))))())())())\n[Panel 16: Megan with a green biohazard symbol floating above her head stands alone; to the left and right three Cueball-like guys and Ponytail shun her.]\nVirology will guarantee you'll never get a hug again.\n[Panel 17: Megan running at a PC on a brown table with a brown and black axe raised over her head.]\nI.T. prepares you for a life of fighting with PCs nonstop.\n[Panel 18: The frame is a little smaller than the other frames. Above the frame is the first part of the text. In the frame is an image of a bearded man with glasses who says the rest of the text. ]\nAs Pratchett said, \nPratchett:\n\"Geography's just physics slowed with trees on top.\"\n[Panel 19: A man with black hair plays on brown bongo drums while a blond woman and Megan look in at him from left and right.]\nThough physics seems to promise you a Richard Feynman-like career,\n[Panel 20: The text is above this panels frame, which is only about two third of the other frames. In the frame is screenshot of a wiki redirect page. Below the title is the normal text for such a page. This is unreadable though, although it is possible to imagine it is possible to read the first line which would say: From Wikipedia, the free encyclopedia. But not the other line which would be Redirect page. Below this line is an arrow down to the page the redirect points to. This is written in blue letters.]\nThe wiki page for \"Physics major\" redirects to \"Engineer.\"\nWiki page: \nPhysics major\n Engineer\n[Panel 21: Flowchart: a gray box with a sad face chains to a decision diamond reading simply \"?\"; the \"yes\" branch leads to a yellow happy-face box while the \"no\" branch loops back to the initial sad face.]\nThey say to study history or find yourself repeating it,\nFlow chart:\n? \nNo \nYes\n[Panel 22: The text is above this panels frame, which is only about two third of the other frames. In the frame is Hairbun as a teacher with boxy spectacles and a bun in front of a green chalkboard with three years in white.]\nBut all that it prepares you for is forty years of teaching it.\nChalkboard: \n1935 \n1969\n1991\n[Panel 23: Cueball at his adviser's desk again as in panel 12, but now without any catalog and holding his arms down.]\nCueball:\nI recognize my four-year plan's at this point not repairable,\n[Panel 24: Same as panel 23 except Cueball has raised a first and the adviser has his hand to his mouth.]\nCueball:\nBut put me down as \"Undecided\"—Every major's terrible.\n[Panel 25: Image of a bald man with beard and glasses. He raised both hands one as a fist the other pointing up. There are lines out from his head to the left and lightning lines out from his head to the right.]\nAstronomers all cringe when they hear \"supermoon\" or \"zodiac\".\n[Panel 26: Silhouette of Cueball, agitated, in an open field near a fence and a tractor.]\nAgronomy's a no-go; I'm a huge agorophobiac.\n[Panel 27: Cueball looking aghast at a green snake on the ground, both hands at his mouth and sweat jumping from his head. The snake also thinks about Cueball but in red and black.]\nI'm too ophiophobic to consider herpetology,\nSnake:  ♥?\n[Panel 28: Anatomical image of a stomach in pink and red.]\nAnd I can't stomach any part of gastroenterology.\n[Panel 29: A man with wild hair, glasses askew, clutching folders and papers (green, blue and white), and dropping several.]\nMan:\nWhile pre-med gives you twitchy-eyed obsession with your GPA,\n[Panel 30: Ponytail reciting poetry; her poem is this panel's line, in a lighter, lower-case font.]\nPonytail:\na poetry degree bespeaks bewildering naïveté.\n[Panel 31: The text is above this panels frame, which is only about two third of the other frames. The frame is a TV screen with the CSI: Miami logo, CSI in yellow.]\nTV's behind the rush into forensic criminology\nTV screen: \n CSI: \nMiami\n[Panel 32: A balding man wearing glasses and holding a smoking pipe together with Ponytail holding a notebook watch a wall-mounted flat-screen TV on which the CSI: Miami logo from the previous panel is showing.]\n(Or so claims meta-academic epidemiology).\nTV screen: \n CSI: \nMiami\n[Panel 33: Cueball is talking with his left arm raised, palm up.]\nCueball:\nBy dubbing econ \"dismal science\" adherents exaggerate;\n[Panel 34: Close-up on Cueball with left arm up.]\nCueball:\nThe \"dismal\"'s fine—it's \"science\" where they patently prevaricate.\n[Panel 35: As panel 23 with Cueball at his adviser's desk once more though with both hands held out in front of him.]\nCueball:\nIn terms of choices, I'd say only Sophie's was comparable.\n[Panel 36: Same as panel 35 except that Cueball makes a final dramatic flair spreading both arms out.]\nCueball:\nJust put me down as \"Undecided\"—Every major's terrible!"
}