{
  "num": 1081,
  "url": "https://xkcd.com/1081",
  "title": "Argument Victory",
  "img": "https://imgs.xkcd.com/comics/argument_victory.png",
  "alt": "Really, the comforting side in most conspiracy theory arguments is the one claiming that anyone who's in power has any plan at all.",
  "year": "2012",
  "month": "7",
  "day": "13",
  "transcript": "[Cueball, looking right, is talking at his smartphone while holding it up in front of his head using both hands.]\nCueball: I can't believe you're so wrong. I'm backed by Snopes, Wikipedia, and a half-dozen journals. You're citing .net pages with black backgrounds and like 20 fonts each.[A conspiracy theorist is sitting in front of this lap top at his desk looking left. He has his hair combed down. He is talking to Cueball via his laptop, probably Skyping.]\nConspiracy theorist: It's sad how you buy into the official story so unquestioningly. \nConspiracy theorist: Guess some people prefer to stay asleep.[Back to Cueball who has lowered his phone a bit. The reply from the conspiracy theorist is shown to come out of the phone with a jagged arrow and likewise speech bubble.]\nCueball: Watch closely— I'm about to win this argument.\nConspiracy theorist (reply from phone): How?[Cueball is sitting at the very top of a waterslide preparing to descend.]\nCueball: By going down a waterslide.[A split panel, with a close-up of the conspiracy theorist above and below Cueball is sliding down the waterslide with both hands above his head, water splashing up behind him as he holds his smartphone above the water in one hand.]\nConspiracy theorist: So? What does that prove?\nCueball: Wheee..[Another split panel, this time a smaller part is used for the close-up of the conspiracy theorist above and below Cueball has more of this panels space for sliding down to the bottom of the waterslide with both hands above his head, water still splashing up behind him as he continues to keep his smartphone above the water in one hand.]\nConspiracy theorist: You didn't win the argument!\nCueball: ...eeee!\nCueball: Sploosh!"
}