{
  "num": 1112,
  "url": "https://xkcd.com/1112",
  "title": "Think Logically",
  "img": "https://imgs.xkcd.com/comics/think_logically.png",
  "alt": "I've developed a more logical set of rules but the people on the chess community have a bunch of stupid emotional biases and won't reply to my posts.",
  "year": "2012",
  "month": "9",
  "day": "24",
  "transcript": "[A guy wearing a knit cap over short black hair is sitting down at a computer touching the keyboard with one hand. Cueball is standing behind watching the screen.]\nLaptop: *Move*\nCueball: Why'd you move your knight away?[Knit Cap turns around and rests an arm on the chair looking at Cueball who holds out both arms.]\nCueball: Just think logically. The goal is checkmate, so you should always move pieces toward the other player's king.[Closeup of Cueball holding a hand to his chin.]\nCueball: I guess occasionally you need to move backward, but it'd be trivial to make a list of those circumstances and-[Knit Cap is leaning back in chair facing Cueball, panel is so slim that the lap top is not included.]\nKnit Cap: Have you ever played chess?\nCueball: Not much, but—\nKnit Cap: Wanna?\nCueball: Uh, ok.[Knit Cap sitting and Cueball standing is playing chess with a board standing between them on a very small table or a four legged stool. The board extends quite far out on either side. Their moves are indicated above with four by Knit Cap and three towards Cueball. It is clear both from this and from the pieces visible on the board that Knit Cap is playing white]\n*Move*\n _____*Move*\n*Move*\n _____*Move*\n*Move*\n _____*Move*\n*Move*\nKnit Cap: Checkmate.[In a frameless panel Cueball is standing staring at the chess board, where there clearly are more pieces on his side of the board.][Knit Cap has turned back to the laptop with both hands on the keyboard. Cueball is standing behind the chess board holding a finger up in the air.]\nCueball: This game isn't very well-designed. For starters, knights are too weak..."
}