{
  "num": 1127,
  "url": "https://xkcd.com/1127",
  "title": "Congress",
  "img": "https://imgs.xkcd.com/comics/congress.png",
  "alt": "It'd be great if some news network started featuring partisan hack talking heads who were all Federalists and Jacksonians, just to see how long it took us to catch on.",
  "year": "2012",
  "month": "10",
  "day": "29",
  "transcript": "A history of\nThe United States Congress\nPartisan and ideological makeup[The comic is divided into three massive sections, SENATE, PRESIDENCIES, and HOUSE. Timelines run backwards down the page between each section. In the HOUSE and SENATE sections, shifting, curving red and blue areas of different brightness illustrate the shifting balance of power between \"Members of Left-Leaning Parties\" and \"Members of Right-Leaning Parties\". Under PRESIDENCIES, different administrations are labeled and wars are shaded in gray. There are notes throughout all sections.][There are additional notes on the right.]LEGEND\n[Square containing ribbons of color merging upwards with larger areas]: Branches join in when new members enter Congress and cause an ideological bloc to grow. (Note: If the new member is elected as another retires from the same ideological bloc, no change is shown.)\n[Square containing ribbons of color splitting off from larger areas]: Branches split off when members leave Congress, causing their ideological bloc to shrink. (Note: If the new member is elected as another retires from the same ideological bloc, no change is shown.)\n[Square showing yellow dotted line crossing from red to blue area]: The yellow line marks the midpoint, which indicates which side has control of the chamber.\n[Square in which curve briefly separates from blue area]: If a bloc loses members in one election and gains them in the next, the exiting stream may rejoin. This does not necessarily mean the same people returned.\n[Square showing white dashed line labeled Lyndon Johnson on top of ribbon merging with main area]: Future (and past) US Presidents who served in Congress are shown with white dashed lines. Other noteworthy members are shown with thin solid lines.\n[Square in which tinted area marked \"Whig\" sits over mix of red and blue areas]: Tinted white outlines mark the approximate membership of some of the smaller political parties.HOW IDEOLOGY IS CALCULATED\nEach member of Congress is assigned to an ideological category using DW-NOMINATE, a statistical system created by political scientists Keith Poole and Howard Rosenthal. This system rates each member of Congress's ideological position [sic] based on their votes.\nDW-NOMINATE is purely mathematical and involves no judgement on the content of bills. Instead, members of Congress are placed on a spectrum based on how consistently they vote together.\nWhile people argue that ideology is many-dimensional, Poole and Rosenthal found that nearly all Congressional voting behavior - especially in the modern era - can be accurately predicted by using just one ideological variable.\nThis variable turns out to roughly correspond to position on the classic economic liberal/conservative spectrum.\nBecause members of Congress have served in overlapping terms with past members in a chain back to the first Congress, the system allows comparison of ideology across time - even accounting for individual members' ideological drift. (Note: Scores are comparable across time but not between chambers.)\nFor more detail, see Poole and Rosenthal's website, voteview.com."
}