{
  "num": 1141,
  "url": "https://xkcd.com/1141",
  "title": "Two Years",
  "img": "https://imgs.xkcd.com/comics/two_years.png",
  "alt": "She won the first half of all our chemo Scrabble games, but then her IV drugs started kicking in and I *dominated*.",
  "year": "2012",
  "month": "11",
  "day": "30",
  "transcript": "[Randall and Randall's fiancée sit on a bed, Randall's fiancée is talking on the phone. The person she is talking to, a doctor holding a clipboard, is shown inset.]\nRandall's fiancée: Oh god.[Randall and Randall's fiancée sit together while Randall's fiancée, now bald, is receiving chemotherapy. They are both on their laptops.]\nIV pump: ... Beeep ... Beeep ... Beeep ...[Randall and Randall's fiancée (who is wearing a knit cap) are paddling a kayak against a scenic mountain backdrop.][Randall and Randall's fiancée sit at a table, staring at a cell phone. There is a clock on the wall. Her head is stubbly.]\nRandall's fiancée: How long can it take to read a scan!?[Randall and Randall's fiancée are back at the hospital again, Randall's fiancée receiving chemo. They are playing Scrabble.]\nRandall: \"Zarg\" isn't a word.\nRandall's fiancée: But caaaancer.\nRandall: ...Ok, fine.[Randall and Randall's fiancée (wearing a knit cap) are listening to a Cueball-like friend. A large thought bubble is above their heads and it obscures the friends talk. The text below, split in three is the only part there can be no doubt about:]\nFriend: So next year you should come visit us up in the mounta\na\nand\nRandall and Randall's fiancée (thinking): \"Next year\"[Randall and Randall's fiancée are getting married, with a heart above their heads. Randall's wife's hair is growing back.][Randall and Randall's wife (wearing a knit cap) stand on a beach, watching a whale jump out of water.]\nFwoosh[Randall's wife is sitting at a desk with her laptop standing on top of two books. Her hair has grown back a little more. Randall stands behind her.]\nRandall: Hey— \nRandall: you're doing science, \nRandall: and you're still alive.\nRandall's wife: Yeah![Randall and Randall's wife sit under a tall tree on a hill.]\nRandall: It's really only been two years?\nRandall's wife: They were big years.[Randall and Randall's wife sit at a table in a fancy restaurant. Her hair has grown back even more. The waiter (Hairy) brings them a dish with a cover on it.]\nWaiter: Happy... Anniversary?\nRandall's wife: Biopsy-versary!\nWaiter: ...Eww."
}