{
  "num": 1212,
  "url": "https://xkcd.com/1212",
  "title": "Interstellar Memes",
  "img": "https://imgs.xkcd.com/comics/interstellar_memes.png",
  "alt": "The strongest incentive we have to develop faster-than-light travel is that it would let us apologize in advance.",
  "year": "2013",
  "month": "5",
  "day": "15",
  "transcript": "[On a black background yellow circles and white bubbles are shown. Caption above the picture:]\nIf other star systems are listening in on our pop culture, given the speed-of-light delay, these are the jokes and catchphrases they just learned about and are currently repeating way too much:[On a black background a map of star systems in relation to the Sun, which is roughly in the center, sending out radio waves is shown. Each star is a yellow circle of differing sizes, with a speech bubble (or more). The list is ordered from closest to furthest.]\nProxima Centauri: I'm on a boat!\nAlpha Centauri A B: The cake is a lie! – ♪ Never gonna give you up ♫\nLuhman 16: I can haz?\nBarnard's star: Leave Britney alone! – ♫ Chocolate Raaaiiin ♫\nWolf 359: Chuck Norris doesn't sleep. He waits.\nLalande 21185: ♬ Numa numa ♪\nSirius: I still can't believe Bellatrix– – Dude, get over it.\nGliese 65:  INTERNETS!\nEpsilon Eridani: Ninjas fight all the time!\nProcyon: ...God kills a kitten! – A what?\nEpsilon Indi: You're the man now, dog!\nTau Ceti: All your base are belong to us.\nLuyten's Star: Peanut Butter Jelly Time!\nKapteyn's star: My spoon is too big!\nKruger 60: MORE COWBELL!\nGliese 1: Look at the tiny dancing Earth mammals!\nVan Maanen's star: WASSSUUP!?!\nAd Leonis: Oh my God, they killed Kenny! – You bastards!\n70 Ophiuchi: Welcome to Good Burger, home of the Good Burger. – What's a burger? – I don't know.\nAltair: Mr. T ate my balls!\nSigma Draconis: Oh ... my ... gaawd.\nDelta Pavonis: I want the truth. – You can't handle the truth!\nGliese 892: Hasta la vista, baby.\nXi Boötis: Did I do that?\nHR 753: D'oh!\nBeta Hydri: Yippie-ki-yay, motherfucker.\nVega: Resistance is futile.\nZeta Tucanae: Let's get ready to ruuumble!\nHR 1614: Where's the beef?\nGroombridge 1830: I pity the fool!\nDelta Trianguli: May the Force be with you.\nBeta Virginis: Nobody expects the Spanish Inquisition!\nArcturus: You talkin' to me ?\nBeta Trianguli Australis: I'm going to make him an offer he can't refuse.\nLamda Aurigae: You've got to ask yourself one question: 'Do I feel lucky?'\nCapella: And now for something completely different.\nHD 211415: Live long and prosper. – Ok.\nAlderamin: EXTERMINATE!\n51 Pegasi: Name's bond. James Bond.\nCaph: Take me to your leader! – No, Steve.\nKappa Reticuli: Here's lookin' at you, kid.\nAlpha Hydri: Rosebud.\nGienah: Ehh, what's up doc?\nAlpha Serpentis: Frankly, my dear, I don't give a damn."
}