{
  "num": 1337,
  "url": "https://xkcd.com/1337",
  "title": "Hack",
  "img": "https://imgs.xkcd.com/comics/hack.png",
  "alt": "HACK THE STARS",
  "year": "2014",
  "month": "3",
  "day": "3",
  "transcript": "[A black image shows an image of the ISEE-3/ICE spacecraft in white. Text is written in white above it]\nThe ISEE-3/ICE probe was launched in 1978.\nIts mission ended in 1997 and it was sent a shutdown signal.[The text continues, black on white, without a frame around it, between the first frame and the next.]\nIn 2008, we learned-to our surprise-that the probe didn't shut down.\nIt's still running and it has plenty of fuel.\n...and in 2014, its orbit brings it near earth.[Megan holding up one hand and Ponytail are talking to each other.]\nMegan: We could send it on a new mission... \nMegan: Except we no longer have the equipment to send commands to it.\nPonytail: Can't we—[Zoom in on Megan's head and torso as she looks towards Ponytail off-panel to the right.]\nMegan: NASA won't rebuild it. \"Too Expensive\"\nPonytail (off-panel): Seriously?\nMegan: I know, right? \nMegan: So the internet found the specs \nMegan: And we went to work.[Megan and Ponytail are walking towards right, between Hairbun facing left and Cueball (with head phones) facing right. They are sitting at desks working on their laptops. Megan speaks, as indicated both by the story line and by her hand which is lifted up, but there is not speech line from her to the text.]\nMegan: We've convinced them to give us time on the Madrid DSN transmitter and hacked the maser to support the uplink. \nMegan: And today's the big day.[Zoom in on Cueball's head and torso, he holds a hand up to his speaker on his head phones and watches his lit screen (as indicated by lines emanating from it).]\nCueball: Transmitting... \nCueball: We have a signal! \nCueball: We have control![Zoom in on Megan's head and torso. She has turned away from Cueball to the right towards Hairbun.]\nMegan: OK, transmit the new comet rendezvous maneuver sequen—\nCueball (off panel): What the hell?\nMegan: What?[Same setting as when Megan and Ponytail entered the control-room, but Ponytail just stands there and Megan puts a hand out towards Cueball.]\nCueball: My console went dead!\nHairbun: Mine too!\nMegan: What's happening?![Another zoom in on Cueball's head and torso and glowing screen. He has both hands down.]\nCueball: There's a new signal going out over the transmitter!\nMegan (off panel): A bug?\nCueball: Someone else is in the system![Zoom in on Hairbun's head and torso. She is also working on her laptop, with the glowing screen visible.]\nHairbun: Kill the connection!\nCueball (off panel): I can't find it!\nHairbun: They're firing the probe's engines!\nCueball (off panel): No!![Back to a zoom in on Cueball. He points at his screen.]\nMegan (off panel): Who's doing this?? Stop them!\nHairbun (off panel): I'm trying!\nCueball: Look! My screen![Same setting as when Megan and Ponytail entered the control-room, but Ponytail has a hand to her mouth and she and Megan stand close to Cueball who has taken his hands off the keyboard. The text on Cueball's laptop screen is shown above the setting, indicated with zigzag lines:]\nM-E-S-S-W-I-T-H-\nT-H-E-B-E-S-TD-I-E-L-I-K-E-\nT-H-E-R-E-S-T[The last four panels is outside night scenes with a black sky above. In the first of these a woman (Burn) with long hair (Megan like) and a hairy man (Crash) is seen in a swimming pool with blue water.][A zoom out reveals that the pool is on top of a skyscraper in a vertically developed, downtown setting with lots of light in all the skyscrapers, one of which is even taller than the one with the pool. From the top of the central skyscraper speech lines come which indicate that the two from the pool is up there speaking, and we get their names from this panel.]\nBurn: Crash?\nCrash: Yeah, Burn?[Same setting but only one speech line.]\nBurn: Make a wish.[The last panel shows the same setting, but with the spacecraft streaking across the sky as it enters the Earths atmosphere and burns up in a way that is indistinguishable from a meteoroid.]"
}