{
  "num": 1352,
  "url": "https://xkcd.com/1352",
  "title": "Cosmologist on a Tire Swing",
  "img": "https://imgs.xkcd.com/comics/cosmologist_on_a_tire_swing.png",
  "alt": "No matter how fast I swing, I can never travel outside this loop! Maybe space outside it doesn't exist! But I bet it does. This tire came from somewhere.",
  "year": "2014",
  "month": "4",
  "day": "7",
  "transcript": "[A tall panel with Cueball and Science Girl walking together through a landscape with three trees in the background and with many small pools of water. Their reflection is showing in the pool nearest to them.]\nScience Girl: What was before the big bang?\nCueball: I think time began with the big bang.\nCueball: So it doesn't make sense to ask what came before it.\nCosmologist (off panel): Look out[The next six panels are between the first tall panel and a similar panel at the end. They should be read from above and down in two columns of three images. The bottom of the first panel at the top is partly hidden by the second panel which is likewise partly hidden by the lower panel, and this repeats in the second column.]\n[A cosmologist looking like Megan comes swinging left past Science Girl and Cueball, who turns to look after her. She sit on an upstanding tire swing and the movement is indicated by two lines going from right to left.}\nCosmologist: Wheeee Hi I'm a cosmologist on a tire swing![The cosmologist swings back right, hanging in her arms with her body almost vertical. The other two also turns right.]\nCosmologist: We don't know whether time[Going left, similar to the first of the small panels.]\nCosmologist: started at the big bang.[Going right, similar to the second of the small panels, but with the cosmologist sitting more upright.]\nCosmologist: It might have![Going left, similar to the first of the small panels.]\nCosmologist: Or maybe not! We don't know!\nCueball: Oh. OK![Going right, similar to previous going right panels.]\nScience Girl: ...Your tire swing looks fun!\nCosmologist: I can't stop![The last panel is again a full panel, with Cueball and Science Girl looking towards the right after the cosmologist who continued the last swing to the right from the last small panel, having just reach the upper part of the curve and has thus turned left to face them, before the swing will go down left again. The background is completely white with no indications of the trees and pools from the first panel.]\nScience Girl: Won't the swing stop on its own?\nCosmologist: I thought it would, but it seems to be accelerating.\nScience Girl: Cosmology sounds pretty confusing.\nCosmologist: Wheeeee!"
}