{
  "num": 136,
  "url": "https://xkcd.com/136",
  "title": "Science Fair",
  "img": "https://imgs.xkcd.com/comics/science_fair.png",
  "alt": "This poster actually inspired a two-hour powerpoint presentation that Al Gore gave around the country.",
  "year": "2006",
  "month": "8",
  "day": "2",
  "transcript": "[Text above the drawing:]\nAlthough it caught me by surprise at the time, looking back I understand why my senior science fair project went over as badly as it did.[A science fair project consisting of eight posters on three pink walls set up for presenting such a project, so it is possible to step in between the walls to read about the project. There are two posters on both the left and the right wall, all four with unreadable text. The three of them clearly has a bolder heading at the top (still unreadable). The last to the right, which has no header, has in stead some kind of drawing or formula in the middle, still unreadable.][The central wall has some readable and discernible parts. The top poster is the title of the project, written in very large letters:]\nThe Mathematics of Cunnilingus  [Below the title poster there are three posters. Two of these are right below one to the left and one to the right, and the last poster below takes up the rest of the wall. The left of the two posters next to each other have a table with three rows and three columns. The text in each box is unreadable, some of the text seems to be formulas though. But above the three columns there are readable legends:]\nf(t);   F(ω);   ℒ(s)[The next poster to the right shows a drawing of a female genitalia with clitoris and both sets of Labia shown. It is displayed on a chart with X and Y axes with ticks (but no labels) and there is a box with three lines of unreadable text/legends.][The last poster at the bottom of the central panel shows four line graphs with what looks like modulated signals or other time-domain signals or functions. These are displayed in two rows/columns to the left. To the right of these there is a readable heading and below that more unreadable text:]\nChallenges in frequency-domain analysis"
}