{
  "num": 1379,
  "url": "https://xkcd.com/1379",
  "title": "4.5 Degrees",
  "img": "https://imgs.xkcd.com/comics/4_5_degrees.png",
  "alt": "The good news is that according to the latest IPCC report, if we enact aggressive emissions limits now, we could hold the warming to 2°C. That's only HALF an ice age unit, which is probably no big deal.",
  "year": "2014",
  "month": "6",
  "day": "9",
  "transcript": "Without prompt, aggressive limits on CO2 emissions, the Earth will likely warm by an average of 4°-5°C by the century's end.\nHOW BIG A CHANGE IS THAT?[A ruler chart is drawn inside a frame.]\nIn the coldest part of the last ice age, Earth's average temperature was 4.5°C below the 20th century norm.\nLet's call a 4.5°C difference one \"Ice Age Unit.\"[A ruler with five main divisions — each again with 3 smaller quarter division markers. Above it the five main divisions are marked as follows with 0 in the middle:]\n-2 IAU  -1 IAU  0 +1 IAU  +2 IAU\n[Next to the 0 marking a black arrow points toward 0.25 on the scale and above it is written:]\nWhere we are today[The rest of the text is below the ruler.]\n[To the far left below -2 IAU a curved arrow points to the left. Below it is written:]\nSnowball earth (-4 IAU)\n[Below -1 IAU a black arrow point toward this division. Below the arrow is written:]\n20,000 years ago\n[Below this an image of a glacier. At the top of the image is written:]\nMy neighborhood:\n[At the bottom of the image is an arrow pointing to the glacier:]\nHalf a mile of ice\n[Below 0 IAU a black arrow point toward this division. Below the arrow is written:]\nAverage during modern times\n[Below this an image of Cueball standing on a green field with a city skyline in the background. At the top of the image is written:]\nMy neighborhood:\nCueball: Hi!\n[Below +1 IAU a black arrow point toward this division. Below the arrow is written:]\nWhere we'll be in 86 years\n[Below this a white image. At the top of the image is written:]\nMy neighborhood:\n[Below this is a very large:]\n?\n[Below +2 IAU a black arrow point toward this division. Below the arrow is written:]\nCretaceous hothouse\n+200m sea level rise\nNo glaciers\nPalm trees at the poles"
}