{
  "num": 1392,
  "url": "https://xkcd.com/1392",
  "title": "Dominant Players",
  "img": "https://imgs.xkcd.com/comics/dominant_players.png",
  "alt": "When Vera Menchik entered a 1929 tournament, a male competitor mocked her by suggesting that a special 'Vera Menchik Club' would be created for any player who lost to her. When the tournament began, he promptly became the first member of said club, and over the years it accumulated a large and illustrious roster.",
  "year": "2014",
  "month": "7",
  "day": "9",
  "transcript": "Dominant players \nover time\n[Below this heading there are three panels with charts showing different players career paths - that is their rating a function of the year. Most of the paths are grey, but some are red (there will be a note for these). Some parts of several paths are dashed. Somewhere on each path the players name will be written curving along so it follows the path. Several places an event or some information is noted and points to a given time on the path. If it is not clear where it belongs an arrow will point to the correct place. Each chart has a heading and for the two last charts there is an explanation. There is no scale on the y-axis (rating) but the x-axis (time) has the years given in ten years interval. A thin line indicates these decades. The years are all written at the top, except the first for the first chart, which is written below, and this year is missing in the bottom chart.]\n[Below the transcript for each chart will follow this order: Heading/sub heading, explanation, time scale, player names with any information for this player, in the order their name appear on the time scale.]\n[Basketball chart:]\nBasketball (NBA/ABA)\nPlayer Efficiency Rating\n1950 1960 1970 1980 1990  2000 2010\n[Red] George Mikan\n[Red] Bob Pettit\nNeal Johnston [Neil misspelled.]\nElgin Baylor\n[Red]  Wilt Chamberlain\nBecomes the first and so far only player to score 100 points in a game\nJerry West\nThe Guy in the NBA logo\n[Red] Kareem Abdul Jabbar [Missing hyphen between the two last names.]\nAirplane\nBob Mcadoo\nJulius Irving [Erving misspelled.]\nMoses Malone\nMagic Johnson\nHIV announcement [A part of the path is dashed after this.]\n[Red] Michael Jordan\nBaseball career [A part of the path is dashed after this.]\nSpace Jam\nSecond retirement [A part of the path is dashed after this.]\nLarry Bird\nKarl Malone\nDavid Robinson\n[Red] Shaquille O'Neal\nKevin Gariett\n[Red] LeBron James\nThe Decision\nDwyane Wade\nKevin Durant[Chess chart.]\nChess\nElo Rating\nThe modern Elo rating system dates back to about 1970.\nComputer analysis (like Kenneth Regan's) lets us rate historical players, but this has only been done rigorously for a few tournaments.\nDashed lines are rough estimates only.\n[All paths are dashed up until the late nineteen sixties:]\n1950 1960 1970 1980 1990  2000 2010\n[The first player has no path, as his time was before 1940. An arrow points toward the left to these earlier times:]\nJosé Capablanca\nTerrifying chess God\n[Red] Alexander Alekhine [His path ends in a starburst.]\n[Red] Mikhail Botvinnik\nTigran Petrosian\nDavid Bronstein\nMikhail Tal\nMikhail Tal [his name is written twice on the path, the second time above Boris Spassky when their paths intertwine.]\n[Red] Bobby Fischer\nVanished… [Text under a starburst.]\nReappeared then vanished again. He had problems. [Text under two starbursts connected with a path. This appears much later than the first starburst.]\nBoris Spassky\nBoris Spassky [his name is written twice on the path, the second time below Mikhail Tal when their paths intertwine.]\nVictor Korchnoi\n[Red] Anatoly Karpov\n[Red] Garry Kasparov\nLoses to Deep Blue\nJudit Polgar\n(See below) [The text is written beneath her name.]\nVladimir Kramnik\nLevon Aronian\n[Red] Magnus Carlsen[Chess (women) chart:]\nChess (women)\nElo Rating\nFor a long time, sexism, a lack of role models, and institutional hostility largely kept women from pursuing serious chess careers.\nWith the expansion of women's tournaments and prizes starting in the 1970s, this has begun to change.\n[All paths are dashed up until the late nineteen sixties.]\n1960 1970 1980 1990  2000 2010\n[Red] Vera Menchik\nDied in a missile attack on London [next to a starburst.]\nSonja Graf\nRating particularly uncertain\nOlga Rubtsova\nElisaveta Bykova\nKira Zvorykina\nKira Zvorykina (born 1919) continued playing in tournaments into the 21st century [Text above Elisvetas path, no arrows.]\nZvorykina [Written on top of the path when her path reappears much later.]\nAlexandra Nicolau\n[Red] Nona Gaprindashvili\nAlla Kushnir\n[Red] Maia Chiburdanidze\nPia Cramling\nPia Cramling [her name is written twice on the path, the second time below the path of Xie Jun after  their paths have intertwined.]\nXie Jun\nXie Jun [her name is written twice on the path, the second time above the path of Pia Cramling after their paths have intertwined.]\nSusan Polgar\nSofia Polgar\n[Red] Judit Polgar\nSisters [The three Polgars are linked by a thin dashed line, snaking between their names.]\nWins a game against Kasparov, making her the first woman to beat the world #1\nBecomes first woman to rank in the overall top 10\nAntoaneta Stefanova\nAnna Muzychuk\nKoneru Humpy [In western style the name should be Humpy Koneru, but the comics version is the native form.]\nHou Yifan"
}