{
  "num": 1409,
  "url": "https://xkcd.com/1409",
  "title": "Query",
  "img": "https://imgs.xkcd.com/comics/query.png",
  "alt": "SELECT * FROM GHOSTS",
  "year": "2014",
  "month": "8",
  "day": "18",
  "transcript": "[The first and then every second part of the comic is drawn without any frames around the panels. They depict Megan with the device she finds. In the first and last of these there are more than one \"panel\" where Megan is drawn more than once without frames between. In between these frameless panels, in all even numbered rows, are a framed picture with an overview of the surroundings.][The first two panels are drawn in the first row.]\n[Megan walks up to device lying on the ground.][Megan picks up a device and looks a the screen. The screen is shown in black with white text and a white bar for her to enter text in.]\nLoaded table: People\nEnter query[Megan looks around and sees nine people nearby: A black haired girl with ponytail talking on he phone; a Cueball-like guy talking to a hairy guy; a group of three people, with Ponytail and another Cueball-like guy sitting, and a Megan-like girl lying on the ground; another hairy guy sitting with an ice cream cone on a big box; Another Ponytail girl leaning up against the box with her phone together with a third Cueball-like guy also with a phone in his hand. The device still shows the last part of the text in white on black, and with room to enter a query]\nEnter query\nMegan: ??[Megan types into the device.  The query is shown as coming from the devices screen:] \nSelect * from people where age > 30[Five people are highlighted in a yellow cloud around their bodies: Black haired ponytail, both guys talking, and the two last of the group of three.][Megan types again:] \nSelect * from people where annual_income > 100000[One person is highlighted in yellow - the one talking to the first Cueball.][Megan types:] \nSelect * from people where afraid_of_flying = True[Four people, including herself, are highlighted in yellow. Also the Megan-like girl on the ground and the last two behind the box.][Megan types:] \nSelect * from people where hours_since_watching_porn < 12[Three people are highlighted. The two girls around the second Cueball and the third Cueball.][The next three panels are drawn on the same row.]\n[Megan looks at the device, while holding it in two hands.]\nMegan: Neat.[Megan holds the device in one hand, still looking at it.]\nMegan: ...[Megan types:] \nDrop table People[Everyone disappears; the items they were holding drop to the ground, including the device Megan has been using. the other devices are three phones and one ice cream cone.]"
}