{
  "num": 1434,
  "url": "https://xkcd.com/1434",
  "title": "Where Do Birds Go",
  "img": "https://imgs.xkcd.com/comics/where_do_birds_go.png",
  "alt": "Water/ice has a lot of weird phases. Maybe asking 'where do birds go when it rains' is like asking 'where does Clark Kent go whenever Superman shows up?'",
  "year": "2014",
  "month": "10",
  "day": "15",
  "transcript": "[The comic is separated into three sections, with Cueball and Megan having a discussion in the first section, websites found through Google search results depicted in the second, and a bird depicted in the third.][First Section - Cueball is sitting at his computer.]\nCueball: \"Where do birds go when it rains?\" is my new favorite Google search.\nMegan [off screen]: Why?Cueball: It gives the answer, but also shows you an endless torrent of other people asking the same question. Pages and pages of them across regions and cultures.\n[Megan enters the frame and shows interest in the computer.]Cueball: I love the idea that somehow this is the universal question, the thing that unites us. When it rains, we wonder where the birds go, and hope they're staying dry.[Second Section - A collage of screen snippets.]from Yahoo! Answers: Where do the birds go when it rains? I've noticed I rarely see birds flying around or in trees or on power lines when it's raining, So where do they go?from Godlike Productions: Where do birds go when it rains really hard?from Random Thoughts From Midlife: Where do the birds go when it rains?from Answers.com: Where do birds go when it rains?from Yahoo! Respuestas: ¿A donde se van los pajaritos cuando llueve?from Active Rain: Where do Birds go When it Rains? I'm no youngster...and I have no answer for this. I've talked to alot of people about the likelihood of where birds go when it rains and everyone has a different perspective.from Ask MetaFilter: Where do the birds go when it rains? BirdFeederFilter: When it's gloomy and rainy, I don't see any birds at my birdfeeder for days on end. Then as soon as it's sunny, they're all over the place. What gives? What do they do on rainy days, just forage near their nest?from Snippets: Where do city birds go when it rains?from http://wenwen.sogou.com/: 下雨时鸟儿往哪躲from eNature.com: Storm shelter In Florida, where I live, we get many thunderstorms, but I never see the birds in trees during the storms. We recently had a tropical storm and I did not see any birds in the trees. Where do birds go when it rains or storms? Just like at night, birds will seek shelter during storms. I remember watching a flock of American robins dive into[...]from Yahoo! Answers: When it is raining heavily, where do the birds go...i don't see them on the trees, where do they take shelter?from Yahoo! Questions Réponses: Où se cachent les oiseaux quand il pleut? De ma fenêtre, je n'en aperçois plus un!!!...Les pies semblent avoir abandonné leurs nids...from gutefrage.net: was passiert jetzt eigentlich mit den vögeln, die bei dem wetter in den bäumen sitzen? bei uns regnet es heftig und der orkanartige wind wechelst ständig richtung und geschwindigkeit. können sich die vögel da in den bäumen halten? retten sie sich instinktiv vorher irgendwohin, wo sie windgeschützt sind?from Yahoo! Answers: Where do birds go when it rains? I never see any out...?from lainformacion.com: ¿Qué pasa con las aves durante un huracán?from Baidu: 下雨的时候小鸟住在哪里？ 下雨的时候小鸟住在哪里？如果是在春天夏天那还好，有树叶遮挡着，但是到了秋天冬天下雨小鸟住在哪里？还住在在树上搭的窝里吗？不怕冻坏自己和小幼崽吗？如果躲雨那就在哪里躲雨呢？怎么没见过它们躲雨？ 谢谢。from Fairfax Underground: What do birds do when it rains? Recently I installed a bird feeder outside my bedroom window. It is so wonderful the diversity of our feathered friends that frequent the feeder! I love it. My question that I haven't found an answer to is this: What do the little birdies do when it rains? I mean, do they stay put in the trees that they find themselves in,from a blog on vuodatus.net: Minne linnut menevät sateella? Tänään satoi rankasti. Kuljin metsän halki. Kuulin linnun laulavan. Yksinäinen, mutta itsenäinen ja vahva, tulkitseva ääni. Kaunis. Minne linnut menevät sateella? En ole koskaan nähnyt lintuja rankkasateessa. Luulen, että ne yrittävät löytää suojan. Kuusien ja mäntyjen oksistossa on varmaan suojaisaa. Kallioiden koloihin ja pieniin luolastoihin voi ehkä lintukin hiipiä. Rohkeille löytyy pihoilta suojapaikkoja. Ehkä linnulla oli oma pesäkolo. Siellä oli lämmintä ja kuivaa. Sieltä saattoi rauhassa katsella sateen vierailua metsässä. Siellä saattoi jopa iloita sateesta ja laulaa.from Yahoo! Answers: What do the birds do when it RAINS like crazy? I live in upstate new york and just moved here and there are so many many birds here especially where I live, the other day I saw a broken egg on the ground in the drive way from a [...show more link] Update: I know they get wet btw but was wondering if they did anything extra to [...show more link] Best Answer Well... it depends on the species of bird, for one. Some are more adapted for rain then others.from Willem Wever: Waar blijven de vogels als het heel hard stormt? Bij hevige stormen zoekt een vogel de beschutting die bij hem past. Er zijn een aantal vogels die met storm wel vliegen. Maar bij een echte hevige storm schuilen [...]from http://wenwen.sogou.com/ 为什么鸟儿下雨的时候在天上飞不会因为淋湿掉下来? 刚刚下很大的雨,却还看到有几只鸟一直在天上飞.为什么鸟儿下雨的时候在天上飞不会因为淋湿掉下来? 补充：有照片的加分from speed guide forums: Where do birds go when it rains? Do they just sit in their trees as it rains getting drenched? Or do they seek shelter?from Google books: Where Do All The Birds Go When It Rains? By Misty Hoopman[Screen snippets begin to noticeably fade to white at this point.]from vimeo: WHERE DO BIRDS GO WHEN IT RAINS? One young magpie will give its own story. Barring the thunder and heavy rain, all the sounds on this movie are from this one young maggie. Amazingfrom Yahoo! Answers: Where do birds go during wind and rain storms? Where do birds go during wind and rain storms?from Yahoo! Answers: Where do birds go when it rains? I mean, they can't keep dry in their nests...They have to go somewhere.from Yahoo! Answers: Burung Dapat Bertahan Terbang Berapa Lama Disaat Hujan?from vogel.info: Was machen Vögel bei schlechtem Wetter? Zunächst mal, was sie nicht machen: Sie verkriechen sich nicht etwa in ihr Nest, denn das Vogelnest dient der Brutpflege, es ist nicht etwa eine Wohnung. Es stellt sich aber ja auch die Frage, was eigentlich unter schlechtem Wetter zu verstehen ist: Es gibt Vögel, die leiden unter zuviel Sonne und[...]from gutefrage.net: Wohin gehen Vögel? Hallo zusammen! Heute als es so richtige Gewitter gab, hab ich mir überlegt wohin alle Vögel verschwinden. Haben alle Vögel Nester in die sie sich zurückziehen können? [link to view complete question.]from Yahoo! Answers: Where do birds go when it rains? Well, yesterday it was raining...I was bored so i started staring out the window, and i say a empty birds nest and i was wondering, where do birds go when it rains?from Diolún Designs Blog: Where do Birds go when it rains or snows?from The Andalusia Star-News: Where do birds go when it rains? I haven’t fed birds in my back yard for a long time, but I still enjoy the few I see perching on top of poles, an electric wire, tree branches, or scooting across the [...]from Bird Ecology Study Group (blog): Where do birds go when it rains? And what do they do then? It has been raining on and off these few weeks and the birds have not been around. Have you ever wondered what happened to them when itfrom Naver Matome: 【雑学】暴風雨の時、鳥はどこに避難してるの？ 人間が歩くのも困難な暴風雨。その時、一番影響を受けるのは空を飛んでいる鳥達ですよね。彼らはどのように風雨を凌いでいるのか？ずーっと気になっていた事を調べてみました！[At this point, at the bottom of the section, screen snippets are extremely faded.]from The Daily Apple: Apple #431: Birds in the Rain\nForgot until late tonight that I meant to make a new post. Since I didn't leave [...]from Yahoo! answers: Where does birds go when it rains?[Third section - A bird on a wire fence.]\n[A bird sits on a wire fence with no rain falling.][Zoomed in on the bird as it looks at a rain drop splashing on the fence wire.][Zoomed out on the bird looking at the rain as it increases in intensity.][The bird flies down to an small smart-phone-shaped object lying on the ground, as the rain increases in intensity even more.][The bird lands on the object, with puddles increasing in size around the object.][The bird pecks at the object, ostensibly typing.] W... H... E... R... E...   D... O...   B... I... R... D... S... "
}