{
  "num": 1485,
  "url": "https://xkcd.com/1485",
  "title": "Friendship",
  "img": "https://imgs.xkcd.com/comics/friendship.png",
  "alt": "The only other Wikipedia vandalism that I would feel zero remorse about is editing the article on active US militia groups to replace \"militia\" with \"fanclub\".",
  "year": "2015",
  "month": "2",
  "day": "11",
  "transcript": "[A Wikipedia style layout is shown for extracts from an article titled Friendship.]Friendship\nFrom Wikipedia, the free encyclopedia\nA Friendship is a close non-romantic relationship between two (or more) men, a form of affectional or homosocial intimacy.[1]\n Contents [hide]\n1 Etymology\n2 Characteristics\n3 Portrayal of friendship\n3.1 Celebrity and fictional friendships\n3.2 Historical and political friendships\n3.3 Gay-straight friendships\n4 See also\n5 References\nEtymology\nFriendship is a portmanteau of the words friend and ship. Editor Dave Carnie coined the term in the skateboard magazine Big Brother in the 1990s to refer to the sort of relationships that develop between skaters who spend\n[...]\nPortrayal of Friendship\nCelebrity and Fictional Friendships\nA number of celebrities have engaged in friendships with fellow celebrities. Examples include Ben Affleck and Matt Damon, described as \"perhaps the pioneering friendship in showbiz history\"[9] which led to a hit off-broadway play\n[...]\nFriendship on television has also become more commonplace, with some critics tracing its origins back to shows such as The Odd Couple.[14] In October 2008, TV Guide placed Gregory House (Hugh Laurie) and James\n[...]\nThe Japanese and Korean music industry actively encourages friendship among male celebrities (particularly members of boy bands) as part of the fan service to please the audience.[19][20]\nIn fiction, what had once been called buddy films have to a degree been rebranded as friendship films, although\n[...]\nHistorical and political friendships\nPolitically, the relationship between Bill Clinton and Al Gore has been called a precursor to the friendship.[6] The relationship between George W. Bush and former press[Below the extracts is this caption:]How to improve the \"Bromance\" Wikipedia article"
}