{
  "num": 1488,
  "url": "https://xkcd.com/1488",
  "title": "Flowcharts",
  "img": "https://imgs.xkcd.com/comics/flowcharts.png",
  "alt": "Whoa, and if you overlay a Fibonacci spiral on a golden spiral it matches up almost perfectly!",
  "year": "2015",
  "month": "2",
  "day": "18",
  "transcript": "[A flow chart. The first option the start box is white text on a black rectangle. The other boxes are rhombuses standing on edge. Except for the first there are always two options going out. Most only have one option coming in, but there are exceptions with two options going in.]\nStart\n[One arrow points to the first real choice.]\n[Below the text on the two options going out from each option will be indented. The top of these two options will be the one to be mentioned first below. Then the chart will be mapped like this going back to the previous unfinished option.]\nDo you like flowcharts?\nYes\nNo\n[Yes goes back where it came from.]\nDo you like line graphs?\nYes\nNo\nData or axis?\nLine\nAxis\n[The line is just a line – but now as the line in a line graph.]\nTime or your happiness?\nTime\nYour happiness\n[These two lines turn into the x and y axis of the line graph.]\nScatter plots?\nYes\nNo\nData or axis?\nData\nAxis\n[The data line turns into the points in a scatter plot.]\nX or Y?\nX\nY\n[These two lines turn into the x and y axis of the scatter plot.]\nHelp charge a battery?\nYes\nNo\nAre you A/C or D/C?,\nA/C\nD/C\nPositive or negative phase?\n+\n-\n[The D/C option also goes to this next option, but directly. This next rhombus looks like a part of a circuit diagram.]\nPositive or negative DC terminal?\n+\n-\n[These two lines goes to the + and – poles of a battery.]\nLike spirals?\nNo\nYes\nTake the path of least resistance?\nNever\nYes\n[Never goes through two resistors and a diode before reaching the point of the Yes option, which then also goes though yet another resistor. Both thus end at the same option, which is also the one that Yes to like Spirals ends up at:]\nDo you like when people find the golden spiral in random images?\nYes, even though it's total BS.\nNo, it's total BS.\n[Yes option takes the chart into a fading line that turns into a golden spiral spanning the whole chart.]\nTired of flowcharts yet?\nNo\nYes, I want to look at something else\n[No takes you back to the start box at the top.]\n[Yes takes you out of the comic and points to the Random button at xkcd.]"
}