{
  "num": 1508,
  "url": "https://xkcd.com/1508",
  "title": "Operating Systems",
  "img": "https://imgs.xkcd.com/comics/operating_systems.png",
  "alt": "One of the survivors, poking around in the ruins with the point of a spear, uncovers a singed photo of Richard Stallman. They stare in silence. \"This,\" one of them finally says, \"This is a man who BELIEVED in something.\"",
  "year": "2015",
  "month": "4",
  "day": "6",
  "transcript": "[All text is in capitals.  At the top of the panel:]\nOperating Systems \nrunning in my house[At the bottom there is time-line that runs from 1990 to 2066. It has small indicators for every year, larger for every 5 years and largest for every 10 years. Below the 10 year indicators are written the years. Also the year 2015 is marked:]\n1990 2000 2010 Now 2020 2030 2040 2050 2060[Bars above the time-line in four levels are labeled with operating system names, representing the time period for that OS. Below is a list of the bars on the time-line in order of first appearance (with approximate year ranges given). Also the level from 1-4 is indicated, with level 1 just above the time-line and level 4 the highest level above the line:][Level 1 from 1988 to 1998 (extends a little left past the beginning of the time-line but not off panel):]\nMS DOS\n[Level 2 from 1993 to 2007:]\nWindows\n[Level 3 from 1994 to 2001:]\nMac OS\n[Level 1 from 1999 to 2018:]\nLinux\n[Level 2 from 2009 to 2023. On the way the bar merges with iOS around 2018 thru 2022:]\nOS X\n[Level 3 from 2009 to 2016:]\nAndroid\n[Level 4 from 2013 to 2022. On the way to 2022 the bar moves down past Android to merge with OS X after 2018:]\niOS\n[Level 1 from 2018 to 2028. The text is written in square brackets:]\n[Something].js\n[Level 3 from 2022 to 2029:]\nTinderOS\n[Level 2 from 2023 to 2032:]\nNest\n[Level 1 from 2028 to 2041:]\nElon Musk Project:\n[Level 3 from 2030 to 2036:]\nDOS, but ironically\n[Level 2 from 2034 to 2041:]\nBlood Drone\n[This is not a bar, but the text (in three lines) is in a double bar-height (level 1-2) square bracket. The bracket extends from 2042 to 2051:]\n[Human civilization ends in fire]\n[Level 1 from 2059 going past the end of the panel past 2066:]\nGNU/Hurd"
}