{
  "num": 1509,
  "url": "https://xkcd.com/1509",
  "title": "Scenery Cheat Sheet",
  "img": "https://imgs.xkcd.com/comics/scenery_cheat_sheet.png",
  "alt": "At the boundary between each zone, stories blend together. Somewhere in the New Mexico desert, the Roadrunner is pursued by a tireless Anton Chigurh.",
  "year": "2015",
  "month": "4",
  "day": "8",
  "transcript": "[Above the frame is the following text.]\nA cheat sheet for\nfiguring out where in the US you are\nby recognizing the background from movies\n(for use by GeoGuessr players and crash-landed astronauts)[In the frame is a map of the mainland USA with the 48 mainland states lined out in thin gray lines. All areas on the map have been enclosed in sections divided by curved black lines. These sections sizes goes from encompassing several states down to just a small section of a single state. The sections cover the entire USA without any holes. There is also one section in the Atlantic Ocean. All sections are labeled. If the section is large enough the text stands inside, if it is too small, the text is outside and an arrow will point to the relevant section[Here below all the text on the map (mainly film titles) will be transcribed from top to bottom and (when possible) by going through the columns that seems to appear in the sections when going from left to right. The State Postal Codes will be used when referring to the states covered by each section][Small section covering the west coast around the state border between WA and OR, which is surrounded on three sides by the next section mentioned below. It is labeled with an arrow:]\nThe Goonies\n[Large section covering WA, OR and top of CA. The section has two titles, with the second one standing with smaller font below the first:]\nTwilight\n50 Shades of Grey\n[Small section around San Francisco, CA:]\nZodiac\n[Very tiny section covering only Alcatraz off the coast of San Francisco, CA. It lies inside section mentioned above. It is labeled with an arrow:]\nThe Rock\n[Large section covering most of MT as well as part of WY, SD and NE. The section has two titles:]\nDances with Wolves\nStarship Troopers\n[Medium section covering most of  ID and part of MT:]\nNapoleon Dynamite\n[Medium section covering part of OR, ID, NV and UT:]\nThe Sandlot\n[Medium section mainly covering the top part of NV:]\nWild Wild West\n[Medium section covering most of NV and small part of CA. The section has two titles, with the second one standing with smaller font below the first plus description:]\nTop Gun \n& the part of Independence Day where Will Smith crashes\n[Small section covering central CA:]\nThat movie about wine & talking\n[Medium section covering a large part of the southern part of CA around Hollywood, Los Angeles:]\nEvery movie with a big budget, explosions or someone who says \"cool!\"\n[Medium section covering half of WY and small parts of UT and CO:]\nBrokeback Mountain\n[Medium section covering part of WY, CO and NE. The part in parenthesis in a smaller font:]\nOregon Trail\n(the only part I ever got to)\n[Large section covering small part of UT and the half bottom of UT and CO and top half of AZ and NM:]\nRoadrunner cartoons\n[Medium section covering a small part of the southern CA and small part of AZ. The part beneath the title in a smaller font:]\nThe Truman Show,\nbut with desert as the background\n[Small part at the bottom of AZ. The section has two titles:]\nTombstone\n& The Mask of Zorro\n[Large section covering the a small part of AZ, the bottom half of NM as well as a third of TX:]\nNo Country for Old Men\n[Large section covering all of ND, most of MN, half of SD and a small part of MT:]\nFargo\n[Medium section covering most of NE and small parts of MN and IA. The section has three titles. The top two are marked with a square bracket to the left. The text of this given before the third title:]\nInterstellar\nStar Trek (2009)\n] Earth parts\nField of Dreams\n[Medium section covering large parts of IA, MO and IL:]\nThe Music Man\n[Medium section covering mainly KS, but also a small part of Co and OK:]\nThe Wizard of Oz\n[Medium section covering most of OK and small part of MO and AR:]\nTwister\n[Medium section covering the top part of TX and small parts of OK and AR:]\nTrue Grit\n[Large section covering a third of TX  (the eastern part all the way down) and small parts of AR and LA. The section has three titles:]\nOffice Space\nDazed and Confused\nKill Bill\n[Small section around and below Chicago, IL, which is surrounded on three sides by the next large section mentioned below. It is labeled with an arrow:]\nBlues Brothers\n[Very small section almost a circle centered around Detroit, MI completely inside the section here below. It is labeled with an arrow:]\n8 Mile\n[Large section covering all of WI, MI, IN and OH as well as parts of IL and KY. That is except for the two small sections described above, which are inlaid in this one. There are two items in this section. The one below is in smaller font:]\nA Christmas Story\n&That song about Jack and Diane\n[Medium section covering half of AR, small parts of IL and MO as well as bits of  KY, TN and MS:]\nAnything by Mark Twain\n[Medium section covering half of TN and part of KY:]\nWalk the Line\n[Large section covering all of AL most of MS and half of GA. There are two titles in this section:]\nBig Fish\nO Brother Where Art Thou\n[Small section covering top of LA and small part of MS:]\nDuck Dynasty\n[Medium section covering the bottom half of LA and the very bottom of MS. There is a very small section at the bottom of LA that are not included in this but in the next. There are two titles in this section:]\nPrincess and the Frog\nAll Dogs go to Heaven\n[Small section covering the very eastern end of the bottom of LA – maybe including New Orleans. It is labeled with an arrow:]\nBeasts of the Southern Wild\n[Medium section covering half of PA and western part NY:]\nGroundhog Day\n[Small section covering the middle part of VA as well as small parts of PA, MD and WV:]\nDirty Dancing\n[Medium section covering most of WV, half of TN, a small parts of KY as well as tiny bits of VA, NC and GA:]\nOctober Sky\n[Large section covering all of SC, most of NC as well as half of VA and GA. There are two titles in this section:]\nGone with the Wind\nForrest Gump\n[Large section covering most of FL except the bottom part which are covered by the next two sections:]\nThe Truman Show\n[Small section covering the very bottom of FL except the east coast. It is labeled with an arrow:]\nAdaptation\n[Small section covering the very bottom the east coast of FL. It is labeled with an arrow:]\nMiami Vice\n[Small section covering most of the top of VT and a small part of NY. It is labeled with an arrow:]\nSuper Troopers\n[Small section covering the central part of NY.]\nMy Side of the Mountain (book)\n[Small section covering the eastern part of NY, western part of MA, top part of CT as well as bits of VT and RI.:]\nWar of the Worlds (2005)\n[Small section covering the eastern part of PA and small bits of NY and MD. There are two titles in this section:]\nSigns\n& The Village\n[Medium section covering several large cities of the east coast including New York City, Philadelphia and Washington, DC. It covers most of DE and NJ and large parts of MD (with DC) and the bit of NY with the city. The text is not a title and the it is written in square brackets…:]\n[Generic city]\n[Small section covering the east coast along VA and NC, but also with small bits of MD and DE at the top:]\nDeep Impact\n[Medium section covering all of ME, the top tip of NH and eastern top of VT:]\nPet Semetary\n[Small section covering the most of the bottom parts of NH and VT:]\nWhat about Bob\n[Very small section surrounding Boston in MA. It is labeled with an arrow:]\nThe Departed\n[Small section covering the east coast along MA, RI, CT and NJ:]\nJaws\n[Large section off the east coast in the Atlantic Ocean:]\nThe Hunt for Red October"
}