{
  "num": 1515,
  "url": "https://xkcd.com/1515",
  "title": "Basketball Earth",
  "img": "https://imgs.xkcd.com/comics/basketball_earth.png",
  "alt": "How many points do you get for dunking every basketball in existence at once?",
  "year": "2015",
  "month": "4",
  "day": "22",
  "transcript": "[Cueball is standing next to a floating Basketball Earth indicating it with his left hand. The continents are clearly visible as seen from above the Atlantic Ocean. This remains the same all through the comic, except that the Basketball Earth rotates a bit from frame to frame.]\nCueball: If the Earth were the size of a basketball,[Cueball is now indicating, with his right hand, a small pockmarked moon (also floating), in the correct proportions (regarding size not for their distance) to the Basketball Earth, which is on his other side. Black Hat walks into the panel towards Earth.]\nCueball: The Moon would be—\nBlack Hat: Hey, cool![Black Hat is touching the Basketball Earth with a digit.]\nCueball: Um.[In the next scene we see a megatsunami on the verge of crashing down onto a coastal city with skyscrapers. The A's are cut of on each side of the panels frames, i.e. they begin outside and finishes outside the frame.]\nAAAAAAAA[Back to Cueball standing with the Basketball Earth in the same position as the first panel.]\nCueball: Let's try that again. If the Earth were the size of a basketball,[Same situation as when Black Hat walked in, except now it is Megan that walks into the frame towards the Basketball Earth holding a sports water bottle.]\nCueball: The Moon would be—[Megan squirts the Basketball Earth with the liquid in her water bottle while Cueball just stands watching with the Moon behind him].[Megan just walks away while Cueball stares at his \"water\" Basketball Earth where the continents have disappeared completely beneath the liquid.][Back to Cueball standing with the Basketball Earth in the same position as the first panel.]\nCueball: If the Earth were the size of a basketball,[Same situation as when Black Hat walked in, except now he spots a cat coming into the frame from the left.]\nCueball: The Moon— would…[While Cueball watches with the Moon behind him, the cat jumps at the Basketball Earth.]\nCat: Mrowl![Cueball continues to watch while the cat rolls around playing with the Basketball Earth as if it was a ball of yarn.]\nCat: Rrrrr[Back to Cueball standing with the Basketball Earth in the same position as the first panel.]\nCueball: If the Earth were the size of a basketball,[Same situation as when Black Hat walked in, except this time it is Ponytail who enters the frame at a run coming from the left.]\nCueball: The Moon would, uh…[While Cueball watches with the Moon behind him, Ponytail has grabbed the Basketball Earth and is dribbling it out of the frame, still running.][Zoom out from Cueball who continues to watch while Ponytail reaches a basketball hoop and jump towards it with the Basketball Earth, obviously in an attempt to make a slam dunk.]"
}