{
  "num": 1518,
  "url": "https://xkcd.com/1518",
  "title": "Typical Morning Routine",
  "img": "https://imgs.xkcd.com/comics/typical_morning_routine.png",
  "alt": "Hang on, I've heard this problem. We need to pour water into the duct until the phone floats up and ... wait, phones sink in water. Mercury. We need a vat of mercury to pour down the vent. That will definitely make this situation better and not worse.",
  "year": "2015",
  "month": "4",
  "day": "29",
  "transcript": "[The panel is completely black, with white text. Small lines indicate from where the two voices are coming, and also from where the alarm goes off. A small broken square surrounds the first word spoken.]\nAlarm: Bleep Bleep\nVoice (right): Urgh\nVoice (left): Your alarm is going off\nVoice (right): Huh?\nVoice (left): Make it stop.\nVoice (right) Urrgh[The panel is completely black, with white text. Small lines indicate from where the two voices are coming. Several small lines surrounds the last \"sound\" which is not spoken. The alarm noise is continued from the previous panel and continues over the top of the frame directly into the next panel.]\nAlarm: Bleep Bleep Bleep B\nVoice (left): Hit snooze.\nVoice (right): I'm trying. I closed the alarm app and I can't... I'll just pop out the battery.\nVoice (right): Whoops!\nClang[The lights have turned on so it is now a white panel with black text. The voice to the right came from Hairy with morning hair. He is leaning over the side of the bed, looking down the air vent through which he has dropped the phone. The other person to the left is not shown. The alarm noise (now coming from the air vent as visualized by the lines coming out of the vent) still continues from the previous panel and continues over the top of the frame directly into the next panel.]\nAlarm: eep Bleep Bleep Ble\nOff-Screen voice: Make it stop!\nHairy: It... fell down the vent.[Hairy is sitting in his bed with a laptop. The person to the left is still off-screen. The alarm noise still continues from the previous panel and continues over the top of the frame out of the comic the the right.]\nAlarm: ep Bleep Bleep Bleep Ble\nOff-Screen voice: Can you brick it remotely?\nHairy: Trying... I think I fumbled it into airplane mode?\nOff-Screen voice: The battery could last for weeks.\nHairy: You know, maybe we should just move."
}