{
  "num": 1535,
  "url": "https://xkcd.com/1535",
  "title": "Words for Pets",
  "img": "https://imgs.xkcd.com/comics/words_for_pets.png",
  "alt": "Seventh year: Perfectly coherent words, but in the pet's language, not mine.",
  "year": "2015",
  "month": "6",
  "day": "8",
  "transcript": "[Caption above the frame:]\nWords I use to refer to a pet over the years I live with it:[Inside the box are four diagrams. Each diagram contains three elliptical sections containing the previous one, each section is drawn identical from diagram to diagram and they are labeled the same way from diagram to diagram. A fourth section (a red ellipse) moves from diagram to diagram and its label changes from diagram to diagram.][The red section of the first diagram mainly overlaps the innermost section, but about a third of it is in the second section. The labels are written above the three white sections and then inside the red section. The labels from inside and out and last the label of the red section:]\nThe pet's name \nWords related to the pet\nCoherent words of any kind\nFirst year[The red section of the second diagram mainly overlaps the right part of the second section, but it just touches both the first and the third section. The labels are written above the three white sections and then inside the red section. The labels from inside and out and last the label of the red section:]\nThe pet's name \nWords related to the pet\nCoherent words of any kind\nSecond year[The red section of the third diagram mainly overlaps the right part of the third section, but about a third of it is inside the second section and a small part is outside of the third section. The labels are written above the three white sections and then inside the red section. The labels from inside and out and last the label of the red section:]\nThe pet's name \nWords related to the pet\nCoherent words of any kind\nThird year[The red section of the fourth diagram is completely outside the third section and has to be so far to the right, that the other sections has been moved from the center of the frame to the left. The labels are written above the three white sections and then inside the red section. The labels from inside and out and last the label of the red section:]\nThe pet's name \nWords related to the pet\nCoherent words of any kind\nFourth year onward"
}