{
  "num": 1576,
  "url": "https://xkcd.com/1576",
  "title": "I Could Care Less",
  "img": "https://imgs.xkcd.com/comics/i_could_care_less.png",
  "alt": "I literally could care less.",
  "year": "2015",
  "month": "9",
  "day": "11",
  "transcript": "[The first three panels are slim compared to the next row below, and they only takes up the same space as the first two of the three panels below this row. Similarly the bottom row, also with three panels, take up less space, although more than the top row. But in this bottom row the empty space in the comic is to the left vs. to the right in the top row.][Megan and Ponytail are walking together, Megan in front holds her arms out to the side.]\nMegan: ...Anyway, I could care less.[Zoom in on Ponytail holding up her hand (which can atypically be seen), finger pointing up.]\nPonytail: I think you mean you couldn't care less. Saying you could care less implies you care at least some amount.[Back to Megan and Ponytail walking, both have their arms down.]\nMegan: I dunno.[The next panel supposed to be to the right of this is missing, instead the comic jumps to the next row. This fourth panel has inverted brightness, with a white Megan floating in a black void, with white text above her.]\nMegan: We're these unbelievably complicated brains drifting through a void, trying in vain to connect with one another by blindly flinging words out into the darkness.[Back to Megan and Ponytail walking.]\nMegan: Every choice of phrasing and spelling and tone and timing carries countless signals and contexts and subtexts and more, \nMegan: and every listener interprets those signals in their own way. \nMegan: Language isn't a formal system. Language is glorious chaos.[Zoom in on Megan's head.]\nMegan: You can never know for sure what any words will mean to anyone. \nMegan: All you can do is try to get better at guessing how your words affect people, so you can have a chance of finding the ones that will make them feel something like what you want them to feel. \nMegan: Everything else is pointless.[They have stopped walking as Megan holding a hand out has turned around facing Ponytail.]\nMegan: I assume you're giving me tips on how you interpret words because you want me to feel less alone. \nMegan: If so, then thank you. \nMegan: That means a lot.[Megan and Ponytail resume with their walking.]\nMegan: But if you're just running my sentences past some mental checklist so you can show off how well you know it, [Megan and Ponytail continue walking.]\nMegan: then I could care less."
}