{
  "num": 1584,
  "url": "https://xkcd.com/1584",
  "title": "Moments of Inspiration",
  "img": "https://imgs.xkcd.com/comics/moments_of_inspiration.png",
  "alt": "Charles, I just talked to John and Mildred, who run that company selling seeds and nuts, and their kids with MOUTHS are starving!",
  "year": "2015",
  "month": "9",
  "day": "30",
  "transcript": "[Isaac Newton, with curly long hair, sits under a tree. A waning crescent moon can be seen. An apple falls and hits him on the head. There is a caption in a frame that breaks the top border of the main frame:]\nIsaac Newton\nApple falling: Bonk\nIsaac Newton: Ow![Isaac Newton rubs his sore head.]\nIsaac Newton: Aha![Cueball throws a baseball towards Lise Meitner with short dark hair. (The ball can be seen in the next frame). She turns towards him too late to react and completely fails to even try catching the ball. There is a caption in a frame that breaks the top border of the main frame:]\nLise Meitner\nCueball: Hey Lise! Think fast!\nBall hitting something (off-screen): Crash[Lise takes her hands to her mouth and she watches the broken porcelain atom lying in two pieces on the floor where it has fallen of a desk. On the desk three other intact atoms can be seen. The baseball lies behind her.]\nLise Meitner: Oh no! My collection of porcelain atoms!\nLise Meitner:...Hmm.[Four kids are standing in front of Megan and Charles Darwin (with a big beard and hair behind the ears). All the kids are trying to drink a glass of soda with a straw in them. The first kid is a boy with dark flat hair and sips soda through the straw with his mouth. The next kid is a boy with standing black hair, he tries in wain to drink with his beak open on each side of the glass. The third kid is a girl with her hair in a bun. She tries to get her beak into the glass which she has put on the floor. The last kid is a boy version of Cueball who slurps his soda through the straw. There is a caption in a frame that breaks the top border of the main frame:]\nCharles Darwin\nMegan: I gave our kids soda, but the ones with beaks always have trouble drinking it.\nCharles Darwin: I've noticed that...\nBoy with flat dark hair: Sip sip\nBoy with standing black hair and a beak: Crunch\nGirl with her hair in a bun and a beak: Peck peck\nCueball like kid: Sluurp[A hairy guy is standing in front of Albert Einstein (with wild hair and a moustache), who is holding one hand to his head and has a clock in his other hand. Behind them is a train, with a locomotive at the front and a wagon behind that stretches beyond the frame. Another hairy guy has his head out of the front window of the wagon and is flashing a light towards the other two. In the next three windows can be seen passengers, two with Cueball like heads and one with hair. There is a caption in a frame that breaks the top border of the main frame:]\nAlbert Einstein\nAlbert Einstein: I wish your twin brother would stop shining lights at us from that train. I can barely see my clock!\nAlbert Einstein: ...Wait!"
}