{
  "num": 1606,
  "url": "https://xkcd.com/1606",
  "title": "Five-Day Forecast",
  "img": "https://imgs.xkcd.com/comics/five_day_forecast.png",
  "alt": "You know what they say--if you don't like the weather here in the Solar System, just wait five billion years.",
  "year": "2015",
  "month": "11",
  "day": "20",
  "transcript": "[A grid with six rows of five columns, where each row is labeled to the left. For each of the 30 squares a temperature is given in Fahrenheit at the top left. The rest of the square represents the weather as in a weather forecast (or some other relevant items for the comic), mainly in bright colors. Below are the six labels given above each of their five weather symbols with temperature given below these symbols description.]Your 5-day forecast\n[A bright yellow sun.]\n38°F\n[A grey cloud.]\n41°F\n[A grey cloud with six lines of blue raindrops below.]\n36°F\n[A grey cloud in front of a yellow sun.]\n40°F\n[A bright yellow sun.]\n44°FYour 5-month forecast\n[A bright yellow sun.]\n38°F\n[A green Christmas tree with red presents beneath it.]\n29°F\n[A grey cloud with four snowflakes below.]\n21°F\n[A grey cloud with four snowflakes below.]\n24°F\n[A grey cloud.]\n35°FYour 5-year forecast\n[A bright yellow sun.]\n38°F\n[A grey cloud.]\n25°F\n[A bright yellow sun.]\n36°F\n[A grey cloud with six lines of blue raindrops  below.]\n37°F\n[A bright yellow sun.]\n41°FYour 5-million-year forecast\n[A bright yellow sun.]\n38°F\n[A bright yellow sun.]\n52°F\n[A grey cloud.]\n40°F\n[Two red flying saucers (with bright domes) are shooting energy beams downwards. One of the beams seems to impact with something at the bottom of the panel, which then explodes. Two plumes of smoke rises up from below, drifting to the right.]\n275°F\n[A grey cloud in front of a yellow sun.]\n40°FYour 5-billion-year forecast\n[A bright yellow sun.]\n38°F\n[A larger orange sun.]\n105°F\n[A very large red sun.]\n371°F\n[A pale yellow panel with no drawing.]\n71,488,106°F\n[A night sky with many bright stars.]\n-452°FYour 5-trillion-year forecast\n[A bright yellow sun.]\n38°F\n[A night sky with many bright stars.]\n-452°F\n[A night sky with many stars.]\n-452°F\n[A night sky with fewer not so bright stars.]\n-452°F\n[A night sky with few dim stars.]\n-453°F"
}