{
  "num": 1612,
  "url": "https://xkcd.com/1612",
  "title": "Colds",
  "img": "https://imgs.xkcd.com/comics/colds.png",
  "alt": "The contagious period ends right around when you start to sound sick over the phone, which is probably evidence of cold viruses evolving to spread optimally in the workplace.",
  "year": "2015",
  "month": "12",
  "day": "4",
  "transcript": "[A graph is shown with two curves. The Y-axis indicated how you feel, with three levels indicated with small ticks on the inside of the axis. These are labeled to the left of the Y–axis. The X-axis gives the time. The unit is given (days written in gray text) to the left and then the number of days are noted below the axis for each of the eight ticks on the inside of the axis. Both curves begin at the lowest level just off the Y-axis. One curve, indicating how bad you feel, rises rapidly, reaching its maximum in less than two days only to fall off almost as rapidly, ending up on an even lower level than it began with before day 5. The other curve, indicating how bad you sound, start out by staying constantly low, first rising on day 3, when the first curve are drooping down. They cross between day 3 and 4, and first then does the second curve rise, reaching its max around day 5, not as high a maximum  as the first curve, but it stays up longer, falling only moderately off even after day 8, where it reaches the middle level on the Y-axis. Above the two curves are two line intervals that indicated when you need sympathy and when you get it. This text is written on the broken line. All this is in gray text. Below the X-axis are the symptoms listed for the different time period. These are written in white inside gray rectangles. The rectangles are a different length depending on how many days they last. And they are in two layers.][Y-axis:]\nThe worst\nBad\nFine[The X-axis, with the unit written in gray just below Fine from the Y-axis:]\nDays: 0 1 2 3 4 5 6 7 8[Labels for curves:]\nHow bad you feel\nHow bad you sound[Gray text on the two gray lines above:]\nNeed sympathy\nGet sympathy[Text in white on gray below, first the three to the left (one above two below), then the two to the right one above the other:]\nSkin crawling\nSore throat\nAching\nCough\nHoarsenessThe worst part about colds"
}