{
  "num": 1613,
  "url": "https://xkcd.com/1613",
  "title": "The Three Laws of Robotics",
  "img": "https://imgs.xkcd.com/comics/the_three_laws_of_robotics.png",
  "alt": "In ordering #5, self-driving cars will happily drive you around, but if you tell them to drive to a car dealership, they just lock the doors and politely ask how long humans take to starve to death.",
  "year": "2015",
  "month": "12",
  "day": "7",
  "transcript": "[Caption at the top of the comic:]\nWhy Asimov put the Three Laws\n of Robotics in the order he did.[Below are six rows with first two frames and then a label in color to the right. Above the two column of frames there are labels as well. In the first column six different ways of ordering the three laws are listed. Then the second column shown an image of the consequences of this order. Except in the first where there is a reference. The label to the right rates the kind of world that order of the laws would result in.][Labels above the columns.]\nPossible ordering\nConsequences[The six rows follows below. First the text in the first frame, then a description of the second frame, including possible text below and finally the colored label.][First row:]\n1. (1) Don't harm humans\n2. (2) Obey Orders\n3. (3) Protect yourself\n[Only text in square brackets:]\n[See Asmiov’s stories]\nBalanced world[Second row:]\n1. (1) Don't harm humans\n2. (3) Protect yourself\n3. (2) Obey Orders\n[Megan points at a mars rover with six wheels, a satellite disc, an arm and a camera head turned towards her, what to do.]\nMegan: Explore Mars!\nMars rover: Haha, no. It’s cold and I’d die.\nFrustrating world[Third row:]\n1. (2) Obey Orders\n2. (1) Don't harm humans\n3. (3) Protect yourself\n[Two robots are fighting. The one to the left has six wheels, a tall neck on top of the body, with a head with what could be a camera facing right. It has something pointing forward on the body, which could be a weapon. The robot to the right, seems to be further away into the picture. (it is smaller with less detail). It is human shapes, but made op of square structures. It has two legs and two arms, a torso and a head. It clearly shoots something out of it’s right “hand”. This shot seems to create an explosion a third of the way towards the left robot. There are two mushroom clouds from explosions behind both robots (left and right). Between them there are one more explosion up in the air close to the left robot, and what looks like a fire on the ground right between them. Furthermore there are two missiles in the air, one above the head of each robot. Lines indicate their trajectory. There is not text.]\nKillbot hellscape[Fourth row:]\n1. (2) Obey Orders\n2. (3) Protect yourself\n3. (1) Don't harm humans:\n[Exactly the same picture as in row 3.]\nKillbot hellscape[Fifth row:]\n1. (3) Protect yourself\n2. (1) Don't harm humans\n3. (2) Obey Orders\n[Cueball is standing in front of a car factory robot, that is larger than him. It has a base, and two parts for the main body, and then a big “head” with a small section on top. To the right something is jutting out, and to the left in the direction of Cueball there is an arm in three sections (going down, up and down again) ending in some kind of tool close to Cueball.]\nCar factory robot: I'll make cars for you, but try to unplug me and I’ll vaporize you.\nTerrifying standoff[Sixth row:]\n1. (3) Protect yourself\n2. (2) Obey Orders\n3. (1) Don't harm humans:\n[Exactly the same picture as in row 3 and 4.]\nKillbot hellscape"
}