{
  "num": 1621,
  "url": "https://xkcd.com/1621",
  "title": "Fixion",
  "img": "https://imgs.xkcd.com/comics/fixion.png",
  "alt": "My theory predicts that, at high enough energies, FRBs and perytons become indistinguishable because the detector burns out.",
  "year": "2015",
  "month": "12",
  "day": "25",
  "transcript": "[Caption above the panel:]\nA Christmas gift for physicists:\nThe Fixion\nA new particle that explains everything[A chart resembling a Feynman diagram is shown. It begins with a solid line coming down at the top, going a little to the left. The line continues downwards all the time, but changes direction 16 times before exiting at the bottom almost straight under the starting point. At every point where it changes direction, there is some kind of “interaction” with something outside this line. There are 19 phrases, 10 on the left and 9 on the right. 11 of these are distinct labels for points on the line as 14 gray curved arrows points between these 11 phrases to specific points on the line. Three of the phrases on the left has two arrows pointing to two different, but close, parts of the line. The main central line is solid all the way, except at the very bottom, where it “disappears” inside a hole only to “reappear” later from a similar hole. Between these two holes the line is dotted. The lines going away (or to) the main line can be straight and solid, straight and dotted, wavy lines (with different waviness), even looking like a spiral. Two straight solid lines ends up at two space probes, and finally the last two straight solid lines coming in (and out) on either side of the “hole” in the line has arrow pointing in and out. Below the phrases will be listed in reading order, taking one on each side alternatingly. Above each is described if there are any arrow and, if there are, what they points at.][Left: Arrow pointing to the very first part of the main line:]\nMain component of dark matter[Right: Arrow pointing to the very first part of the main line, but below the previous arrow:]\nConfines quarks and gluons[Left: Arrow points to the first solid line going left and upwards:]\nNeutralizes monopoles[Right: No arrow:]\nSuppresses antimatter in early universe[Left: Two arrows points to two dotted lines going out left and downwards below the first solid line:]\nSpontaneously emits dark energy[Right: Arrow pointing to several lines going almost parallel with the main line. The first line closest to the arrow is not connected with the main line. It bends closer to the other lines in the middle. The next line is connected to the main line, and is thus actually two lines going in to the main line. The same goes for the inner line, where there is some distance between the entry and exit, as the middle of these three lines connect to the main line in between. In principle there are four lines going in/out and one not connected, but it looks like three lines:]\nMediates proton decay but then hides it[Left: One arrow points to the first wavy line (7 peaks) coming out and up towards the dotted lines above. A second arrow points further down the main line where there are three more wavy lines coming out, but to the right, they are all of the same length and go almost straight right, only a little down. The first has as short a wave length as the line above to the left, but as it is shorter it only has 6 peaks. Then the wavelength decreases to a very long one for the last, 5 peaks and then 3 peaks. The arrow points almost where the middle wavy line exits the main line:]\nIntroduces dispersion in perytons from kitchen microwaves, explaining fast radio bursts[Right: An arrow point to the part of the main line between the three parallel lines and the first wavy line:]\nBroken symmetry causes ϴ=0, explaining unobserved neutron dipole moment[Left: No arrow:]\nCauses alpha effect[Right: No arrow, but right next to the middle of the three wavy line:]\nCovers naked singularities[Left: An arrow points to a spiraling line going upwards to the left:]\nIntercepts certain gravitational waves before they're observed.[Right: No arrow, but right next to the bottom of the three wavy line:]\nCauses coronal heating[Left: No arrow:]\nHiggs-ish[Right: A long arrow point to the point of the main line just below the line pointing to the bottom (and left) of the space probes:]\nSuperluminally smooths anisotropies in early universe (but adds faint polarization for BICEP3 to find)[Left: One arrows point towards the point on the main lines where a solid line goes to the right and up and another arrow points on another solid line going away from the main line towards left and down. At the end of both lines are drawn spacecrafts with satellite dish and solar panels:]\nAccelerates certain spacecraft during flybys[Right: No arrow, but right next to the solid line with an arrow going into the main line just before the first hole where the main line disappears and becomes dotted:]\nTriggers Siberian sinkholes[Left: No arrow:]\nMelts ice in \"Snowball Earth\" scenario[Right: Arrow points to the dotted part of the main line between the two holes:]\nTransports neutrinos faster than light, but only on certain days through one area of France[Left: No arrow but the last solid line, with an arrow pointing left, that is going away from the main line, point almost directly at it:]\nSuppresses sigma in experiments"
}