{
  "num": 1633,
  "url": "https://xkcd.com/1633",
  "title": "Possible Undiscovered Planets",
  "img": "https://imgs.xkcd.com/comics/possible_undiscovered_planets.png",
  "alt": "Superman lies near the bird/plane boundary over a range of distances, which explains the confusion.",
  "year": "2016",
  "month": "1",
  "day": "22",
  "transcript": "[Caption above the chart.]\nPossible Undiscovered Planets\nin our Solar System\nBy size and distance (from me)[A chart of possible undiscovered planets with a log-log plot, with the objects diameter on the y-axis and the distance from “me” (Randall) on the X-axis. Both axes are labeled and have several ticks most of which also have labels. A region to the right, with possible new planets including Planet 9 with a “?”, is shaded light red, and a small rectangle at the top left with the same color tells what this color means. The region, of undiscovered dwarf planets, is shaded pink, also to indicate that here may be more of these, but the lighter color indicate that these will not be new “planets”. The eight known planets are marked with a black dot, and also this is explained with a dot under the colored rectangle. The Moon is indicated with a similar dot, but in gray, and the name is in brackets. The chart itself is divided into several labeled regions, the smallest with the label outside and an arrow pointing in. In one case a label breaks a border, and in two regions there are more labels, although these clearly belong to different regions within these regions, with different sizes and/or distances.][Y-axis, with a label written to the left, from bottom and up, with an arrow pointing up, and 15 ticks with a label each:]\nDiameter\n1 mm\n1 cm\n10 cm\n1 m\n10 m\n100 m\n1 km\n10 km\n100 km\n1,000 km\n10,000 km\n100,000 km\n106 km\n107 km\n1 AU[X-axis, with a label written below, with an arrow pointing right, and 17 ticks but only 11 labels as the ticks at 100 km, between 1000 and 106 km, 107 km as well as 10 and 1000 AU is not labeled:]\nDistance from me\n10 cm\n1 m\n10 m\n100 m\n1 km\n10 km\n1000 km\n106 km\n1 AU\n100 AU\n10,000 AU[At the top left of the chart is the light-red rectangle and the black dot labeled:]\nPossible undiscovered planets\nKnown planets[Going down and anti-clockwise from these two labels, the rest of the chart is transcribed:]\nPlanets ruled out because I would be inside them\nEarth\nPlanets ruled out because I would have noticed them above my house\nPlanets ruled out because they wouldn’t fit through my door\nBirds that got into my house\nSkin flora\nBugs\n(Not planets)\nGiant bugs\nPlanets which are actually birds\nAirplanes\n(Fool’s planets’)\nSpace junk\nComets and asteroids\nOort cloud\nSatellites\nStuff we can see through telescopes\nPlanets we can see at night\n(Moon)\nDwarf planets\nPlanet Nine?\n?\nPlanets ruled out by the WISE survey\nPlanets ruled out because we would see them during the day"
}