{
  "num": 1653,
  "url": "https://xkcd.com/1653",
  "title": "United States Map",
  "img": "https://imgs.xkcd.com/comics/united_states_map.png",
  "alt": "It would be pretty unfair to give to someone a blank version of this map as a 'how many states can you name?' quiz. (If you include Alaska and Hawaii, you should swap the Aleutian Islands with the Hawaiian ones.)",
  "year": "2016",
  "month": "3",
  "day": "9",
  "transcript": "[A white map with an outline that closely resembles that of the mainland of the United States of America with gray all around the black border. But on closer inspection most of the states do not look right. The 48 mainland states are all there, however, with their name or abbreviations written on them as a label in gray text. But they have all been shuffled around and then reassembled as a jigsaw puzzle in the same shape as USA. The name labels for most of the states have been rotated, often to follow the new rotation of the state in the map. So some are written upside down or have been rotated 90 degrees clockwise or counter clockwise or even somewhere in between. One state, Michigan, has even been split up in two so there are 49 instead of 48 labels. For the states that have been named only with state abbreviations the full name is written in brackets behind the transcript of the abbreviation. Here below all the states are listed approximately in columns going from the top left and down and then moving right to the next column across the map. Any rotation of the text from normal is noted in brackets behind the name.]\nOhio [Upside down]\nGeorgia [Upside down]\nMichigan [Upside down – but only bottom part]\nMD [Upside down - Maryland]\nCalifornia [Text not rotated, but state is rotated counter-clockwise]\nKansas [Upside down]\nPennsylvania [Rotated clockwise]\nOklahoma [Rotated clockwise]\nNew Mexico\nNebraska [Upside down]\nSouth Dakota\nColorado [Rotated counter clockwise]\nWyoming [Rotated counter clockwise]\nUtah [Text normal, but state is upside down, i.e. the text is upside down in the state]\nAlabama\nMA [Rotated counter clockwise – Massachusetts]\nVirginia [Rotated counter clockwise]\nArizona [Rotated counter clockwise]\nWashington [Rotated counter clockwise]\nMontana [Rotated clockwise - but the state is rotated counter clockwise, i.e. the text is upside down in the state]\nNew York\nMinnesota [Upside down]\nTexas [Upside down]\nCT [Rotated clockwise –Connecticut]\nMissi- \nssippi [Rotated clockwise - text split with hyphen]\nNevada\nIdaho [Rotated clockwise]\nSouth Carolina [Rotated counter clockwise, by more than 90 degrees, but the state is rotated exactly 90 degrees]\nMissouri [Upside down]\nWisconsin [Upside down]\nKentucky  [Rotated clockwise]\nNorth Dakota [Rotated clockwise]\nFlorida [Rotated counter clockwise, by more than 90 degrees, but the state is rotated exactly 90 degrees]\nNorth Carolina [Rotated clockwise]\nIndiana\nRI [Label below in the ocean –Rhode Island]\nOregon [Rotated clockwise]\nIowa\nTennessee [Upside down]\nIllinois\nMaine [Upside down]\nNH [New Hampshire]\nMI (upper) [Rotated 45 degree counter clockwise – Michigan but only upper part]\nArkansas\nNJ [New Jersey]\nLouisiana [Rotated 45 degree counter clockwise - but the state is rotated exactly 90 degrees]\nWest Virginia [Rotated 45 degree clockwise]\nDE [Rotated counter clockwise – label to the right in the ocean – Delaware]\nVT [Upside down –Vermont]"
}