{
  "num": 1672,
  "url": "https://xkcd.com/1672",
  "title": "Women on 20s",
  "img": "https://imgs.xkcd.com/comics/women_on_20s.png",
  "alt": "I get that there are security reasons for the schedule, but this is like the ONE problem we have where the right answer is both easy and straightforward. If we can't figure it out, maybe we should just give up and just replace all the portraits on the bills with that weird pyramid eye thing.",
  "year": "2016",
  "month": "4",
  "day": "25",
  "transcript": "[Cueball is sitting at his laptop. Above him is the text he reads on the screen, then he speaks, and below that text is the list of women from his computer showing his three picks, each with a gray \"drop-down menu\" triangle to the right of the names. Below this is his final spoken line. At the top of the panel is a small frame breaking the top left border with a caption:]\n2015\nWebsite: Petition: Replace Andrew \"Trail of Tears\" Jackson with a woman on the $20 for the 100th anniversary of women's suffrage in 2020.\nCueball: Hey, good idea!\nWebsite:\nVote for your three picks:\n1 Harriet Tubman\n2 Eleanor Roosevelt\n3 Rachel Carson\nCueball: Tubman for #1, definitely.[An executive from the department of treasury, with a wee bit of hair on his head, stands behind a lectern. On the front of the lectern the top part of the image inside the seal for the department of treasury is visible inside a circle, showing the scales and the tip of the triangular band beneath it. The rest of this image is hidden below the panel frame. There is text written above this image. At the top of the panel is a small frame breaking the top left border with a caption:]\nSoon...\nTreasury Executive: After a flood of public interest, the Treasury has decided to feature a woman on our money!\nOffscreen voice 1: Yay!\nTreasury Executive: She will replace Hamilton on the $10.\nOffscreen voice 1: Yay-- wait, what? Why not the $20?\nOffscreen voice 2: Are we mad at Hamilton?\nText above the seal: Treasury[The executive with a hand on the lectern is seen from the side.]\nTreasury Executive: The $10 was scheduled for the next redesign by a board made up of-\nOffscreen voice 3: Can't you just do the $20 next?\nTreasury Executive: We will review the...\nOffscreen voice 3: *Sigh*\nOffscreen voice 4 (Steve): Put Martin Shkreli on the $5!\nOffscreen voice 5: Shut up, Steve.[The executive lifts both hands, the one over the lectern points a finger up. Again seen from the side. At the top of the panel is a small frame breaking the top left border with a caption:]\nLater in 2015...\nTreasury Executive: Wow, some musical came out, and now suddenly Hamilton has tons of fans.\nOffscreen voice 6: So do the $20 next. Problem solved!\nTreasury Executive: Maybe he and a woman can share the $10!\nOffscreen voice 6: Are you serious.[The executive, again with a hand on the lectern, is seen from the side. At the top of the panel is a small frame breaking the top left border with a caption:]\n2016:\nTreasury Executive: We've decided to put Harriet Tubman on the $20.\nOffscreen voice 7: Perfect! Happy ending.\nTreasury Executive: -After we do the new $10.\nOffscreen voice 7: What?[The executive again from the front behind the lectern. On the front of the lectern only the text and the very top of the circle around the image can be seen.]\nTreasury Executive: We'll put a mural to women on the back of the $10. Hopefully that will tide you over until we get to the $20?\nOffscreen voice 8: Seriously? How is this so complicated? Just say \"We're putting Harriet Tubman on the $20,\" then do it.\nText above the seal: Treasury[The executive with hands down behind the lectern is seen from the side.]\nTreasury Executive: We'll do the $20 ASAP, but we can't change the-\nOffscreen voice 9: C'mon, your hands aren't tied here. You're the freaking Treasury. This is the one thing you're definitely in charge of.[The executive lifting a hand above the lectern is seen from the side.]\nTreasury Executive: Oh, and we're putting Andrew Jackson on the back.\nThree offscreen voices: What."
}