{
  "num": 1682,
  "url": "https://xkcd.com/1682",
  "title": "Bun",
  "img": "https://imgs.xkcd.com/comics/bun.png",
  "alt": "If a wild bun is sighted, a nice gesture of respect is to send a 'BUN ALERT' message to friends and family, with photographs documenting the bun's location and rank. If no photographs are possible, emoji may be substituted.",
  "year": "2016",
  "month": "5",
  "day": "18",
  "transcript": "[Ponytail is a teacher and she holds a pointer to a picture of a rabbit on a board behind her.]\nPonytail: Good morning class! Today, we will be learning about the bun.[Two rabbits are shown, one slightly smaller, and a greater than symbol indicates that the smaller one is \"greater than\" the larger one. Ponytail is talking off panel to the left.]\nPonytail (off panel): Buns have a hierarchy.\nPonytail (off panel): A bun's rank is determined by its size. Smaller buns are higher-ranking.[Two normal sized rabbits are sitting left and right of a very small rabbit. The smaller rabbit appears to give off a radiant light indicated with gray and white alternating rays going through the image. It is indicated that it shines on the larger rabbits as they are gray on the side turned away from the smaller rabbit and white on the front turned towards it. Ponytail narrates above the frame of this half sized panel:]\nPonytail (narrating): Most buns you see are relatively low-ranking.\nPonytail (narrating): But this time of year, a lucky few may catch a glimpse of a king bun.[A student represented by Megan is sitting at a desk with a few books on it, pencil in hand.]\nMegan: OK, hang on.\nMegan: We're talking about rabbits and hares, right? Lagomorphs?[Ponytail is holding her finger up on her left hand, and is holding her pointer at her side with the other. Students reply to her off panel to the right.]\nPonytail: Informally, yes. But in this course, we use the scientific term, \"bun\".\nStudent #1 (off-panel): Are we sure this is the right room for introductory mammalogy?\nStudent #2 (off-panel): I'll check online.\nStudent #3 (off-panel): Shh! Show respect! We look upon the image of a king!"
}