{
  "num": 1704,
  "url": "https://xkcd.com/1704",
  "title": "Gnome Ann",
  "img": "https://imgs.xkcd.com/comics/gnome_ann.png",
  "alt": "President Andrew Johnson once said, \"If I am to be shot at, I want Gnome Ann to be in the way of the bullet.\".",
  "year": "2016",
  "month": "7",
  "day": "8",
  "transcript": "The Legend of Gnome Ann[At the beach, between a clock hanging in the air, showing 10 past 10 and the shoreline, Gnome Ann, a woman with curly hair and a black triangular hat, stands with her arms outstretched towards the clock and the sea. For each of the first five panels a text is written within a frame above the drawings.]\nTime and tide wait for Gnome Ann.[Gnome Ann running in from the left frame with her arms out chases three Cueball like men running from her towards right. The one closest to her looks over his shoulder at her, the next runs forward \"normally\" and the last in front throws up his arms in the air.]\nThe wicked flee when Gnome Ann pursueth.\n-Proverbs 28:1[Gnome Ann takes the groom's place in a wedding, shoving him to the side. The groom, Hairy with a bow tie, falls while throwing his arms out. The bride stands to the left, in full wedding dress, showing no reaction.]\nWhat therefore God hath joined together, let Gnome Ann put asunder.\n-Mark 10:9[Gnome Ann sits in a yoga position meditating on a big rock in a desolate area with small rocks on the ground around the big rock.]\nTime ripens all things; Gnome Ann is born wise.\n-Miguel De Cervantes[The starship Enterprise from Star Trek is seen from behind as it flies to the right, chasing a smaller craft. In this panel the frame with text is shown to emanate from Enterprise with a zig zag arrow pointing to the starship.]\nEnterprise: Our Mission: To boldly go where Gnome Ann has gone before.[The Witch-king of Angmar, Lord of the Nazgûl, from the Lord of the Rings sits on his knees (below the frame) to the left of Gnome Ann, who is preparing to stab him with a sword pointing at his head. She is also holding her other arm out towards him. The Witch-king has a black cloak covering his head and body with a kind of crown with six small spikes shown around his head and one large spike in front. It also goes down on each side of his head showing a gaping hole instead of a face. In this panel the text is spoken by the two characters.]\nWitch-king: Fool! No man can kill me.\nGnome Ann: I Am Gnome Ann!"
}