{
  "num": 1726,
  "url": "https://xkcd.com/1726",
  "title": "Unicode",
  "img": "https://imgs.xkcd.com/comics/unicode.png",
  "alt": "I'm excited about the proposal to add a \"brontosaurus\" emoji codepoint because it has the potential to bring together a half-dozen different groups of pedantic people into a single glorious internet argument.",
  "year": "2016",
  "month": "8",
  "day": "29",
  "transcript": "[Cueball is standing in a river close to it's right bank, the water reaching up to his thighs. He is holding on to a traffic sign standing towards right. It has a label and an arrow below this pointing to the right bank. With his other arm he is pointing to the left at the advancing water masses. Further up the river is another street sign this sign has an exclamation mark inside a triangle. The water flow is indicated with several lines on the river surface, mainly moving along the river, but around Cueball and the signs there are circular lines. In the distance on the left bank of the river two people are standing and making gestures with raised arms. The left has white hair (could be either sex) and the other is a Cueball-like guy. A third sign is lying on the ground to the left of them face down. Behind them is a slope up to a road with a parked car. The road continues out over a a bridge that crosses the river. The river which passes under it both left and right of a central pillar. At that distance the right bank of the river (and thus the right end of the bridge) is not visible, being outside the panel. On each river bank grass can be seen and on the right bank also a small stone.]\nCueball: No, go this way, not-\nCueball: Are you even listening!?\nCueball: ... Hey! That's not what that area is for!\nSign with arrow: Detour\nSign with triangle: ![Caption below the panel:]\nWatching the Unicode people try to govern the infinite chaos of human language with consistent technical standards is like watching highway engineers try to steer a river using traffic signs."
}