{
  "num": 1732,
  "url": "https://xkcd.com/1732",
  "title": "Earth Temperature Timeline",
  "img": "https://imgs.xkcd.com/comics/earth_temperature_timeline.png",
  "alt": "[After setting your car on fire] Listen, your car's temperature has changed before.",
  "year": "2016",
  "month": "9",
  "day": "12",
  "transcript": "[A large heading, followed by a sub-caption. Below that two lines with a statement in between:]\nA timeline of Earth’s average temperature\nsince the last ice age glaciation\nWhen people say “The climate has changed before,” these are the kinds of changes they’re talking about.[A very long chart below the headings above is headed with a label for the scale of the X-axis above the chart. Below that a sub-caption. To the left an arrow down to the top of the chart pointing to the dotted curves starting point (at -4.3°C below the 1961-1990 average) with a label above the arrow. And arrow pointing left to the left of the center and another pointing right to the right of the center has labels. Below these is the temperature scale of the X-axis, with 9 ticks between the borders each with a label ranging from -4 to +4°C compared to the 1961-1990 average, but with another step in each direction not labeled towards to axis so the chart covers -5 to +5°C compared to the 1961-1990 average.]\nTemperature\n Compared to the 1961-1990 average\nStart\nColder\nWarmer\n-4°C -3°C -2°C -1°C 0°C +1°C +2°C +3°C +4°C[To the right of the chart is a gray text standing on the side down along the outer boarder of the chart with the sources for the chart:]\n Source: Shakun et. al. (2012) , Marcott et. al. (2013), Annan and Hargreaves (2013) , HadCRUT4, IPCC [The chart is split in 10 columns by the temperature scale and the borders. The two central columns are white, and then from there to the left the background becomes a faded color that changes from light blue to blue at the edge in four steps. Similarly to the right the color changes from light red to red. To the left there is a time scale taking 500 years leaps from 20,000 BCE all the way to year 1, where there are two years, one for BBC and one for CE. The 500 year leaps continue until 1500 CE and from there the steps are down to 100 years until 2100 with also present day 2016 labeled. After 1500 the CE is omitted. The labels stop there, but there is space below covering down to 2200 CE. There is clearly visible division line across the chart on the level of each of the 500 step, and fainter lines for each of the 100 steps all the way even though only the last 5 of these 100 steps are labeled. There is a similar clear line at 2016. Below each step on the Y-axis is noted, and then any text starting before the next step is noted below indented. If there are extra image belonging to text this is indented once more. The graph that the whole chart is about is a dotted line that begins at the “start” point mentioned above at -4.3°C and then begins to go straight down. It will change left and right all the way down. To being with all text and most drawings are to right of the dotted curve. Whenever something is to the left it will be noted. When it says to the left above something, and then nothing over the next, then the next will be to the right. Only at the very bottom are there more entries to the left than right. ]\n20000 BCE\n[An arrow goes from the dotted line to the central line at 0°C. In the middle of the line there is a temperature label:]\n4.3°C\nAt the start of our timeline, 22,000 years ago, Earth is 4°C colder than during the late 20th century.\nBoston is buried under almost a mile of ice, and the glaciers reach as far south as New York City.\n[The Statue of Liberty is shown in front of a glacier front. A very tiny Cueball is on top of the glacier. The drawing is labeled and so is also the glacier.]\nNew York\nIce\n[A guy with a white knit cap is seen walking in a snowy landscape leaving black footprints behind him. He walks through the white central part of the chart.]\n[The skyline of Boston is shown with two clear buildings among all the other. Above it is a line and in between this area has been filled with thin lines. The drawing is labeled and so is this area. Also the skyline has an arrow pointing at it with a label:]\nBoston\nIce\nModern skyline19500 BCE\nBut the world is about to warm up.\nBy this time, humans have already spread across Africa, Eurasia, and Australia.\nThey’ve created painting, pottery, rope, and bows and arrows, but haven’t developed writing or farming.19000 BCE\nChanges in the Earth’s orbit mean that more sunlight reaches the polar ice…\n[A line chart with a labeled Y-axis with three labeled ticks. The curve starts up and then goes down five times and up four times ending down. There is one plateau towards the end compared to the rest of the curve where the ups and downs are quite alike.]\nSummer sun W/m2 at 60°N\n550\n500\n45018500 BCE\n[A map of the world. At the top is a light gray area covering North America, Greenland and northern Europe and most of the northern part of Russia. A similar gray area covers Antarctica. There are two labels in the gray area above and one in the gray area below:]\nIce Ice\nIce18000 BCE\n…And the ice sheets start to melt.17500 BCE\nTemperatures have been creeping upward, but around this point, CO2 levels start to climb…17000 BCE\n…And then the warming speeds up.16500 BCE\n[Cueball is standing with a spear just the right of the graph talking to a rabbit.]\nCueball: Still pretty cold.16000 BCE\n[Megan points to the graph to the right of her and between her and Ponytail standing on the other side. Mean is the first drawing on the left side of the dotted curve, which has hardly moved since the beginning, only to just on the other side of 4°C.]\n[In the right part of the chart is an explanation of the data. Below the first two lines there are four drawings each showing possible temperature swings in reality compared to the smoothed data that represents the dotted curve of the entire chart. The dotted curve is shown in all four drawings and a thin line is shown running along it but with much more fluctuation left and right on the first two, a large spike right on the third and a large bump way right on the fourth. Above these there are two labels. The first labels is inside a bracket that covers the first three, and the last label is for the last drawing. Below is a list of sources.]\nLimits of this data:\nShort warming or cooling spikes might be “smoothed out” by these reconstructions but only if they’re small or brief enough.\nPossible Unlikely\nReconstructions are from Shakun (2012) and Marcott (2013), scaled to Annan + Hargreaves (2013) estimate for the last glacial period.15500 BCE\nIn what is now France, humans paint murals on the walls of the Lascaux caves\n[Hairy paints three animals, two with horns, and two humans, Cueball holding hand with Hairy who has a spear. On the other side of the central line Megan writes three letters, the last of which is reversed.]\nNIИ15000 BCE\nIce sheets around Alaska shrink, exposing a land bridge between Asia and North America\n[From around the bottom if this section and down to 11500 BCE the dotted curve moved steadily to the right towards warmed temperature peaking close to -1.5°C. Before this the temperature had not moved much away from that at the start.]14500 BCE\n[Cueball walks right looking back at the graph behind him. Megan walks in front of him pointing further right.]\nCueball: Cool.\nHumans reach North America.14000 BCE\nThe edge of the ice withdraws from New York City and retreats North.\n[A large glacier front speaks in a speech bubble with an arrow pointing at it. Behind is there are four peaks in the horizon and in front of it three small melting pools and some rocks on the ground.]\nGlacier: That’s it! I’m moving to Canada!13500 BCE\nHumans domesticate dogs\n(Date uncertain, may be much earlier)\n[Megan and Cueball is watching a wolf looking at them.]\nMegan: Okay, you can live in our homes and we’ll feed you, but we’ll still get mad f you poop on the floor.\nWolf: Deal.\nCueball: And we get to breed you to be tiny and dress you in little costumes.\nWolf: …Wait.13000 BCE\n[Randall did not use the normal spelling for Woolly Rhino, but this is an accepted alternative spelling:]\nWooly Rhino goes extinct\nOregon is scoured by huge floods as glacial dams burst and lakes of meltwater flow to the sea12500 BCE\nIce sheets withdraw from Chicago12000 BCE\nHumans settle Abu Hureyra in Syria11500 BCE\n[An arrow on the left side of the dotted curve is pointing down along the dotted curve and to the left indicate temperature is declining again, meaning the dotted curve now moves left to colder temperatures. This only continues until 10500 BCE. It is only the second time something is noted on the left side after Megan at 16000 BCE]\nTemperatures start to decline, mainly in the Northern hemisphere\nThis may be caused by changes in ocean circulation due to the floods of cold fresh meltwater flowing into the Atlantic as the North American ice sheet melts.\nThis cooler period is called the Younger Dryas11000 BCE\n[This is the first text to the left of the dotted curve:]\nHumans reach Argentina10500 BCE\n[An arrow pointing down along the right side of the dotted curve and to the right indicate temperature is increasing again, meaning the dotted curve now moves right to hotter temperatures. This continues until 8000 BCE where it levels out just above 0°C.]\nWarming resumes\nHuman settlements at Jericho10000 BCE\nFirst development of farming9500 BCE\nSaber-toothed cat goes extinct\n[To the left:]\nHorses disappear from North America9000 BCE\n[To the left, Randall spelled Pokémon wrong:]\nLast North American Pokemon go extinct\n[Cueball with a speak and Megan is looking up at this last “fact”.]\nMegan: That is not a real fact.\nTemperatures reach modern levels\nRising seas cut off the land bridge between North America and Asia\nCattle domesticated8500 BCE\nIce sheets retreat across the Canadian border\nTemperatures start to level out slightly above 1961-1990 levels8000 BCE\n[The above sentence breaks over the 8000 BCE line. From here a maximum in temperature on the chart is reached at 0.5°C which will not be overtaken until 2000 CE. It stays almost constant here until 5000 BCE where a slight cooling begins.]7500 BCE\n[To the left:]\nThis warm, stable period is called the Holocene Climate Optimum\n[To the left:]\nJiahu settled in China7000 BCE\nFinal collapse of the North American ice sheet leads to rapid 2-4m sea level rise…\n[A small arrow points down and left to the right of the dotted curve. There is a small decrease in temperature but it is very small and would have been missed without the arrow and label.]\n…And a period of cooling in the Northern hemisphere6500 BCE\n[To the left:]\nAs seas rise to near their modern levels, Britain is cut off from mainland Europe6000 BCE\nHumans develop copper metalworking5500 BCE\n[To the left:]\nMassive volcanic eruption in Oregon creates crater lake\nGold metalworking5000 BCE\n[To the left:]\nInvention of the wheel\n[To the left. To the right of the dotted curve is an arrow pointing down and slightly left. From here temperature decreases very slowly but steadily from 0.5°C until 1000 BCE where a stable plateau is reached around 0°C.]\nEarth begins to cool slowly mainly due to regular cycles in its orbit4500 BCE\n[To the left:]\n Proto-Indo-European language develops\n[To the right of the curve Ponytail holds up a hand towards Cueball.]\nPonytail: Let’s make our language heavily inflected, so future students have to memorize a zillion verb endings!\nCueball: Okay!\n[To the left:]\nPermanent settlements in the fertile crescent4000 BCE\nHorses domesticated\n[To the left:]\nMinoan culture arises on Crete3500 BCE\nEgyptian mummification\nRise of the Indus Valley civilization\n[To the left:]\nInvention of writing in Sumer “prehistory” ends, “history” begins\nEarliest human whose name we know\n(Pharaoh Iry-Hor in Egypt)3000 BCE\nThree Sovereigns and five emperors period in China\nGilgamesh\n[To the left:]\nImhotep\nMayan culture emerges\n[To the left:]\nGreat Pyramid constructed2500 BCE\nCorded Ware culture in Europe\n[To the left of the curve two rock musicians with long hair and electrical guitars are standing on either side of a small gate made of three slabs of stone, one on top of the other two standing stones.]\nStonehenge completed\nChariots developed2000 BCE\n[To the left:]\nAlphabetic writing developed in Egypt\nLast mammoths on a tiny Siberian island go extinct\n[To the left:]\nMinoan eruption1500 BCE\n[To the left:]\nIron smelting\nOlmec civilization develops in Central America\n[A Trojan horse with two Cueball-like guys in front and a third standing on its back. Its back is at three Cueball’s height and its head rises to the level of the Cueball on its back. It stands on a platform with four wheel on the visible side. There is text on the horse]\nSetting of the Iliad and the Odyssey\nText on horse: Not a trap\n[To the left:]\nInvasion of the Sea peoples*\n* A real thing\nPolynesians explore the Pacific Ocean1000 BCE\n[From 1000 BBC to 1000 CE the temperature is stable and very close to 0°C.]\n[To the left:]\nSolomon\n[Randall spelled Iliad wrongly this time:]\nIlliad and Odyssey composed \n[To the left:]\nRise of Greek city-states\nNeo-Assyrian empire\n[To the left:]\nFirst Olympics\nZapotec writing in modern Mexico\n[To the left:]\nConfucius500 BCE\n[To the left:]\nThe stuff in the 300 (film)|movie 300, but regular speed and with more clothing\nBuddha\nNazca Lines\n[To the left:]\nAlexander the Great\n[To the left:]\nMayan hieroglyphics\nAshoka the Great\n[To the left:]\nPaper invented\n[To the left:]\nAsterix\nTeotihuacán metropolis\n[To the left:]\nJulius Caesar[At the year 0, there is instead two numbers for each of the two scales before and after Christ:]\n1 BCE\n1 CE\n[To the left:]\nRoman Empire\nJesus\n[To the left and erupting volcano.]\nPompeii\nThree Kingdoms period\n[To the left:]\nGupta empire\n[To the left:]\nVarious groups take turns sacking Rome\n[Randall spelled Attila wrong:]\nAtilla the Hun500 CE\nMuhammad\n[To the left:]\nTang Dynasty\n[An arrow to the right of the dotted curve pointing down, takes a swing far out from the curve and then bends back again. The text label next to it breaks into the next 500 period. The dotted curve stays stable at 0°C along this arrow.]\nMedieval warm period in Europe and some northern regions (too regional to affect the global average much)\n[To the left:]\nLeif Eriksson1000 CE\n[The dotted curve moves to the left towards lower temperature reaching a minimum around 1650 of about -0.6°C at the Little Ice Age.]\n[To the left a drawing of a compass with needle pointing the black end towards north east. There are labels for the four main directions and a label next to it:]\nN\nW E\nS\nMagnetic compass navigation\n[To the left:]\nGhengis Khan \nZheng He’s fleet explores Asia and Africa\n[To the left:]\nAztec Alliance \n[To the left:]\nPrinting press\n[To the left:]\nColumbus1500 CE\nEuropean Renaissance\n[To the left:]\nShakespeare1600 \n[To the left:]\nNewton\n[To the right of the dotted curve there is an arrow pointing down that makes a swing in towards the curve and then back out again. At -0.6°C this is the coldest it has been since 9500 BCE. It is labeled:]\n”Little Ice Age”1700\nSteam engines\n[To the left:]\nUnites States Independence1800\nIndustrial Revolution\n[To the left:]\nTelegraphs\n[After this the dotted curve becomes solid.]1900\n[To the left, and on the line for 1900:]\nAirplanes\n[To the left:]\nWorld Wars\n[The solid line takes a step to the right close to 0°C. Over the rest of the 1900s it moves closer to 0°C crossing it before 2000 where it almost reaches the maximum temperature of 0.5 °C from earlier in 8000 BCE.]\nFossil fuel CO2 emissions start rapidly increasing\n[To the left:]\nNuclear weapons\n[To the left:]\nInternet2000\nNorthwest Passage opens\n[From here to present day the solid line increases rapidly and in 2016 present day is almost reaches 1°C, with about 0.8°C.]2016\n[To the left on the line for 2016:]\nPresent day\n[From here the curve once again becomes dotted as this is the future. After one dot it splits in two and after the first two dots another split between them occurs forming three possible future dotted curves. The first curve bending down before the others, and thus to the right of the other two reaches about 1.2°C and then goes straight down and stops at the 2100 line. An arrow points to it from the left and a label is written patly before and the rest after the 2100 line to the left of the curve:]\nBest-case scenario assuming immediate massive action to limit emissions2100\n[The middle curve bends a little down after reaching 1.3°C and then continues this path reaching 2°C in 2100. An arrow point from below to it and a label is written below the curve and below 2100 line:]\nOptimistic scenario\n[The last line continues along the path from the last 16 years of the solid line reaching 4.2°C at 2100, almost as far on the other side of 0°C in 150 years as it took 14000 years to move from the other side from the start of the chart. Another arrow point to this from below with a label below the curve and below 2100 line:]\nCurrent Path"
}