{
  "num": 1747,
  "url": "https://xkcd.com/1747",
  "title": "Spider Paleontology",
  "img": "https://imgs.xkcd.com/comics/spider_paleontology.png",
  "alt": "Whenever you see a video of birds doing something weird, remember: Birds are a small subset of dinosaurs, so the weirdness of birds is a small subset of the weirdness of dinosaurs.",
  "year": "2016",
  "month": "10",
  "day": "17",
  "transcript": "[The Sphere, a time-traveler depicted as a solid floating black energy sphere surrounded by six outwardly-curved segments) seems to have materialized in front of Megan and Cueball who is in the right part of the panel facing left towards it.  The Sphere looks like this except in the zoom in from panel two. A voice emanates from the Sphere.] \nSphere: I'm here from the distant future!\nMegan: Cool! What for?\nSphere: Spiders![A close-up of the Sphere, still depicted as a black sphere, but not perfectly round at this zoom level and also clearly with some white dots in the dark area. It is also now surrounded by seven (rather than six) narrow rays with irregular dots between the rays. Megan answers it from off-panel.]\nSphere: We've learned about your planet's spiders from fossils.\nSphere: There's a whole spider craze. We have spider theme parks, spider movies, spider costumes...\nSphere: Such beautiful animals!\nMegan (off-panel): I guess...[Same setting as in the first panel but Megan is pointing left past the Sphere.]\nSphere: Now we've got time travel, so I'm here to see one for myself!\nMegan: Sure! There's one over there![The Sphere floats over a leafless branch sticking out of the ground. A spider web is strung between the left border of the panel (four spokes) and the branch (three spokes). A spider (almost as large as the Sphere) sits in the center of the web. Megan answers it from off-panel.]\nSphere: Woowwww!\nSphere: What's that giant net it's caught in?\nMegan (off-panel): You mean its web?\nSphere: Its what?[Same setting as in the first panel.]\nMegan: Oh, right, fossils. So you wouldn't know about...[In a frame-less panel only Megan is shown facing left while she ponders. Beat panel.]\nMegan: ...[Again a scene similar to the first.]\nMegan: Oh my God. Dinosaurs must have been so weird.\nCueball: Holy crap, yeah.\nMegan: Listen, can we borrow your time machine?   "
}