{
  "num": 1769,
  "url": "https://xkcd.com/1769",
  "title": "Never Seen Star Wars",
  "img": "https://imgs.xkcd.com/comics/never_seen_star_wars.png",
  "alt": "If anyone calls you on any weird detail, just say it's from the Jedi Prince book series, which contains so much random incongruous stuff that even most Expanded Universe/Legends fans collectively agreed to forget about it decades ago.",
  "year": "2016",
  "month": "12",
  "day": "7",
  "transcript": "[White Hat is facing Cueball while talking to him.]\nWhite Hat: You know the scene on the Death Star where–\nCueball: Nah, I've never seen Star Wars.[Close-up of White Hat in a smaller panel.]\nWhite Hat: WHAT.[White Hat and Cueball are still facing each other.]\nWhite Hat: ...How?!\nCueball: Uh, it was easy?\nCueball: It was literally the default option.[Close up of Cueball. White Hat is speaking off-panel.]\nWhite Hat: But... How did you–\nCueball: Not doing things is my superpower. I'm not doing an infinite number of things as we speak![White Hat and Cueball are still facing each other.]\nWhite Hat: We have to watch it.\nCueball: Nah, I'm good.[White Hat has turned away from Cueball and has his hands to his mouth to shout to people off-panel. Cueball has likewise turned away as he walks away and is speaking back over his shoulder.]\nWhite Hat: Hey everyone! This guy's never seen Star Wars!\nCueball: Listen, I gotta go.[A small caption above the single panel.]\nLater...[Ponytail is looking down at her phone in her left hand while Cueball is facing her.]\nPonytail: Wait, there's a new Star Wars?\nCueball: Oh, I've nev–\nCueball: ...yeah! Excited for it! Big fan.[Ponytail holds her phone to her side, transferred to her right hand, as she and Cueball face each other.]\nPonytail: What'd you think of the last one?\nCueball: Uh... That Darth Vader, man.\nCueball: Sure does love eating Jedi.[Ponytail and Cueball continue facing each other.]\nPonytail: Haha, he sure does!\nCueball (thinking): Phew.\nPonytail (thinking): Phew."
}