{
  "num": 1799,
  "url": "https://xkcd.com/1799",
  "title": "Bad Map Projection: Time Zones",
  "img": "https://imgs.xkcd.com/comics/bad_map_projection_time_zones.png",
  "alt": "This is probably the first projection in cartographic history that can be criticized for its disproportionate focus on Finland, Mongolia, and the Democratic Republic of the Congo.",
  "year": "2017",
  "month": "2",
  "day": "15",
  "transcript": "Bad map projection #79:\nTime Zones\nWhere each country should be,\nbased on its time zone(s)[A world map is shown divided and colored by political boundaries. There are many distortions, and especially Russia looks weird. Many countries have their name listed in a gray font and at the bottom below Australia there are two specialties mentioned for time zones which are not divided in full hours. One of these is a footnote used by other countries as well.][The labels are listed here in order of the \"continents\" as they come from top left to down right. Similarly within each continent's list the countries which are usually said to belong to a given continent (at least politically or partially, e.g. Greenland and Turkey in Europe) are listed in a similar reading order as accurately as possible.][North America. (Newfoundland, the most easterly part of Canada, is labeled with a star *):]\nCanada, *, United States, Mexico, Gua., Hon., Nic., C.R., Pan., Cuba, Haiti, Jam., D.R.[South America:]\nColombia, Venezuela, Guyana, F.G., Suriname, Peru, Brazil, Bolivia, Par., Chile, Argentina, Uruguay[Europe. (Russia is as the only country mentioned twice, the other place is over the central part in the Asia section):]\nGreenland, Iceland, Norway, Sweden, Finland, Ireland, UK, Lithuania, Latvia, Estonia, Bel., Russia, Ger., Pol., Ukraine, France, It., Romania, Portugal, Spain, Bulgaria, Turkey[Africa:]\nW.S., Tunisia, Morocco, Algeria, Mauritania, Sen., Mali, Niger, Libya, Egypt, Sudan, Gb., Guin., B.F., S.L., Liberia, Côte d'Ivoire, Ghana, Nigeria, Chad, Cam., C.A.R., S.S., Ethiopia, Somalia, E.G., Gabon, R. of Congo, Dem. Rep. of the Congo, Kenya, Angola, Zambia, Tanzania, Namibia, Bots., Zimb., Mozambique, Madagascar, South Africa[Asia. (Russia is the only country mentioned twice, the other label is within the European border. The text written over Bhutan is unreadable in the image and marked with a question mark in this list):]\nIraq, Saudi Arabia, Yemen, Iran*, Oman, Russia, Kazakhstan, Mongolia, Turkmenistan, Uzbekistan, Afghanistan*, Taj., Pakistan, India*, Nepal*, ?, China, N.K.*, S.K., Japan, Ban., Bur.*, Laos, Vietnam, Thailand, Philippines[Oceania/Australia. (In Australia there is a star * in the middle of it above the name):]\nMalaysia, Indonesia, Papua New Guinea, *, Australia, New Zealand[Below Australia there is an arrow pointing to the south coast and below that a footnote for the stars * used above:]\nUTC+8:45\n(One small area)*=Half-hour offset"
}