{
  "num": 1828,
  "url": "https://xkcd.com/1828",
  "title": "ISS Solar Transit",
  "img": "https://imgs.xkcd.com/comics/iss_solar_transit.png",
  "alt": "I guess it's also the right setting for pictures of the Moon at night.",
  "year": "2017",
  "month": "4",
  "day": "24",
  "transcript": "[Cueball is kneeling in front of a small platform while operating a camera with a very long objective. The camera is angled sharply upward toward the sky as it is attached to a tripod standing on the platform. An off-panel voice calls ut to him.]\nOff-panel voice: What's going on?\nCueball: ISS solar transit. From this spot, the space station should briefly line up with the sun. \nCueball: I got a sun filter and I'm trying to take a picture of it crossing.[Two half height panels above each others follow. The first shows an image of the very orange sun on a black background, as seen through the camera.][The second of the two half height panels shows Cueball making further adjustments tot he camera, as in the first panel.]\nCueball: Perfect. Hmm, I should set the white balance.[Once gain there are two panels above each other. The top is black with white text and icons from the white balance menu. It has the following options shown after each of the icons as mentioned below in the square brackets:]\n[Shining light bulb]: Incandescent\n[Shining fluorescent lamp]: Fluorescent\n[Shining sun]: Direct sunlight\n[Lightning]: Flash\n[Cloud]: Cloudy\n[A house that cast a shade]: Shade\n[Two triangles with a circle between them]: Custom[In the panel below Cueball still operates the camera as before][A frame-less but full height panel follows where Cueball leans back from the camera with his hands on his thighs.][The last two panels are again above each other. It is almost the same panels as before the frame-less panels, except that the direct sunlight option has been selected as shown with a blue selection band across that option.]\nIncandescent\nFluorescent\nDirect sunlight\nFlash\nCloudy\nShade\nCustom[In the bottom panel Cueball again operates the camera.]"
}