{
  "num": 1884,
  "url": "https://xkcd.com/1884",
  "title": "Ringer Volume/Media Volume",
  "img": "https://imgs.xkcd.com/comics/ringer_volume_media_volume.png",
  "alt": "Our new video ad campaign has our product's name shouted in the first 500 milliseconds, so we can reach the people in adjacent rooms while the viewer is still turning down the volume.",
  "year": "2017",
  "month": "9",
  "day": "1",
  "transcript": "[A x-y-graph is shown and the header above is:]\nTrying to turn down the volume before a video starts playing:[At the line graph the horizontal axis is labeled with the text \"Time\" and an arrow pointing to the right. The vertical axis represents the volume but has no label. There are two signed lines, \"Ringer volume\" in black and \"Media volume\" in gray roughly at the same level. Below are eight smartphone screens showing the running app over time.][The first seven screens showing a circle indicating that an app is loading. At the second screen a volume control is depicted with an arrow to the lower button.]\nTAP TAP TAP TAP\n[The \"Ringer volume\" decreases four times.][Further in time before the third screen the volume control is depicted again with an arrow to the upper button.]\nTAP TAP TAP TAP\n[The \"Ringer volume\" increases to normal.][Nothing happens on the 4th screen but at the 5th the volume control is shown again with an arrow to the lower button.]\nTAP TAP TAP\n[The \"Ringer volume\" decreases three times.][Before the 6th screen the volume control is shown, again with an arrow to the upper button.]\nTAP TAP TAP\n[The \"Ringer volume\" increases back to normal.][At the 7th screen there is again the volume control with an arrow to the lower button.]\nTAP TAP TAP TAP\n[The \"Ringer volume\" decreases four times.][Before the 8th screen the volume control is shown with an arrow to the upper button and the tapping starts:]\nTAP TAP\n[The \"Ringer volume\" increases two times, still below normal, and the video starts at the screen.]\nTAP TAP\n[The \"Media volume\" increases two times above normal.]\nPerson in the video: HELLO, AND WELCOME TO..."
}