{
  "num": 1890,
  "url": "https://xkcd.com/1890",
  "title": "What to Bring",
  "img": "https://imgs.xkcd.com/comics/what_to_bring.png",
  "alt": "I always figured you should never bring a gun to a gun fight because then you'll be part of a gun fight.",
  "year": "2017",
  "month": "9",
  "day": "15",
  "transcript": "[Text in the top-left corner of the comic:] \"Should you bring _____ to ______?\"[The comic is laid out like a grid, with implements down the left-hand side (A knife / A gun / Water / A lid) and the type of \"fight\" across the top (A knife fight / A gun fight / A wood fire / An oil fire). The grid illustrates the \"match-ups\", with a green square denoting a \"correct\" match-up and a red square denoting a Very Bad Idea.][From the top left corner, going from left to right, top to bottom, with each first item being on its own line in the grid, the squares are as follows:][Green square, two combatants face off against each other with knives, equally matched.]\nA knife to A knife fight[Red square, a person with a knife faces off against someone with a gun, and is clearly outmatched.]\nA knife to A gun fight[Red square, a person holds a knife in a wood fire while saying \"OW OW OW\".]\nA knife to A wood fire[Red square, the person with the knife scrapes at the oil inside the pan that's on fire while saying \"OW OW OW\". The scraping accompanied by the text \"SCRAPE SCRAPE\".]\nA knife to An oil fire[Green square, the person with the gun points it at the opponent with the knife, who exclaims, \"Dude!\"]\nA gun to A knife fight[Green square, two combatants point guns at one another, equally matched.]\nA gun to A gun fight[Red square, the person with the gun shoots pointlessly three times at the wood fire, which carries on blazing. The shooting is accompanied by the text \"BLAM BLAM BLAM\".]\nA gun to A wood fire[Red square, the person with the gun shoots at the flaming pan, which does nothing to put it out. The shooting is accompanied by the text \"BLAM\".]\nA gun to An oil fire[Red square, the person with the water throws it uselessly in the face of the person holding the knife.]\nWater to A knife fight[Red square, the person with the water throws it uselessly in the face of the person holding the gun.]\nWater to A gun fight[Green square, the person throws the water on the fire and successfully extinguishes it, which makes a \"SPLOOSH\" sound.]\nWater to A wood fire[Red square, the person is shown reeling back from the oil fire, the water glass going flying, as the oil fire explodes with a \"FOOM\".]\nWater to An oil fire[Red square, the person with the lid comically places it on the head of the person with the knife, who stands there in confusion.]\nA lid to A knife fightRed square, the person with the lid ineffectually places it on top of the gun the other person is pointing at them.\nA lid to A gun fightRed square, the person with the lid holds it near the wood fire, which does nothing to put out the fire.\nA lid to A wood fire[Green square, the person places the lid on top of the oil fire, which suffocates and extinguishes it.]\nA lid to An oil fire"
}