{
  "num": 1910,
  "url": "https://xkcd.com/1910",
  "title": "Sky Spotters",
  "img": "https://imgs.xkcd.com/comics/sky_spotters.png",
  "alt": "Where I live, one of the most common categories of sky object without a weird obsessive spotting community is \"lost birthday party balloons,\" so that might be a good choice—although you risk angering the marine wildlife people, and they have sharks.",
  "year": "2017",
  "month": "11",
  "day": "1",
  "transcript": "[White Hat and Hairy are standing in front of some buildings. White Hat points to the sky while holding his smartphone in the other hand, while Hairy holds his smartphone up in both hands as he looks at the screen.]\nWhite Hat: That's odd—another PA-24 Comanche with red trim. Registered to a holding company, no recent flight plans.\nHairy: I'll ask the forums if anyone knows who operates those.[Hairbun and an old man with white sailor cap, are standing in a field with rolling hills behind them. Hairbun is looking at the sky through her binoculars, that she has in a string around her neck. The man also looks up but he is holding his string attached binoculars down in front of him.]\nHairbun: Goodness, I think that's a broad-winged hawk!\nMan with sailor cap: In November?! They should be long gone by now!\nHairbun: I'll email the list.[Five people sit around a table in a boardroom, which presumably belongs to the government as the table has a circular insignia with an eagle in the center and unreadable text in the ring around the eagle and beneath the insignia. A man with slick black hair is sitting at the end of the table in an office chair. The other four are sitting behind the long side of the table; from left they are Cueball, Megan, another version of Hairy with spikier hair, and to the right, Ponytail.]\nMan at the end of the table: Dammit, why are there so many different subcultures obsessed with staring at the sky?\nPonytail: What else could we disguise our surveillance drones as?\nCueball: Weather balloons?\nPonytail: No, that gets the UFO people and the weather people.\nPonytail: Don't know who's worse."
}