{
  "num": 1948,
  "url": "https://xkcd.com/1948",
  "title": "Campaign Fundraising Emails",
  "img": "https://imgs.xkcd.com/comics/campaign_fundraising_emails.png",
  "alt": "The establishment doesn't take us seriously. You know who else they didn't take seriously? Hitler. I'll be like him, but a GOOD guy instead of…",
  "year": "2018",
  "month": "1",
  "day": "29",
  "transcript": "[An e-mail inbox window is displayed. On each line appears an illegible e-mail address and a checkbox.]\nDonate now. It's crunch time, and we're low on cash. If you chip in just $5 by midnight, we…\nDonate $35.57 now! Our data team has determined that we should ask you for $35.57 to optimize the…\nHelp. Our campaign made some mistakes and we need a lot of money ASAP. Any kind, but cash is…\nWashington is broken. When I win, I'll look those other senators in the eye and tell them: \"Jobs.\" Then I…\nHopeless. It's bad. Really bad. If you don't chip in now, the darkness spreading across the land will…\nAs the first woman to fly a fighter jet through our state's formerly all-male university, I learned…\nWe're broke. No paid staff. No ads. And the cafe has told us to stop using their wifi to send fundraising…\nWhen Amy decided to run for Congress, I was like \"Huh?\" but I checked Wikipedia, and apparently it's a branch of…\nAre you familiar with the Dutch painter Hieronymous Bosch? His work illustrates my opponent's plan for…\nBeing a single mom running a small business while going to law school while being deployed to Iraq taught me…\nI will lead the fight against the big banks, special interests, the Earth's climate, and our children. I…\nWow. Have you seen this video of the squirrel obstacle course? Incredible! Anyway, I'm running because I…\nOutrageous. Granted, this was a few years ago, but did you hear what President Ford said about…\nWhoops. Due to a typo, we spent months running attack ads against Tom Hanks. Now, we need to make up for…\nThey say we can't win—that we're \"underdogs\" with \"no money\" who \"lost the election last week.\" But they don't…\nOur campaign's only chance is to seduce Jennifer ActBlue, heir to the ActBlue fortune. For that, we need a fancy…\nDoom. Where is the horse and the rider? Where is the horn that was blowing? They have passed, like rain on…\nWarmest greetings. I am the crown prince of Nigeria. I am running for Congress because I believe that…"
}