{
  "num": 1950,
  "url": "https://xkcd.com/1950",
  "title": "Chicken Pox and Name Statistics",
  "img": "https://imgs.xkcd.com/comics/chicken_pox_and_name_statistics.png",
  "alt": "People with all six of those names agree that it's weird that we have teeth, when you think about it for too long. Just about everyone agrees on that, except—in a still-unexplained statistical anomaly—people named \"Trevor.\"",
  "year": "2018",
  "month": "2",
  "day": "2",
  "transcript": "[The first panel shows graph with only the x-axis labeled and with seven labeled ticks. The y-axis has three ticks with percentage labels. A red line rises from bottom to top as it goes from left to right. There is an arrow pointing at the graph with a label. Above the left part of the red line there is a title and beneath that a reference to the source of the data in gray font.]\n[According to the graph, the percentage is close to 0 for ages below 15 and close to 100 for ages above 30.]\nFraction of kids your age who got chicken pox\n(Very rough US estimates based on DOI:10.15585/mmwr.mm6534a4 and DOI:10.1016/j.vaccine.2012.05.050)\n100%\n50%\n0%\nYour age: 5  10  15  20  25  30  35\nVaccine introduced in 1995[The second panel shows a graph with only the x-axis labeled and with seven labeled ticks. The graph has six gray lines with labels on them. To the right is a title and beneath that a reference to the source of the data in gray font.]\n[According to the graphs, Sarah and Brian are more popular names for older age groups.]\nRelative popularity of several names in your age group\n(Source: ssa.gov)\nHarper\nSarah\nJaxon\nBrian\nBrooklyn\nLogan\nYour age: 5  10  15  20  25  30  35[The third panel shows a list of names with a percentage next to them. Above the list is a title and beneath that a statement in gray font:]\nChicken pox incidence by name:\n(Very rough estimate)\n Brian: 75%\n Sarah: 60%\n Logan: 20%\n Brooklyn: 10%\n Jaxon: 4%\n Harper: 2%[Caption below the panels:]\nFun Fact: People named \"Sarah\" and \"Brian\" think chicken pox is normal and common, and people named \"Logan\" and \"Harper\" do not."
}