{
  "num": 1957,
  "url": "https://xkcd.com/1957",
  "title": "2018 CVE List",
  "img": "https://imgs.xkcd.com/comics/2018_cve_list.png",
  "alt": "CVE-2018-?????: It turns out Bruce Schneier is just two mischevious kids in a trenchcoat.",
  "year": "2018",
  "month": "2",
  "day": "19",
  "transcript": "[A heading is centered above a list of 21 vulnerabilities]\nLeaked list of major 2018 security vulnerabilities CVE-2018-????? Apple products crash when displaying certain Telugu or Bengali letter combinations.\nCVE-2018-????? An attacker can use a timing attack to extploit a race condition in garbage collection to extract a limited number of bits from the Wikipedia article on Claude Shannon.\nCVE-2018-????? At the cafe on Third Street, the Post-it note with the WiFi password is visible from the sidewalk.\nCVE-2018-????? A remote attacker can inject arbitrary text into public-facing pages via the comments box.\nCVE-2018-????? MySQL server 5.5.45 secretly runs two parallel databases for people who say \"S-Q-L\" and \"sequel.\"\nCVE-2018-????? A flaw in some x86 CPUs could allow a root user to de-escalate to normal account privileges.\nCVE-2018-????? Apple products catch fire when displaying emoji with diacritics.\nCVE-2018-????? An oversight in the rules allows a dog to join a basketball team.\nCVE-2018-????? Haskell isn't side-effect-free after all; the effects are all just concentrated in this one. computer in Missouri that no one's checked on in a while.\nCVE-2018-????? Nobody really knows how hypervisors work.\nCVE-2018-????? Critical: Under Linux 3.14.8 on System/390 in a UTC+14 time zone, a local user could potentially use a buffer overflow to change another user's default system clock from 12-hour to 24-hour.\nCVE-2018-????? x86 has way too many instructions.\nCVE-2018-????? NumPy 1.8.0 can factor primes in O(log n) time and must be quietly deprecated before anyone notices.\nCVE-2018-????? Apple products grant remote access if you send them words that break the \"I before E\" rule.\nCVE-2018-????? Skylake x86 chips can be pried from their sockets using certain flathead screwdrivers.\nCVE-2018-????? Apparently Linus Torvalds can be bribed pretty easily.\nCVE-2018-????? An attacker can execute malicious code on their own machine and no one can stop them.\nCVE-2018-????? Apple products execute any code printed over a photo of a dog with a saddle and a baby riding it.\nCVE-2018-????? Under rare circumstances, a flaw in some versions of Windows could allow Flash to be installed.\nCVE-2018-????? Turns out the cloud is just other people's computers.\nCVE-2018-????? A flaw in Mitre's CVE database allows arbitrary code insertion.[~~Click here for cheap viagra~~]"
}