{
  "num": 1985,
  "url": "https://xkcd.com/1985",
  "title": "Meteorologist",
  "img": "https://imgs.xkcd.com/comics/meteorologist.png",
  "alt": "Hi, I'm your new meteorologist and a former software developer. Hey, when we say 12pm, does that mean the hour from 12pm to 1pm, or the hour centered on 12pm? Or is it a snapshot at 12:00 exactly? Because our 24-hour forecast has midnight at both ends, and I'm worried we have an off-by-one error.",
  "year": "2018",
  "month": "4",
  "day": "25",
  "transcript": "[Cueball is presenting a weather forecast while seated with his folded hands resting on a table. A graphic to the left of Cueball shows the weather for five consecutive hours from 12pm to 4pm, each with a rainy cloud icon and the same percentage of 20% written below the icon. The TV channel's logo is shown on the bottom left, with the 4 in a white font inside a black circle.]\nCueball: Our forecast says there's a 20% chance of rain for each of the next five hours.\nCueball: How likely is it to rain this afternoon? It's a simple question, but I don't know the answer. Is each hour independent? Correlated? Or is rain guaranteed and we're just unsure of the timing?12pm  1pm  2pm  3pm  4pm \n  20%  20%  20%  20%  20%  \nNews\n  4\nWeather[Cueball still sits at the table, but the weather graphic is gone and he looks to the right.]\nCueball: It says \"scattered showers.\" Is this the chance of rain somewhere in your area? How big is your area? What if you have two locations you're worried about?\nCueball: I've asked management, but they've stopped answering my emails, so—Hang on, the security guy is coming over.[A black screen is shown with white text and two short white lines between each of the three segments of text. The TV logo is shown below the last text, with the white 4 inside a gray circle with a white border.]\nTechnical Difficulties\n—\nWe apologize for hiring a meteorologist with a pure math background.\n—\nWe'll be back on the air shortly.\n\nNews\n  4[Blondie now sits at the desk, in the same position as Cueball, but without the graphic. She looks to the right towards a person who speaks to her from outside the panel. This voice is indicated with two square speech bubbles, connected with a double line and with a small arrow pointing to the right off-panel from the top bubble.]\nBlondie: Sorry about that. Hi, I'm your new meteorologist.\nPerson off-panel: And you're not a mathematician, right?\nBlondie: No. I do have a linguistics degree.\nPerson off-panel: That's fine.[Blondie continues in the same position but now looks into the camera at the viewers. The off-panel person only speaks one word, which again is inside a square speech bubble with a small arrow pointing to the right off-panel.]\nBlondie: It might rain this afternoon.\nBlondie: But what is \"it\" here? Is it a true dummy pronoun, as in the phrase \"It's too bad?\" Or is the weather an entity?\nBlondie: Also, what if I say, \"It's hot out, and getting bigger?\"\nPerson off-panel: Security!"
}