{
  "num": 1986,
  "url": "https://xkcd.com/1986",
  "title": "River Border",
  "img": "https://imgs.xkcd.com/comics/river_border.png",
  "alt": "I'm not a lawyer, but I believe zones like this are technically considered the high seas, so if you cut a pizza into a spiral there you could be charged with pieracy under marinaritime law.",
  "year": "2018",
  "month": "4",
  "day": "27",
  "transcript": "[Ponytail and Megan are standing on a grassy river bank, with the nearby part of the river shown above their heads. They are looking towards te river and Ponytail is gesturing at the river with her hand.]\nPonytail: This is a cool spot.\nPonytail: The Missouri-Nebraska state line follows this river. If the river's path changes gradually, the border moves with it.[A map is shown beneath the text spoken by Ponytail (off-panel). The map includes a bendy river shown in gray which is snaking its way from the left part of the panel down to the bottom. A dotted line indicates the old path of the river. It follows the gray river most of the way, but towards the bottom this line moves away from the current river extending to north-east, including a large chunk of land that the river used to encompass previously. Two arrows point to the gray section of the river with the dotted line, and another arrow points to the section of the dotted line not following the gray section. Both are labeled. On each side of the dotted arc, where it is farthest from the gray part of the river the state names are labeled, so the text follows the direction of the river (almost noth to south here).]\nPonytail (narrating): But when it abruptly changes course, the border stays behind.\nPonytail (narrating): This is a spot where that happened. We're on the Missouri side, but we're in Nebraska.\nRiver\nOld riverbed\nNebraska \nMissouri [In a frame-less panel (with no background) Ponytail has turned to look at Megan who is holding a hand to her chin.]\nMegan: Wow.\nMegan: So...\nMegan: We can commit all the crimes we want here and the cops can't do a thing![Megan runs away from Ponytail while she is holding her arm up in the air with a finger extended up.]\nPonytail: What? No. Why would you even think that?\nMegan: I'm going to cut a pizza into a spiral!\nPonytail: That's not even illegal!\nMegan: Crimes!"
}