{
  "num": 1994,
  "url": "https://xkcd.com/1994",
  "title": "Repairs",
  "img": "https://imgs.xkcd.com/comics/repairs.png",
  "alt": "I was just disassembling it over the course of five hours so it would fit in the trash more efficiently.",
  "year": "2018",
  "month": "5",
  "day": "16",
  "transcript": "[Caption above the diagram:]\nHow well something works\nAfter I decide to fix it[The comic shows a graph with a solid curve that decreases in 8 different sized steps from the top left to the bottom right. The X-axis shows time passes and gives the time from zero to five hours with 6 ticks with labels beneath. The Y-axis shows how well something works with 8 ticks, but only four of them labeled.]Works great\nHas minor problems\nDoesn't workWill never work again0 hours   1 hour   2 hours   3 hours   4 hours   5 hours[The solid line has six labels with eight arrow pointing to different sections, two times the same label has two arrows pointing to different sections the first two places where the lines takes a step down, and the second to two plateaus on either side of a step. In total the arrows point four times on both steps and plateaus. Both the first and final plateau has a dot has added to the line, and the arrows point to those. Above the solid line there are three dotted lines going up from three plateaus just before the solid line takes a step down, the last two of these lines split up in two, with one going higher. At the end of each of these five dotted lines there is a sentence spoken. The solid line begins at the 2nd tick on the Y-Axis and finishes at the last. The three dotted lines going up ends up at the 1. tick on the Y-axis, for the last two there are also a line ending at the 2nd tick and 3rd tick respectively. Only the first label being above the first tick on the X-axis but the last three labels are all above the last tick on the X-Axis. Here is a list of all the labels in chronological order according to the position on the X-axis. For those that has the same time stamp the top one will be mentioned first. Those at the end of a line are indented:]\nI start trying to fix it\n\"It just needed cleaning!\"\nTake it apart\n\"Fixed it!\"\n\"Well, at least it's not more broken than when I started.\"\nTake it apart more\nWatch YouTube instructional videos\nTake a deep breath and cut wires\n\"That was heroic and I deserve a Nobel prize.\"\n\"Well, it sort of works now.\"\n(Turn to other possessions) \n\"...And let that be a lesson to you.\""
}