{
  "num": 2002,
  "url": "https://xkcd.com/2002",
  "title": "LeBron James and Stephen Curry",
  "img": "https://imgs.xkcd.com/comics/lebron_james_and_stephen_curry.png",
  "alt": "The 538TR attempts to capture a player's combined skill at basketball (either real-life or NBA 2K18) and election forecasting.",
  "year": "2018",
  "month": "6",
  "day": "4",
  "transcript": "NBA Playoffs DataDive \nLeBron James and Stephen Curry\nWhat makes these superstars so extraordinary?[The comic consists of several plots and tables, listed here from top to bottom, left to right.]Scatter plot of Social Security number vs Free throw percentage\n[Social Security numbers range from 000-00-0000 to 999-99-9999. No pattern discernable, aside from points being a bit denser in the middle of the plot. Stephen Curry is marked as a point on the right edge of the plot, corresponding to a high free throw percentage.]Scatter plot of 2018 points per game vs Average teammate APGAR score\n[APGAR scores range from 0 to 10. Pattern suggests a somewhat positive link between the two factors. LeBron James is marked as having a lot of points, but a low teammate APGAR score of approximately 2.1.]Shot map\n[Legend: grey dot for all players, black dot for Stephen Curry]\n[A diagram of a basketball court is shown with dots placed where players have taken shots at the goal. For the all players category the dots generally cluster next to the goal basket and in front of the three point line. Stephen has 3 dots next to the basket (one is behind it), but does cluster next to the three point line. He also has several dots on the other side of the playing field, and outside it, including three in the bleachers and one in the locker room.]Sandwiches eaten during play vs Win %\n[Sandwiches eaten range from 0 to 4. A plot that suggests no relation between the factors because practically all dots are in the zero sandwiches column. 2018 Warriors have one dot at around 60% and 4 sandwiches.]2018 total points\n[A table listing teams and their points overall and \"When net is within 15° of magnetic north\". The rows for the Golden State Warriors and the Cleveland Cavaliers are highlighted, the latter showing an abnormally high score in the magnetic north column.]\n\n 2018 total points\n\n Overall\n\n When net is within 15° of magnetic north\n\n\nGolden State Warriors\n\n9304\n\n330\n\n\nHouston Rockets\n\n9213\n\n268\n\n\nNew Orleans Pelicans\n\n9161\n\n219\n\n\nToronto Raptors\n\n9156\n\n341\n\n\nCleveland Cavaliers\n\n9091\n\n1644\n\n\nDenver Nuggets\n\n9020\n\n280\n[A table at the bottom:]\n\n\n\n Stephen Curry\n\n LeBron James\n\n\nHave you heard of him\n\nProbably\n\nYes\n\n\nPresident during most recent game 7 loss\n\nObama\n\nBush\n\n\nPog collection\n\nLarge\n\nStaggeringly large\n\n\nCareer average Fed interest rate\n\n3.42%\n\n4.41%\n\n\nName Scrabble score\n\n22\n\n22\n\n\nBest sport\n\nBasketball\n\nBasketball\n\n\nHeight\n\nOver 6'\n\nOver 6'\n\n\nRetirement year\n\n2027\n\nUnknown\n\nNate Silver\n\n\nFiveThirtyEight total rating(devised by Nate Silver to combine all metrics into a single stat)\n\n37.4\n\n31.8\n\n86.6\n"
}