{
  "num": 2010,
  "url": "https://xkcd.com/2010",
  "title": "Update Notes",
  "img": "https://imgs.xkcd.com/comics/update_notes.png",
  "alt": "v3.0.2: Hey, if anyone still using this app is headed to the beach, can you stop at 4th and River St and grab the sunscreen from my car? Trunk should be unlocked. Thanks!",
  "year": "2018",
  "month": "6",
  "day": "22",
  "transcript": "[There are two panels that show smartphone-esque screens with two different apps with different update notes, showing a conversation between two people. New updates are added to the top, so to follow the conversation flow one would start from the bottom and alternate between the second app and the first one.]\n[At the top, the status bars between the two panels are slightly different: telephone reception, WiFi strength, battery, GPS...][\"Updates\" is written in uppercase at the top. The first app's icon is an \"A\" symbol. Next to it, there is the following information:]\n[The app name is a scribble]\nVersion 3.0.1\nJune 22, 2018Update Notes:v3.0.1\nI'm actually off work Monday so that's perfect.v3.0\nOh, that sounds fun! What night?v2.8.31\nAre you around this weekend? We're heading to the beach.v2.8.3\nHey Mike, you there?[\"Updates\" is written in uppercase at the top. The second app's icon consists of three stars arranged in a triangle. Next to it, there is:]\n[The app name is a scribble followed by two stars in parentheses]\nVersion 7.0\nJune 22, 2018Update Notes:v7.0\nIt peaks August 12-13th.v6.8.16\nSorry, no, going to a wedding. But do you want to camp out for the meteor shower in August?v6.8.15\nYeah, what's up?v6.8.14\nIntroduced bugs and degraded performance[.][At the bottom of each panel, there are menu icons: a star, a stack of rectangles, a bullet list, a magnifying glass and an arrow pointing down to a square][Caption below the panels:]\nMy friend and I both have apps we've stopped maintaining, so we just use the updates to chat.[For convenience, here are the update notes in order of release (note that the first is not part of the conversation with Mike):]\"A\" app (v6.8.14): Introduced bugs and degraded performance[.]\"3-star\" app (v2.8.3): Hey Mike, you there?A (v6.8.15): Yeah, what's up?3-star (v.2.8.31): Are you around this weekend? We're heading to the beach.A (v6.8.16): Sorry, no, going to a wedding. But do you want to camp out for the meteor shower in August?3-star (v3.0): Oh, that sounds fun! What night?A (v7.0): It peaks August 12-13th.3-star (v3.0.1): I'm actually off work Monday so that's perfect."
}