{
  "num": 2101,
  "url": "https://xkcd.com/2101",
  "title": "Technical Analysis",
  "img": "https://imgs.xkcd.com/comics/technical_analysis.png",
  "alt": "\"I [suspect] that we are throwing more and more of our resources, including the cream of our youth, into financial activities remote from the production of goods and services, into activities that generate high private rewards disproportionate to their social productivity. I suspect that the immense power of the computer is being harnessed to this 'paper economy', not to do the same transactions more economically but to balloon the quantity and variety of financial exchanges.\" --James Tobin, July 1984",
  "year": "2019",
  "month": "1",
  "day": "21",
  "transcript": "[A series of red and green box-and-whisker plots form a line that starts in the bottom left corner of the image and wiggles up to the top right corner, with a series of peaks and troughs that resemble a typical stock market diagram. The diagram is annotated with lines, arrows and text.][Title in top left corner]\nThe basics of technical analysis[A roughly horizontal section with mostly green boxes:]\nAllegro[A horizontal bracket encompasses the next three sections]\nPrologue[Slope becomes slightly negative. Mostly red boxes, bordered with a black line above and below:]\nDecline[A roughly horizontal section with mostly green boxes, bordered with a black line above and below:]\nDoldrums[Line curves upwards with mostly green boxes, with a dashed black line below:]\nSpline[Three green boxes at minor peaks in the line are circled and indicated with arrows:]\n[Hmm!][A section with slight positive slope and a mixture of red and green boxes, with a solid black line below:]\nLumbar support[Slope increases. All green boxes, with a black line through the centre:]\nRenewal[A sharp upwards incline, with two large green boxes:]\nHark! The cliffs![Two black dots and a dashed black line connect two major peaks:]\nThese two points define a line! Promising signal[Inside trough between two major peaks is a roughly drawn black triangle:]\nBathtub[Slope becomes negative, mostly red boxes with a black line through the centre:]\nDeclination[At the lowest point of the trough:]\nInflection[Slope becomes positive, mostly green boxes with a black line through the centre:]\nUptalk[Slight negative slope, with large error bars. Mixture of red and green boxes. One red box is marked with an arrow:]\nYikes![Negative slope, all red boxes. Gap between two central boxes is circled:]\nWrong![Line rises then falls. Mixture of red and green boxes with non-parallel dashed black lines above and below:]\nIf I add some lines here I can convince myself I'm doing something more than just seeing patterns in a graph of a random walk.[Positive slope, all green boxes with a black line through the centre:]\nSlope![One error bar on a green box is circled:]\nCould be an omen?[Arrow indicating peak:]\nRed + Green = Christmas![Positive slope, all green boxes with a wiggly black arrow through the centre. A separate arrow points off the edge of the page:]\nLikely to continue forever"
}