{
  "num": 2126,
  "url": "https://xkcd.com/2126",
  "title": "Google Trends Maps",
  "img": "https://imgs.xkcd.com/comics/google_trends_maps.png",
  "alt": "It's early 2020. The entire country is gripped with Marco Rubio fever except for Alaska, which is freaking out. You're frantically studying up on etiquette and/or sexting.",
  "year": "2019",
  "month": "3",
  "day": "20",
  "transcript": "The least informative\nGoogle Trends Maps\nI've created over the years(All are real but not all cover the same date range)[12 maps of the United States are shown with the states colored. There are labels for the colors.][Map 1]\n[Blue:] Frostbite\n[Red:] Heat stroke\n[Alabama, Arizona, Arkansas, California, Florida, Georgia, Hawaii, Idaho, Louisiana, Mississippi, Nevada, New Mexico, Oklahoma, Oregon, South Carolina, Tennessee, Texas, Utah, and Washington are red. All other states are blue.][Map 2]\n[Blue:] Best church\n[Red:] Best strip club\n[Nevada is red. Alaska, North Dakota, and Wyoming are gray. All other states are blue.][Map 3]\n[Blue:] Bigfoot\n[Red:] Mike Pence\n[Indiana is red. All other states are blue.][Map 4]\n[Blue:] Etiquette\n[Red:] Sexting\n[Alabama, Alaska, Arkansas, Delaware, Hawaii, Iowa, Kentucky, Louisiana, Michigan, Mississippi, Missouri, Nebraska, Nevada, New Jersey, New Mexico, North Dakota, Ohio, South Dakota, Tennessee, Vermont, and West Virginia are red. All other states are blue.][Map 5]\n[Blue:] Little dog\n[Red:] Big cat\n[Arizona, Arkansas, California, Colorado, Idaho, Iowa, Maine, Mississippi, Nebraska, Nevada, New Jersey, New Mexico, Oklahoma, South Carolina, South Dakota, Tennessee, Texas, Utah, Virginia, Washington, and Wyoming are blue. All other states are red.][Map 6]\n[Blue:] Shark attack\n[Red:] Childbirth\n[California, Connecticut, Delaware, Florida, Georgia, Kentucky, Louisiana, Maine, Massachusetts, Nevada, New Hampshire, New Jersey, New Mexico, New York, North Carolina, Oregon, Pennsylvania, Rhode Island, South Carolina, Texas, Virginia, and West Virginia are blue. All other states are red.][Map 7]\n[Blue:] Snakes\n[Red:] Ants\n[Yellow:] Bees\n[Green:] Alligators\n[Florida is green. Iowa, Maine, Massachusetts, Minnesota, Montana, Nevada, New Jersey, New Mexico, Oregon, Pennsylvania, and Wisconsin are red. Alaska, Arizona, California, Connecticut, Hawaii, Illinois, Indiana, Michigan, New Hampshire, New York, North Dakota, Ohio, Rhode Island, Utah, Vermont, Washington, and Wyoming are yellow. All other states are blue.][Map 8]\n[Blue:] Retirement planning\n[Red:] Bungee jumping\n[Alaska, Delaware, Hawaii, Idaho, Mississippi, Montana, New Mexico, North Dakota, South Dakota, Vermont, West Virginia, and Wyoming are gray. Indiana, Iowa, Kansas, Maine, Maryland, Minnesota, Missouri, Nebraska, New Hampshire, New York, North Carolina, Ohio, Virginia, and Wisconsin are blue. All other states are red.][Map 9]\n[Blue:] Super Bowl\n[Red:] Funeral home\n[Alaska, Arizona, California, Colorado, Connecticut, Florida, Hawaii, Idaho, Nevada, New Jersey, New York, Oregon, Pennsylvania, Texas, Utah, and Washington are blue. All other states are red.][Map 10]\n[Blue:] Resume tips\n[Red:] Skateboard tricks\n[Arizona is red. Alaska, Hawaii, Idaho, Maine, Mississippi, Montana, New Hampshire, New Mexico, North Dakota, South Dakota, Vermont, West Virginia, and Wyoming are gray. All other states are blue.][Map 11]\n[Blue:] Donald Trump\n[Red:] What do I do\n[California, Connecticut, Delaware, Florida, Illinois, Maine, Maryland, Massachusetts, Michigan, Minnesota, New Hampshire, New Jersey, New York, Oregon, Rhode Island, Vermont, Virginia, Washington, and Wisconsin are blue. All other states are red.][Map 12]\n[Blue:] Existential crisis\n[Red:] Marco Rubio\n[Alaska is blue. All other states are red.]"
}