{
  "num": 2148,
  "url": "https://xkcd.com/2148",
  "title": "Cubesat Launch",
  "img": "https://imgs.xkcd.com/comics/cubesat_launch.png",
  "alt": "Luckily, the damages were partly offset by the prize money we got from accidentally winning the nearby water skiing championship tournament.",
  "year": "2019",
  "month": "5",
  "day": "10",
  "transcript": "[Megan is holding a cube attached by a string to a quad-copter drone flying above her head. She talks to Cueball standing next to her.]\nMegan: A spot on a CubeSat launch costs a lot, but you can get a drone and a spool of fishing line for cheap.\nCueball: Uh oh.[A wide shot of Megan flying the drone with the cube at her feet while Cueball stand behind her looking after the drone that flies up to the left.]\nMegan: No no, watch.\nMegan: This is gonna go great.[Wide shot of a rocket standing on its launch pad with the support tower. The, now very small, drone is approaching, string attached, from the right.][Slim shot of the rocket as the drone attaches to the rocket, just under the tip with the payload. The string goes down and out to the right.]\nMegan (off-panel): Perfect![A huge cloud is emitted from the bottom of the rocket as it lift off the ground every so slightly.]\nFoom[As the rocket is taking off it begins tilting in the direction of the string. Two off-panel voices come from Megan and Cueball's direction.]\nOff-panel voice #1: Should it be tilting already?\nOff-panel voice #2: Hey, move your leg.[Close up of Megan and Cueball struggling in tangle of string that surrounds Megan while she is holding the cube in one hand and the remote for the drone in the other. Cueball uses both hands to try and help her out of the tangle. The string goes out to the left towards the rocket.]\nMegan: Ugh, let go, I can get-\nCueball: -No, lift your other arm-[Three slim panels follow, one above the others, of the rocket, with string, tilting increasingly to the right and down as if pulled by the string. In the final panel of the three the tip of the rocket is now further than where the string goes down to the bottom of the panel. So the string now goes back left from where it is attached to the rocket, rather than to the right as in all previous panels.][Megan entangled in the string with the cube in her hand and Cueball hanging below her holding on to the string, are flying through the air, as the string goes up right, and with small lines drawn above it to indicate it is moving to the right. On the ground Science Girl holds a hand to her mouth looking up at them, while a guy looking like Cueball runs away with hands over his head.]\nMegan and Cueball (screaming): Aaaaaa[A disheveled looking Megan and Cueball both with plaster casts on their arms stand before four people, Hairbun, another Cueball like guy, Ponytail and Hairy. They are the members of an interview panel and are sitting behind a desk like table with a large label on its front:]\nLaunch accident investigation board\nMegan: Listen.\nMegan: Space exploration is never going to be completely safe."
}