{
  "num": 2150,
  "url": "https://xkcd.com/2150",
  "title": "XKeyboarCD",
  "img": "https://imgs.xkcd.com/comics/xkeyboarcd.png",
  "alt": "The key caps use LCD displays for all the vowels, so they can automatically adjust over the years to reflect ongoing vowel shifts while allowing you to keep typing phonetically.",
  "year": "2019",
  "month": "5",
  "day": "15",
  "transcript": "[Headings above a drawing of a very special keyboard:]\nIntroducing the \nXKeyboarCD\nA keyboard for powerful users and their powerful fingers®[The keyboard has many more keys than a usual Keyboard. Usual keyboards for stationary computers typically have a few of the rows with 21 keys, and then some with fewer. This Keyboard has 28 keys on the top row. The other rows have special keys that make it difficult to compare, but there is basically also room for 28 in the bottom row, except one spot where there is one key in a space for 2x2 keys. Begining from the bottom and coutning keys there are 27. Skipping those that take up space in two or more rows, when going to the next row from the bottom there are 23, then 24, then 18, then 27 and finally 28 keys in the top row, for a total of 147 keys (vs 105 on a regular keyboard). Then there are 54 extra keys above the keyboard to the left (27 shown) and 156 in 6 rows of 26 to the right for a total of 357 keys 330 shown. All six rows have keys all the way over with no empty space in between, as there are on regular keyboards. Also there are no space between the top row (with F1 button etc) and those below. At each side of the keyboard the keys do no align at the edges, which is normally the case. The keyboard has several special features, most of which are labeled. The only special features that is not labeled is a small square with 2x2 keys that are elevated a bit above all other keys. It is in the region above the normal position of the four arrows. All eight other special features have an arrow pointing to them from their labels. Here below is a description of the labeled items as well as a transcript of their labels. They are listed in the order of their labels first above and then below the keyboard going from left to right.][Five keys close to the QWERTY keys positions have colorful emoji on them. They each take up the space of 2x2 normal keys, although it is not clear if all the \"normal\" keys have the same size:]\nHardcoded plastic keys for the 5 most useful emoji\n😰 😂 🐙 🏇 🚡[A cube with 3x3 keys on each side hangs above the keyboard to the left supported by a small rod. Three sides are fully visible, 27 keys:]\n54 configurable Rubik's keys[Just right of the middle above the main keyboard is a cylinder with keys inside in 6 rows of 26 keys (126 in all). It either decreases in diameter into it making it look almost like a tunnel, or is drawn as if it almost disappear in the far distance, being much deeper than it should be.]\nErgonomic design[In the region where the normal numberpad would be there are 15 numbers from 1 to 15 in a 4x4 grid leaving space for an empty key hole. There is a row of keys both above and below this grid. The numbers do not come in order from 1 to 15, but rather in a jumble. Also the empty hole is not a full key spot. Instead it is in the second row of numbers, with a bit more space to the left than to the right of the middle of the three keys.]\n\n15 puzzle-style numberpad\n\n\n1\n\n8\n\n4\n\n12\n\n\n7\n\nEmpty area\n\n11\n\n3\n\n\n15\n\n6\n\n10\n\n9\n\n\n2\n\n5\n\n13\n\n14\n[To the left in the second row (below the Caps Lock position) the outer key is twice as wide as the other normal keys.]\nSerif Lock[An arrow points to the eight key in the bottom row, but is probably just referring to all the keys in general:]\nUnlimited key travel[There is a segment of the keyboard that seems to be empty of keys, but still white like the rest of the keys, not black as where keys are actually missing. It is where on a regular keyboard, the normal keys are separated from the special function keys. But it turns out it is indeed a long key going vertically:]\nDiagonal spacebar[Where the four arrow keys are on a regular keyboard there is a 2x2 key segment that only has one key in the middle with black background around it. It has an arrow head on it pointing right. That is if the key had not been turned about 45 degree counter clockwise, so the arrow points up to the right.]\nArrow key (rotate to adjust direction)"
}