{
  "num": 2189,
  "url": "https://xkcd.com/2189",
  "title": "Old Game Worlds",
  "img": "https://imgs.xkcd.com/comics/old_game_worlds.png",
  "alt": "Ok, how many coins for a cinnamon roll?",
  "year": "2019",
  "month": "8",
  "day": "14",
  "transcript": "[A light gray drop down menu is shown with three sections split up with three grays lines split up with section titles in the same gray font. Beneath each section title is 3, 4 and 6 lines of black text. An white arrow cursor hovers over the second last option, which is thus highlighted with a dark gray background and white text.]\nNew Games\nSubnautica\nRussian Subway Dogs\nKerbal Space Program\nOld Games\nWorms Armageddon\nElasto Mania\nKatamari Damacy\nMario Kart\nVery Old Games\nLink's Awakening\nEscape Velocity\nSimCity\nPrince of Persia\nSuper Mario Bros\nMS Flight Simulator 3[A colorful scene is shown from the Super Mario Bros. side-scrolling game, the first level World 1-1. Mario with red hat and trousers is standing on the brown blocks beneath the blue sky. Another character in the game, Goomba, is standing in front of some green bushes. Above them is narration text:]\nNarrator: It feels weird that you can go into old games and the whole world is still there.\nGoomba: Mario?\nMario: It'sa me!\nGoomba: What are you doing here?[Mario stands between an e-scooter, a dismounted and broken Question Mark Box lying on its side and a cellphone tower. Narration continues above:]\nNarrator: Part of me expects to find that everything's changed.[Mario looks at a damaged green but rusty Warp Pipe and there is a quadcopter drone flying by over his head. Weeds are growing both from the pipe and from the blocks he is walking on. Narration continues above:]\nNarrator: That pipes have rusted, walls have crumbled, bad guys have moved on.[Mario has moved on to World 1-4, the castle has been replaced with a bakery. The blocks beneath his feet are now smaller and gray and above them is black background. The character Toad with the white hat with red circles is standing in front of a bakery disc with shelves of bread and cake behind it. There is a green sign on the front of the brown disk. Toad talks to Mario with white text in the black background. Above the black part of the image is more narration in a frame-less white section:]\nNarrator: That even our game worlds can't escape the passage of time.\nToad: Thank you, Mario!\nToad: But this is a Panera now!\nSign: Panera"
}