{
  "num": 2190,
  "url": "https://xkcd.com/2190",
  "title": "Serena Versus the Drones",
  "img": "https://imgs.xkcd.com/comics/serena_versus_the_drones.png",
  "alt": "After the test, she said that if she had a choice, she wouldn’t defend herself against drones using a tennis ball and racket, though she would absolutely pick them over other sports equipment. But, she added, \"Drones don't bother me.\"",
  "year": "2019",
  "month": "8",
  "day": "16",
  "transcript": "[A panel at the top of the comic has a quote and to the right of the quote is a picture of Randall's new book. It is black with large blue text and smaller white text. On the book cover, in white drawings, are seen Megan with a ladder and either Black or White Hat (hard to say on black background). Both are looking up on Cueball who is floating in the air with a quadcopter drone beneath either leg, trying to plug in an electric light bulb in a naked lamp hanging down near him. It seems he has already removed the broken light bulb, as he has one in both hands. And now he tries to put in the new one. The blue text stating title and author can be read.]\n\"It's a pretty bad idea.\"\n—Serena Williams\non my ideaBook: How To\nBook: Randall Munroe[Caption below this panel above another set of panel:]\nWhich types of sports equipment would be most effective at bringing down a rogue photography drone? My new book features a real-world test by Serena Williams.[A large panel shows Serena Williams, with curly hair and a very large ponytail, swinging her tennis racket to smash a tennis ball towards, and hitting, a quadcopter drone flying towards her. As the ball hits a small explosion seems to happen with the drone which is stopped in mid air. Above the drone are two other drones flying towards her, with one more below. There is a broken drone on the ground in front of her. Three tennis balls lie behind her.][Three smaller panels are beneath the large panel. The first panel is smaller than the other two and a bit higher up than they are and is overlaying the second panel. It shows Serena jumping with the racket held high. No drones are shown, but her shadow can be seen beneath her.][In the next panel she is seen smashing her racket into one of the drones, breaking a rotor off, she is still hanging in the air, her shadow beneath her and her legs partly behind the previous panel, which is covering most of the left part of this panel. Another drone is flying above her.][In the final panel she is seen standing again, turning around facing the other way, taking another swing at two drones that try to evade her. The ground is now filled with debris from several smashed drones.][Caption beneath the panels, with the \"here\" in link blue color... The entire image is a link, so no need to click on the here though.]\nTo read an excerpt about Serena's drone battle, click here or go to blog.xkcd.com"
}