{
  "num": 2194,
  "url": "https://xkcd.com/2194",
  "title": "How to Send a File",
  "img": "https://imgs.xkcd.com/comics/how_to_send_a_file.png",
  "alt": "Note: How To will teach you lots of cool stuff about technology, data storage, butterfly migration, and more. Also you will never see your files again.",
  "year": "2019",
  "month": "8",
  "day": "26",
  "transcript": "[Randall, depicted as Cueball, stands with his arms spread out]\nRandall: It feels weird that it's 2019 and yet I still sometimes find that the easiest way to move a file around is to email it to myself.[Randall has raised a hand to his chin,]\nRandall: If only there were a better way...[A picture of Randall's new book is shown to the left of the text. The book is black with large blue text and smaller white text. On the book cover, in white drawings, are seen Megan with a ladder and White Hat. Both are looking up on Cueball who is floating in the air with a quadcopter drone beneath either leg, trying to plug in an electric light bulb in a naked lamp hanging down near him. It seems he has already removed the broken light bulb, as he has one in both hands. And now he tries to put in the new one. The blue text stating title and author can be read but not the white trext. The \"blog.xkcd.com\" link is in link blue color.]\nBook: How To\nBook: Randall Munroe\nMy new book How To is out next week! If you want to learn how to send data, you can visit blog.xkcd.com for a sneak preview of Chapter 19: How to Send a File[Beneath a heading are three pictures next to each other of a laptop computer. The first picture shows a regular laptop computer, with a labeled arrow pointing to the lower half of the computer. The second picture shows the laptop in a lighter outline, with scissors instructing to cut horizontally on a dotted line across the middle of the laptop. The third picture shows a laptop in two pieces cut over between the screen and the rest. There is a very jagged edge on both parts, which has been moved away from each other.]\nExclusive advice from How To:\nWhen sending a file, it helps to know which part of your device the file is stored in.\nLabel: Files are usually in this part"
}