{
  "num": 2198,
  "url": "https://xkcd.com/2198",
  "title": "Throw",
  "img": "https://imgs.xkcd.com/comics/throw.png",
  "alt": "The keys to successfully throwing a party are location, planning, and one of those aircraft carrier steam catapults.",
  "year": "2019",
  "month": "9",
  "day": "3",
  "transcript": "[As this is an interactive comic, not all possible text should be given in this transcript. Also, it is not possible to see all the different throwers or objects in one image. This transcript here includes the text that can be found when loading the page, without changing the thrower or object (the default), but also includes the text that can be found by scrolling in the two select \"windows\" as that would be similar to a long comic where you need to scroll as well as customization options. For further differences that occur by changing the objects refer to a table of all combinations.][A heading with a subheading is above a line, beneath which are a sentence, that is generated by the selections in the two windows beneath this sentence:]\nThrow Calculator\nThis calculator implements the approximate throwing distance estimation model from How To Chapter 10: How to throw things.How far could George Washington throw a Microwave oven?[Beneath this sentence are two \"windows\" with a frame around them, one to the left and one to the right, each with a heading breaking the top frame. Each also has a scroll bar to the right, which allows one to scroll down through 8 different possible selections in the left window and 16 in the right window. There are, depending on the browser zoom level, one or two selections on each line. Each window's content is given here under their respective headings. Each possible selection is a drawing with a caption beneath it.]\nSelect a throwerYou\nAn NFL Quarterback\nGeorge Washington\nPikachu\nCarly Rae Jepsen\nThor, God of Thunder\nChris Hemsworth\nA squirrelSelect an object to be thrown\nYou\nA microwave oven\nA basketball\nA blender\nA gold bar\nA wedding cake\nA ping-pong ball\nAn acorn\nThor's Hammer\nA javelin\nGeorge Washington\nPikachu\nA car\nA silver dollar (spinning)\nA silver dollar (tumbling)\nA squirrel[Below the two windows is the result of the animation that will happen when a selection has been made. An animation of the selected thrower throwing (or failing to throw) the selected object is shown, and the object's traveling distance is measured out both in meters (SI units) and in some other unit in brackets below. If the distance is not too long compared to the size of the object and thrower, then both can be seen, and in case the object is soft it may break from the throw.][In the pre-selected version, George Washington throws a microwave oven, which ends up several meters from him lying on a corner broken with its wire lying beneath it. The distance is given under the ruler along which the throw has occurred, with markings for approximately every meter. In this case, there are seven steps even though the distance is above 7 meters:]\n7.76 meters\n(25.46 feet)[Clicking on \"You\" in the thrower box opens a new window over the above described comic parts. some of the comic can still be seen including the thrower and his item, and a new throw occurs every time something is changed in this new window. It is a customization box with several options shown below.]Your Name\n____You_____ [can be changed]Height\n5.8 ft [number can be changed; ft can be changed to m]Mass\n160 lb [number can be changed; lb can be changed to kg]Athleticism\n[Below is a scale showing Black Hat, the character depicting You with a knit cap, George Washington, and a person with goggles and a helmet. A marker is set at You, but can be changed. Below the characters are descriptions.]\nBlack Hat: Moving objects around is for suckers.\nMinimal\nYou: I'm in decent shape and have pretty good form.\nDecent\nGeorge Washington: I'm so good at throwing they made me president.\nExtremely High\nGoggles: I use a time machine to train for 36 hours a day.\nChampion Athlete[Once done the box can be clicking on a cross at the top right or just clicking outside the window on the comic behind it. Now the thrower you (and the object you) will have the weight, length and strength chosen and will be able to throw (or be thrown) with these stats. ]"
}