{
  "num": 2222,
  "url": "https://xkcd.com/2222",
  "title": "Terminator: Dark Fate",
  "img": "https://imgs.xkcd.com/comics/terminator_dark_fate.png",
  "alt": "I was sent here to stop the robot that was sent here to protect the human who was sent here to protect the human who was sent here to destroy the robot that was sent here to vacuum the floor.",
  "year": "2019",
  "month": "10",
  "day": "30",
  "transcript": "[Cueball is walking to the right. Another Cueball, Cueball-2, appears behind him in a bubble of energy that appears with a loud sound. The bubble floats in the air behind the walking Cueball, with Cueball-2 inside holding his arms out to the side and having his legs bend.] \nZap![Cueball-2 from the sphere is standing to the left of Cueball, pointing at him. Cueball has stopped and is looking back over his shoulder]\nCueball-2: I've traveled back in time to stop you from seeing Terminator: Dark Fate![Cueball-2 is looking at Cueball who has turned around and holds his arm a bit out to the sides.]\nCueball: But it looks so good! Reviews are actually decent! Mackenzie Davis! Linda Hamilton is back![Cueball-2 is holding both arms up, hands held down as Cueball stands normally.]\nCueball-2: I know, but you always think this, and you're always disappointed.\nCueball: I guess...[Zoom out as another Cueball, Cueball-3, appears to the left in a similar bubble of energy and noise as in the first panel, his arms are out to the sides and his legs are bent. Cueball-2 is holding a hand in front of his mouth, while Cueball throws his arms out to the side.]\nZap!\nCueball-3: Hi, I'm from the future where you didn't watch it and I realize I still kind of want to see it.\nCueball: Let's go together![Another bubble appears from the right of the three Cueballs, the one in the middle (Cueball-2) holding his arms out. This new bubble contains two Cueballs. The first, Cueball-4, throws up his arms over his head, while Cueball-5 has one arm out in front of him. Both have their legs bent.]\nCueball-4: No! We're both of you from the future! We're here to stop you![In a large panel, five more individual energy bubbles with five Cueballs appear. Two of the bubbles float over the now five Cueballs on the ground. The other three are a bit lower and in line to the right. Cueball-6 to 10 are in different poses, all with their legs bent, all the way to sitting on the knees in one case and most of them throw their arms out to the side. All look down at the five regardless of their bubble's position. Their text is alternating between being up and down, so the text goes over or below the other text, making it hard to decide which comes first. This may be intentional. But here they are in the order of Cueballs as they come from left to right:]\nCueball-6: I'm here to stop you!\nCueball-7: I'm here to stop the robot sent to stop you!\nCueball-8: I'm here to protect you from...you? I lost track.\nCueball-9: I'm here to kill Hitler. Did I get the right year?\nCueball-10: I'm here to get tickets because in like 20 minutes you people buy them all."
}