{
  "num": 2234,
  "url": "https://xkcd.com/2234",
  "title": "How To Deliver Christmas Presents",
  "img": "https://imgs.xkcd.com/comics/how_to_deliver_christmas_presents.png",
  "alt": "Building codes in hurricane zones rely on studies of how easily flying debris can break residential windows. If you're looking for a science fair project idea and you hate your neighbors, I'm sure they could always use more data!",
  "year": "2019",
  "month": "11",
  "day": "27",
  "transcript": "[The comic is divided into three sections. The top section contains one low panel stretching across the entire comic. It has a header (same as the title of the comic) with a sub-header beneath. Then below that is a picture of Randall’s new book How To. The black book is shown standing. The blue title is readable but the white text beneath it as well as blue and white text below the image is unreadable. On the cover is a white drawing of Cueball putting in a light-bulb with a quad-copter under each foot. White Hat is watching as Megan walks in with a ladder. Next to the book is a segment of text with a blue link at the end. Beneath this is a text from where a curved arrow goes to the book.]\nHow To Deliver Christmas Presents\nIn a future without chimneys\n How To\nFor more questionable ideas for using science to solve problems, check out my new book, How To! Click on this comic or go to xkcd.com/how-to\nGood Christmas gift![The second section has three normal sized panels on the same row. In the first panel, Randall, drawn as Cueball, is presenting the problem of the comic, while holding one hand out palm up.]\nRandall: The traditional way to get Christmas presents into a house is to have a large reindeer-herding man slither down the chimney with them.\nRandall: Unfortunately, chimneys are becoming less common in the United States.[The middle panel shows a line graph with one black and four gray lines. The X-axis is a time scale, with small ticks for each year and larger labeled ticks for every fifth year. The Y-axis is a percentage range with small ticks for every 5% and larger labeled ticks for every 10%. Each of the gray lines are swinging up and down quite a lot, but all but one of them clearly falls down as times passes. The black line has a clear downwards falling tendency. Each line has a label written on segments of the lines, where the lines are thus disrupted. For the gray lines the text is also gray. Above the lines are the following text:]\nDisappearing chimneys\nPercentage of new homes with fireplaces\nSource: Census Bureau Survey of Construction\nX-Axis: 1990  1995  2000  2005  2010  2015\nY-Axis:  40%  50%  60%  70%  80%\nOverall\nWest\nMidwest\nSouth\nNortheast[In the third and last panel of this segment Randall, holding his arms out, explains that there are other ways to solve the problem.]\nRandall: But that's OK; there are other ways to get a gift into a house\nRandall: Here are a few options![The last segment has a large panel taking up the bottom half of the comic. At the bottom of this panel there are even two smaller comics which lie over this panel and break the bottom border of the panel. They relate to the information in the large panel. In the middle of this panel is a detailed drawing of a house. The tiles of the roof are all individually drawn (8 rows with about 23 tiles each for a total about 180 tiles). To the right on the roof top is a chimney indicated with a dotted line, showing where it is not present.  The front of the house has two small windows to the left, a door with door knob, in the middle of the house, with a two steps stair in front of it and a large window with three segments to the right. All three windows have curtains visible and are divided in two, a top and a bottom part On the top of the middle segment there is a handle for opening the windows, all five segments of them. In the window to the left sits a cat and in the central segment of the large window to the right sits Pikachu. The foundation of the house is drawn as 4 rows of bricks to the left (about 12 in each row) and three to the right (about 16 in each row, for 48 on both sides for a total of about 96). ] [To the left on the side of the house is a line indicating a ventilation shaft. Three arrows end there. They are coming from a bunch of particles of a disintegrating black book with part of a title still readable. Other text is visible, but not readable. Only the first word of the title can be read, but even here the last letter is already partly dissolved. The book is hanging above the grass on the ground below it to the left of the house. Above the book is a section of text marked with a large white number 1 inside a black circle.  Beneath the book this text continues. Bordering this text is a one panel comic belonging to this text segment.]\n1 Even without chimneys, houses aren't airtight. If you vaporize the gift, parts of it will enter the house through the intake vents...\nBook: How\n...And it will stay there.\nAccording to a 2008 study from Clarkson University, particles of your gift that settle in their house will remain there for an average of several months if they vacuum, and seven decades if they don’t\nSource: DOI 10.3155/1047-3289.58.4.502[The one panel comic is on top of the large panel beneath the door to the house, but about three times as wide. In the panel, Megan and Cueball are reacting to statement 1. Cueball is walking away from her to the right.]\nMegan: Seven decades?!\nCueball: BRB, I need to go vacuum.\nMegan: Houses are disgusting[To the right of the house a gift wrapped present is flying towards the large window, with five lines indicating its speed and direction. Beneath the book is a line indicating the ground away from the house. There is a large segment of text surrounding the book on the three sides away from the house. Above the present next to the dotted-lined chimney is a large white number 2 inside a black circle. Then follows text which goes out to the edge of the panel, and this text continues down to the level of the book where it then only continues to the right of the speed lines. And then finally two lines of text are beneath the book above the ground next to the house.]\n2 The critical momentum necessary for a projectile to break glass is around 4 kg*m/s. (40 for ½\" plywood.)\nSource: fema.gov/previous-missile-impact-test-wood-sheathing\nThis means you can deliver a book-sized gift by hurling it at a window at 25+ mph\nSpeed = book mass/ 4 kg*m/s = 25 mph\nBut if they’ve put up plywood shutters, you’ll need 250mph+ delivery speeds.[Finally beneath the house and text segment 2, there is a large white number 3 inside a black circle adjacent to the top right of the segment 1 panel comic. Next to this is the final text segment in this panel. Beneath this text is yet another comic, this time in five panels referring to the text, where the panels also break the lower border of the large panel.]\n3 Wait until they order a different book, then intercept the package, open the binding, and replace the pages with the ones from yours.[The five panel comic is on top of the large panel but beneath the text segment 3. ]\n[Black Hat opening a box with one hand while having his own book under the other arm.][The book cover is open, the pages from the original book have been removed and are interchanged with those from Black Hat’s book, two arrows indicating the switch.][Black Hat carrying a closed box.][Cueball going down to retrieving the package from the bottom of a three step stairs.][Cueball is standing next to the open box reading the book.]\nCueball: ...Ugh, real-life content injection. \nOff-screen voice: We need HTTPS for paper."
}