{
  "num": 2240,
  "url": "https://xkcd.com/2240",
  "title": "Timeline of the Universe",
  "img": "https://imgs.xkcd.com/comics/timeline_of_the_universe.png",
  "alt": "Not actual size, except technically at one spot near the left.",
  "year": "2019",
  "month": "12",
  "day": "11",
  "transcript": "[A large header is above the main drawing:]\nTimeline of the Universe[The drawing shows a diagram of the evolution of the universe from the Big Bang (left) to the present right with lines indicating possible futures continuing right of the main drawing. The drawing is that of a black horn of plenty, very thin to the left and then it becomes broader, mainly in steps but also slightly between each step. n a few places the diameter decreases a bit. Along the \"tube\" are segments divided with thin white lines, with about equal distance between them. The first 20 the tube is black, but then stars form, shown as many white dots, and finally in the last 3-4 segments galaxies are shown. At the top and bottom of the opening to the right there are four dashed lines which behaves the same way. Two points inward, two continue the trend from before they begin, two goes out fast again, and then falls back to slow increase, and two goes almost straight up and down. At the far left there is a line going in to a small dot. On the line before the dot are two questions mark. A line points to the dot which has a starburst around it. It represents the Big Bang. After this firs labeled point on the drawing there are mange other labeled sections with a line going from the label to a segment on the drawing. There are 9 above, 9 below and one at each end. The one at the right end pointing to the four dashed future lines at the top. From left to right in the order they are labeled on the timeline, the labels are:]\n??\nBig Bang\n[The Universe comes in as a circle with action lines around it. It stays the same size for a while.]\nPlanck Epoch\nMedium Bang\n[The Universe starts inflating very slowly]\nInflation\n[The Universe briefly inflates very rapidly, and returns to its normal rate of expansion.]\nQuark Epoch\nLepton Epoch\nPhoton Epoch\nCool Bug Epoch\n[The Universe starts inflating and deflating rapidly, forming a series of bumps in the universe diagram like the grip on a hand tool.]\nMolded grip\n[Stars appear in the timeline. The Universe starts inflating slightly faster than before.]\nStars form\nStagflation\n[The Universe starts deflating slowly.]\nSettling\nRebound\n[The Universe starts inflating slowly again.]\nSomeone tripped and accidentally hit the \"Inflation\" switch again\n[The Universe starts inflating at the same rate as the Inflation section.]\nEmergency Stop triggered\n[The Universe abruptly stops inflating, and stays level.]\n[Galaxies appear in the timeline. The Universe starts inflating at a medium pace.]\nGalaxies form\nEarth forms\nPresent day\n[We see the edge of the Universe, with a rounded shape. Various dotted line predictions are on the edges.]\nFuture Cosmological development handed over to J.J. Abrams, outcome unknown"
}