{
  "num": 2242,
  "url": "https://xkcd.com/2242",
  "title": "Ground vs Air",
  "img": "https://imgs.xkcd.com/comics/ground_vs_air.png",
  "alt": "Water is thinner than both, and fire is *definitely* thicker.",
  "year": "2019",
  "month": "12",
  "day": "16",
  "transcript": "[Caption above the drawing]:\nWhich is thicker—the ground or the air?[The drawing shows a Winkel tripel projection of the Earth. The features of the main map is unlabeled, with only the outlines of the landmasses present. Various parts of the map are labeled with \"Air\" (four times) or \"Ground\" (5 times). Areas marked as \"Ground\" are differentiated with gray shading. These are always over large landmasses or close to them. They cover most of North America (labeled), the northern part of South America (labeled), Northern Europe and most of Asia (labeled), Japan, most of Australia and part of the Indonesia, Western Africa, sub-equatorial Africa (labeled), and finally the central parts of Antarctica (labeled). Air is written on the West Coast of the United States, in the Atlantic Ocean, over the central part of Africa and in the Pacific Ocean, near the Philippines.]\n[Over West Coast of the United States]: Air\n[Over North America]: Ground\n[Over Atlantic Ocean]: Air\n[Over South America]: Ground\n[Over the central part of Africa]: Air\n[Over the southern part of Africa]: Ground\n[Over Asia]: Ground\n[Over Pacific Ocean]: Air\n[Over Antarctica ]: Ground[A small diagram is present in the Pacific Ocean left of South America. The diagram depicts several labeled layers of Earth and its atmosphere, listed below. Cueball, a body of water, and several mountains are shown on the flat surface part of the diagram, with the ocean floor lower than where Cueball stands. Above is a line representing the border to space. The line beneath the surface is much more curved going both up and down. Two double arrows representing the thickness of the atmosphere and the lithosphere are drawn between the surface and the layers above and below. Another curved double arrow is pointing to each of these distances and it is marked with a question mark in the middle of the line.]\nSpace\nAtmosphere\nLithosphere\nAsthenosphere\n?[In the bottom right corner of the comic with gray text is a reference:]\nBased mostly on Conrad and Lithgow-Bertelloni (2006) DOI.1029/2005GL025621"
}