{
  "num": 2249,
  "url": "https://xkcd.com/2249",
  "title": "I Love the 20s",
  "img": "https://imgs.xkcd.com/comics/i_love_the_20s.png",
  "alt": "Billboard's \"Best of the 80s\" chart includes Blondie's 1980 hit \"Call Me.\" QED.",
  "year": "2020",
  "month": "1",
  "day": "1",
  "transcript": "[Megan walks in from the left greeting Cueball, White Hat, and Ponytail standing next to each other, the last two looking in her direction.]\nMegan: Happy new decade!\nPonytail: Welcome to the '20s!\nWhite Hat: Actually—\nPonytail: I'm excited we can name decades again. \nPonytail: \"Aughts\" and \"teens\" never caught on.[Megan stops next to Cueball as White Hat has his finger raised.]\nWhite Hat: Actually, the new decade doesn't start-\nPonytail: Mostly, I'm just glad we can go back to attributing cultural trends to decades instead of generations.[All four just stand normal.]\nCueball: Yeah.\nCueball: Decades were silly, but making everything about \"millennials\" turned out to be even worse.\nPonytail: Seriously.[Only White Hat and Ponytail are shown, both with their arms held out to the sides.]\nWhite Hat: It's technically not a new decade until 2021.\nPonytail: OK, listen.\nPonytail: If you're going to be pedantic, you should at least be right.\nWhite Hat: I am right!\nPonytail: You're not.[Zoom in on White Hat and Ponytail's upper bodies as they gesture towards each other both raising their hands palm up. Megan interrupts them from off panel, as made clear in the next panel. Her voice comes out of a starburst on the left panel frame.]\nWhite Hat: See, the 20th century didn't start until--\nPonytail: But decades aren't centuries. They're not cardinally numbered.\nWhite Hat: You don't get it. Let me draw a--\nPonytail: No, you don't--\nMegan (off-panel): Stop![All four characters are displayed again. Megan has raised a finger and all the others look at her.]\nMegan: I can resolve this.\nMegan: *Ahem*\nMegan: MC Hammer's U Can't Touch This (1990) was featured in I Love the '90s, not  '80s.\nPonytail: ...That settles that.\nWhite Hat: Yeah, I accept VH1's authority.\nWhite Hat: You win."
}