{
  "num": 2258,
  "url": "https://xkcd.com/2258",
  "title": "Solar System Changes",
  "img": "https://imgs.xkcd.com/comics/solar_system_changes.png",
  "alt": "\"Actually, Jupiter already has a very impressive ring system!\" --someone who knows Jupiter is within earshot",
  "year": "2020",
  "month": "1",
  "day": "22",
  "transcript": "[A not-to-scale diagram of the solar system is shown with the right edge of the sun on the left side, featuring all eight planets along with their major moons, Pluto (along with its major moon), and the asteroid belt. The original solar system is drawn in black, but several changes have been proposed. If some of the existing planets are removed or changed, they are greyed out, possibly with red crosses over them or red circles or arrows. New planets, moons, rings and asteroids have been added all in red. Each change has been labeled with red text. Only the Sun and Mercury are completely unchanged, Earth and Neptune are not changed directly but their moons have changed. The only black text is a caption at the top:] \nChanges I Would Make to the Solar System[Below each of the changes to the solar system is mentioned from left to right, with their labels, that are all in red text. Except for the label under Jupiter and Saturn, there is a line going from the changes to the relevant label.][Three additional planets, one Mercury sized and two smaller on either side very close to each other, have been drawn in between Mercury and the Sun. A bracket marks all three of them and a long line goes from that to the label above, which is even above the next label positioned above the planets.] \nAdd mysterious planets inside Mercury's orbit[A ring has been drawn around Venus, and a dot representing a moon has been added on its left. A small line goes from the label beneath to Venus.]\nAfter what it's been through, Venus deserves rings and a moon[Next to Earth, drawn with four of the major continents visible, the Moon has been grayed out and crossed out with a red X. Also Mars has been grayed out and it is inside a red circle. An arrow goes from the circle around Mars to the Moon. a small line goes from the arrow between the Moon and Mars to the label above the planets.]\nReplace our moon with Mars. Mars is more interesting and we can consolidate missions.[An additional planet, all in red, has been added between Mars and the asteroid belt, about halfway in size between Earth and Neptune. Four continents are visible in a large ocean, along with weather patterns as in an atmosphere. A small line goes from the planet to the label beneath.]\nThe Solar System needs a super-Earth[Numerous asteroids have been drawn, half in black, with the other half in red added to the existing asteroids that were already there. A small line goes from the asteroids to the label beneath.]\nMore asteroids![Jupiter and Saturn have both been greyed out and also crossed out with two red X'es. Two arrows points from each of the original planets to a new larger red planet drawn above the two. This new planet has the belts, zones, Red Spot, and size of Jupiter, and the hexagon on the north pole and rings of Saturn. It also has the four largest moons from Jupiter on one side and the largest moon from Saturn on the other side, with all five drawn similarly to the original moons. Below the two original planets is a label.]\nMerge the big planet and the ringed planet into a big ringed planet (\"Jaturn\")[Uranus is greyed out and also crossed out with a red X. A line goes down to the label beneath it.]\nCut Uranus. Uranus and Neptune are redundant and Neptune is better. Tough but fair.[Pluto and Charon have both been greyed out and are inside a red circle. An arrow points from Pluto and Charon to the right side of Neptune, where Pluto and Charon have been redrawn in red. Neptune's own largest moon is on the other side of Neptune. A line goes from the arrow up to a label above the planet.]\nSettle the planet thing by making Pluto a moon of Neptune"
}