{
  "num": 2263,
  "url": "https://xkcd.com/2263",
  "title": "Cicadas",
  "img": "https://imgs.xkcd.com/comics/cicadas.png",
  "alt": "After a while you adjust to the new cicadian rhythm.",
  "year": "2020",
  "month": "2",
  "day": "3",
  "transcript": "[A special design has been used for this comic. One large broad panel is interrupted by two smaller normal sized panels lying on top of it, but slightly offset so they extend a bit above the long panels upper border. But at the bottom it is thus clear that there is indeed one large panel. The large panel have one drawing before the first and one drawing between the two panels on top of it. But these two drawings act like two separate panels between the others, and is thus not to be seen as something ongoing at the same time in the large panel.  The reason for doing it this way, is likely to show how interrupting the cicadas swarms are, in each of the two panels lying on top of the large panel. But for the story lines continuity, the comic could just have consisted of four normal independent panels instead. Here below the four individual drawings are transcribes as if they where four normally separate panels.][Cueball and Ponytail are facing each other across a desk. Cueball is holding up a tablet in his hand while Ponytail is typing at a laptop standing on the desk.]\nCueball: What can you tell from genome comparison?\nPonytail: I think there's a duplication on the -\nPonytail: Look out![The air is full of flying bugs, many of which have landed on Cueball, Ponytail, the laptop, the tablet and the desk. Ponytail and Cueball have their arms up in a futile attempt to shield themselves from the bugs, Cueball managed to put the tablet down on the table first.]\nBzzzzzzz[The bugs are gone and Ponytail and Cueball are again conversing. Cueball has taken the tablet slightly up above the table again.]\nPonytail: - a duplication on the gene right before the cleavage site, so the resulting protein -\nPonytail: Look out![The air is again full of flying bugs, many of which have landed on everything. Ponytail and Cueball are again trying to shield themselves, leaving tablet and laptop alone on the table.]\nBzzzzzzz[Caption below the large panel:]\nOur genetics work has produced 17-second cicadas, but we're having a hard time figuring out how."
}