{
  "num": 2287,
  "url": "https://xkcd.com/2287",
  "title": "Pathogen Resistance",
  "img": "https://imgs.xkcd.com/comics/pathogen_resistance.png",
  "alt": "We're not trapped in here with the coronavirus. The coronavirus is trapped in here with us.",
  "year": "2020",
  "month": "3",
  "day": "30",
  "transcript": "Bacteriophage: I'm worried about humans developing resistance to us.\nBacteriophage: Using pasta.Bacteriophage (narrating): The human immune system is a nightmare.\nBacteriophage (narrating): It's the worst.\nBacteriophage (narrating): It's the scariest thing in the universe.\nMacrophage: Who wants a HUUGGG\nAntibody-covered protozoon: Nooo!Bacteriophage: We can only survive by staying ahead of it.  Keep jumping from person to person, keep mutating and evolving.\nBacteriophage: But now humans are adapting too fast.Bacteriophage (narrating): We spread through their water. They built pipes.\nBacteriophage (narrating): We used mosquitoes. They put out nets and poison everywhere.\nBacteriophage (narrating): We spread through sex, and suddenly they all had these plastic things.Bacteriophage (narrating): This time, we really thought we had them.\nBacteriophage (narrating): One of us got good at transmission through everyday contact.Bacteriophage (narrating): It was great. We were tearing through lungs, spreading like wildfire.\nVoice offscreen: Hooray!\nVoice 2 offscreen: I hate lungs.Bacteriophage: Then, all of a sudden, humans everywhere just...stopped. They stopped working, stopped seeing friends.Voice offscreen: What are they doing?\nVoice 2 offscreen: Nothing!\nVoice 2 offscreen: They're just sitting there in their houses washing their hands.Bacteriophage (narrating): Suddenly humans became dead ends. We tried to jump from one to the next, but there's no one to jump to.\nCoronavirus: Help!\nBacteriophage (narrating): We can't escape.Bacteriophage (narrating): We're trapped in there with those ghastly immune systems.\nAntibodies: IT'S HUUG TIIIIIME\nMacrophage: Come here for a HUUUG\nMacrophage: HUUUUGSBacteriophage (narrating): Even if we win a fight, there's nowhere to go.\nMacrophage: HUUUUUUUGGSS\nMacrophage: HUUUUGS\nBacteriophage (narrating): By staying inside, humans have become resistant.Coccus bacteria: How could they evolve that fast? Humans take decades to reproduce!\nBacteriophage: It's not evolution. It's something with their brains.\nProtozoon: I wondered what those were for!Bacteriophage: Humans started looking at their phones, talking, writing words, and making signs. A human named \"Gloria Gaynor\" filmed herself singing at her bathroom sink.\nBacteriophage: And then they bought lots of pasta.\nBacteriophage: Then, around the world, they all went home and started washing their hands.Bacteriophage: They saw what we were doing and changed their behavior to stop us.\nProtozoon: Brains are the worst.Coccus bacteria: It's not over, right? They can't sustain this. They must be bored and tired.\nCoccus bacteria: Will they give up?\nBacteriophage: I don't know. They seem determined to protect each other.Bacteriophage: And\nBacteriophage: They have a lot of pasta."
}