{
  "num": 2305,
  "url": "https://xkcd.com/2305",
  "title": "Coronavirus Polling",
  "img": "https://imgs.xkcd.com/comics/coronavirus_polling.png",
  "alt": "If you want to see the polling questions we agree on MOST, you can check out Chapter 24 of my book How To, where I got the Roper Center on Public Opinion Research to help me design the world's least electable political campaign platform.",
  "year": "2020",
  "month": "5",
  "day": "11",
  "transcript": "[A panel only with text. At the top there is three paragraphs of explanatory text. Below that is a paragraph in smaller gray font with link to sources. Below that there are two columns of poll results, each with a heading. There are six polls in the left and seven polls in the right column. Instead of a bulleted list, each poll has its percent that agrees given to the left of the statement, which is thus aligned to the right of this percentage. At the end of each statement there is a reference in brackets in gray font.]\nIt's hard to get people to agree on anything in polls.\nBut we agree about the coronavirus.\nHere's how Americans feel about COVID-19, along with other topics that get similar levels of agreement for comparison.\nCompiled with help from HuffPost polling editor Ariel Edwards-Levy. Sources: xkcd.com/2305/sources[Left column:]\nRecent coronavirus polls\n86% say \"stay-at-home orders are responsible government policies that are saving lives\" rather than \"an over-reaction\" (ABC/Ipsos)\n85% oppose reopening schools (NPR/Marist)\n91% oppose resuming big sporting events (NPR/M.)\n85% trust local health officials and health care workers (Axios/Ipsos)\n93% are trying to maintain 6-foot distances while in public (Axios/Ipsos)\n81% say Americans should continue to social distance for as long as is needed to stop the Coronavirus even if it means continued damage to the economy (Politico/Morning Consult)[Right column:]\nOther polls\n81% enjoy apple pie (HuffPost/YouGov)\n76% feel positively about kittens (HuffPost/YouGov)\n84% have a favorable impression of Tom Hanks (Ipsos 2018)\n89% say fair elections are important to democracy (Pew)\n86% feel positively toward Betty White (Ipsos 2011)\n86% do not trust Kim Jong-Un to do the right thing (Pew 2019)\n64% are concerned about the emergence of \"murder hornets\" (YouGov)"
}