{
  "num": 2320,
  "url": "https://xkcd.com/2320",
  "title": "Millennium Problems",
  "img": "https://imgs.xkcd.com/comics/millennium_problems.png",
  "alt": "The hard part about opening a hole in the proof of the Poincaré conjecture is that Grigori Perelman will come out of retirement to try to fix it by drawing a loop around the hole and contracting it to a point.",
  "year": "2020",
  "month": "6",
  "day": "15",
  "transcript": "[Randall, drawn as Cueball, is holding a hand palm up towards a screen where a projector on the floor in front of him is projecting a diagram. The projector is propped up on some kind of legs to project up on to the screen. Behind the projector Ponytail is watching him, while Cueball is looking away from Randall, while yelling after someone off-panel.]\nRandall: ...Proving that one of these four is unsolvable, but not which.  If it's one of these, it would open a hole in Perlman's Poincaré conjecture proof.\nRandall: But it would also mean that solving either of the other two would re-prove Poincaré, and imply Hodge is isomorphic to...\nCueball: Security?![The slide on the projector screen shows a four-by-four matrix with 16 illegible entries, and also illegible text left and right of the matrix. The matrix is connected by four lines to four text segments written around the matrix. Two above (left and right), one to the right (at the bottom) and one below to the left. Arrows go between the right and left text at the top and both from the top left and the right text to the text at the bottom. The two to the right are connected by a line with an illegible equation written over this line, intersecting it. From the bottom text below the matrix an arrow goes down to another text beneath it. And from there an arrow goes up to the right text.]\nHodge\nRiemann\nNavier-Stokes\nBirch/SD\nPoincaré wrong??[Caption below panel:]\nI'm trying to make it so the Clay Mathematics Institute has to offer an eighth prize to whoever figures out who their other prizes should go to."
}