{
  "num": 2321,
  "url": "https://xkcd.com/2321",
  "title": "Low-Background Metal",
  "img": "https://imgs.xkcd.com/comics/low_background_metal.png",
  "alt": "The only effect on the history books were a few confusing accounts of something called 'Greek fire.'",
  "year": "2020",
  "month": "6",
  "day": "17",
  "transcript": "[Black Hat stands behind Megan who addresses Cueball who stands on the other side of a table with a machine. The machine is a rectangular box with a small dome with one large and two small antennas on top. It seems to point in Cueball's direction as it has a broad protrusion at the back and protrusion at the front that gets smaller towards the tip.  The word \"Time\" is written on the side, and below that is possibly more illegible text.]\nMegan: Our time machine works.\nMegan: But we're almost out of low-background metal.\nCueball: What's that?[Close-up on Megan who lifts her hand palm up.]\nMegan: Modern metal is contaminated by fallout from nuclear testing, and lead also has natural radioactivity that fades over time.\nMegan: To shield sensitive equipment, physicists use lead from sunken Roman ships.\nMegan: But shipwreck lead is hard to find.[Back to the original setting, Megan has turned to Black Hat, who has his hand on his chin.]\nBlack Hat: How much do we have?\nMegan: Enough for one trip through time.\nBlack Hat: Hmmm...[The three are now in a helicopter, with Megan piloting, Cueball as a passenger in the back, and Black Hat firing a flamethrower at a Roman ship beneath them through the window behind the cockpit. Two sailors with Roman type helmets are looking on as the stern of their ship catches fire. One of them throwing his arms out to the side. The intact sail is still up behind them and behind that another sailor jumps into the water, down to a fourth sailor already in the water. Two already-burning ships can also be seen to the left of the ship under attack. One is burning all over, with the mast still up but the sail long gone, and the third ship is almost completely sunk, but the part above the water is aflame. Seven small clouds are around the helicopter in the sky.] \nFlamethrower: Fwooosh"
}