{
  "num": 2325,
  "url": "https://xkcd.com/2325",
  "title": "Endorheic Basin",
  "img": "https://imgs.xkcd.com/comics/endorheic_basin.png",
  "alt": "My biggest fear is that colonial engineers will try to flood me to generate electricity. My biggest hope is that I'll develop sailing stones.",
  "year": "2020",
  "month": "6",
  "day": "26",
  "transcript": "[Megan, holding a glass of water up in one hand, is talking to Beret Guy, who has water surrounding his feet, with small droplets falling off the two small water triangles that cover his feet.  The water in her glass is leaning towards Beret Guy.]\nMegan: Why are your feet wet?\nBeret Guy: I'm an endorheic basin![Megan looks down at her glass as the water in it is flying out towards Beret Guy's arm, which he has stretched out towards the glass.]\nMegan: Huh?\nBeret Guy: Nearby water flows toward me, not the ocean. \nBeret Guy: See?\nMegan: Oh, cool.[At the top of this panel is a box with text being said by Beret Guy to Megan. Beneath it is a depiction of what he is explaining to Megan. Beret Guy is shown standing in a bathroom, with a towel around his waist. Almost his entire body is covered completely in water, except most of his head above mouth level, and both his feet are beneath the water bubble. He yells to someone outside the bathroom. A shower-tray or partially sunken bathtub can be seen to the left with a closed shower curtain across it. To the right of him is the sink with mirror above it. Further right is the door. The floor is tiled.]\nBeret Guy - narrating: The most annoying part is drying off after a shower.\nBeret Guy: Can someone bring me the siphon?[Back to the situation from the first panel, although Megan has lowered her glass a bit. The glass seems to be as full as in the first panel though, even though Beret Guy now also has water on his arm where it was pulled out off Megan's glass in panel 2.]\nBeret Guy: But I have to get rid of it or I'll develop salt flats. \nBeret Guy: Anyway, let me know if you need any minerals!"
}