{
  "num": 2336,
  "url": "https://xkcd.com/2336",
  "title": "Campfire Habitable Zone",
  "img": "https://imgs.xkcd.com/comics/campfire_habitable_zone.png",
  "alt": "Oh no, my marshmallow became tidally locked!",
  "year": "2020",
  "month": "7",
  "day": "22",
  "transcript": "[A campfire is in the middle of the panel in a white area with two areas shaded green to the left and right of the fire. There are also two white areas outside of these green areas. Ponytail is sitting normally on the ground to the left of the fire, with her body fully inside the left green area. She is facing the fire and is holding a stick in both hands. The stick has a marshmallow on the tip and she is holding it over the top of the flames of the fire. Cueball is sitting to the right near the fire, only half inside the green are. He is sitting sideways leaning away from the fire, holding one hand to his head, while his other hand seems to be ready to support him as he is leaning further away from the fire. The arm closest to the fire and his head seems to be very hot as three small smoke-like lines rises from Cueball. Megan is crouching to the right of Cueball, far from the fire outside the right green area. She is supporting herself on one knee and one foot. She is also holding a stick in both hands with a marshmallow on it. She is holding the stick inside the green area to the right of Cueball far from the fire. Four small lines above and below indicates that she is waving the stick up and down. The camp fire is built up of several logs on top of each other, with big flames above it, with smaller flames hanging loose in the air above the main flames. A small dead tree is to the far left and small rocks/stones lie along the ground all the way from left to right interspersed with grass tufts. Below the scene there is a label from which two curved arrows point to the two green areas.]\nLabel: Habitable zone[Caption below panel:]\nAstronomers define the Campfire Habitable Zone as the region where you're far enough not to be burned but close enough to roast marshmallows."
}