{
  "num": 2386,
  "url": "https://xkcd.com/2386",
  "title": "Ten Years",
  "img": "https://imgs.xkcd.com/comics/ten_years.png",
  "alt": "The ten-year cancerversary is traditionally the Cursed Artifact Granting Immortality anniversary.",
  "year": "2020",
  "month": "11",
  "day": "16",
  "transcript": "From 1141: Two Years\n[Randall (drawn as Cueball) and Randall's fiancée (drawn as Megan) sit on a bed, Randall's fiancée is talking on the phone. The person she is talking to, a doctor holding a clipboard, is shown inset.]\nRandall's fiancée: Oh god.[Randall and Randall's fiancée sit together while Randall's fiancée, now bald, is receiving chemotherapy. They are both on their laptops.]\nIV pump: ... Beeep ... Beeep ... Beeep ...[Randall and Randall's fiancée (who is wearing a knit cap) are paddling a kayak against a scenic mountain backdrop.][Randall and Randall's fiancée sit at a table, staring at a cell phone. There is a clock on the wall. Her head is stubbly.]\nRandall's fiancée: How long can it take to read a scan!?[Randall and Randall's fiancée are back at the hospital again, Randall's fiancée receiving chemo. They are playing Scrabble.]\nRandall: \"Zarg\" isn't a word.\nRandall's fiancée: But caaaancer.\nRandall: ...Ok, fine.[Randall and Randall's fiancée (wearing a knit cap) are listening to a Cueball-like friend. A large thought bubble is above their heads and it obscures the friends talk. The text below, split in three is the only part there can be no doubt about:]\nFriend: So next year you should come visit us up in the mounta\na\nand\nRandall and Randall's fiancée (thinking): \"Next year\"[Randall and Randall's fiancée are getting married, with a heart above their heads. Randall's wife's hair is growing back.][Randall and Randall's wife (wearing a knit cap) stand on a beach, watching a whale jump out of water.]\nFwooshFrom 1928: Seven Years[Randall and Randall's wife (with her hair noticeably longer) are walking through a forest.][Randall's wife is sitting down, not in the forest anymore.]\nRandall's wife: My toe hurts and I found a report of a case in which toe pain was an early sign of cancer spreading.\nRandall: Wait—didn’t you stub your toe yesterday?\nRandall's wife: Yes, but what if this is unrelated?[Randall and his wife are going spelunking. The guide is gesturing deeper into the cave while Randall and his wife are climbing down.][Randall's wife stands on a rock above an alligator in a swamp, photographing the alligator.  Randall is on a balcony behind safety railings.]\nRandall: When they estimated your survival odds, I think they made some optimistic assumptions about your hobbies.[Randall's wife sits on an examination bed, listening to a doctor holding a clipboard.]\nDoctor: This is probably nothing. \nDoctor: But given your history, we should do a full scan. \nDoctor: We'll call with the results in a few days.  Try not to worry about it until then![Randall and his wife stand above a deep pond full of fish and other objects.  Randall's wife is piloting a wired underwater camera with lights.][Randall and his wife are standing next to each other.  Randall's wife has shoulder-length hair covering most of her face.]\nRandall's wife: Hard to believe—six years ago, I was bald.  But today, after a long struggle, I finally look like the little girl from The Ring.\nRandall: That's, uhh... good?\nRandall's wife: Hissssss[A line of six people, including Randall and his wife, stand and watch the solar eclipse.][Randall and his wife are sitting in a room with five bunnies sitting around and on them. The Poster on the wall reads: Rabbit rescue.]\nRandall: Do you think they're socialized enough?\nRandall's wife: This one might need one more head pat. [Randall is running and pushing his wife on a hand cart.]\nSomeone off-panel: Has anyone seen the hand cart?\nRandall's wife: Wheee![Randall and his wife walks up hill with snowy mountains near by and in the background. his wife is gesturing to something ahead of them.][A large dark panel, to the right of the previous three, to the left in two rows. Randall and his wife sits, leaning back on their hands looking up, at the end of a pier going into a lake. The end is broader and they sit to each side of the middle of he pier. It is night and behind the lake there is a forest of pine trees. Above the three is a clear starlit night sky with hundreds of stars and the band of the Milky Way clearly visible. The trees and some of the stars are reflected in the water of the lake, distorted by the movements of the water.][Randall is sitting on a grassy field, a bit higher than his wife who lies on her back looking up.]\nRandall: You did it.\nRandall: Ten years.\nRandall's wife: It doesn't seem real.[Zoom in on Randall's wife, who is not longer lying down.]\nRandall's wife: When they showed me my 10-year survival chart, I really didn't believe I would make it here.\nRandall's wife: I don't understand why you married me when it looked so bad.\nRandall's wife: But it was very sweet.[In a frame-less panel Randall is standing in front of his wife, who is sitting on the ground, arm leaning on her bent knees.]\nRandall: You make it sound like an act of grace, and not something I desperately wanted to do and was worried I wouldn't get to.\nRandall: You're the coolest person I've ever met. I just wanted whatever time we could have.[Same setting but seen from a distance and in silhouette. Randall's wife has lifted her fist towards the sky, and it seems like Randall has turned away from her looking up.]\nRandall's wife: Well, good news, my hideous and inexplicable existence continues unabated! Take that, Biology!\nRandall's wife: You failed to kill me and now I can never die!\nRandall: Is... that how it works?\nRandall's wife: It was in the fine print on the chart."
}