{
  "num": 2386,
  "url": "https://xkcd.com/2386",
  "title": "Ten Years",
  "img": "https://imgs.xkcd.com/comics/ten_years.png",
  "alt": "The ten-year cancerversary is traditionally the Cursed Artifact Granting Immortality anniversary.",
  "year": "2020",
  "month": "11",
  "day": "16",
  "transcript": "[Randall and Randall's fiancée sit on a bed, Randall's fiancée is talking on the phone. The person she is talking to, a doctor holding a clipboard, is shown inset.]\nRandall's fiancée: Oh god.[Randall and Randall's fiancée sit together while Randall's fiancée, now bald, is receiving chemotherapy. They are both on their laptops.]\nIV pump: ... Beeep ... Beeep ... Beeep ...[Randall and Randall's fiancée (who is wearing a knit cap) are paddling a kayak against a scenic mountain backdrop.][Randall and Randall's fiancée sit at a table, staring at a cell phone. There is a clock on the wall. Her head is stubbly.]\nRandall's fiancée: How long can it take to read a scan!?[Randall and Randall's fiancée are back at the hospital again, Randall's fiancée receiving chemo. They are playing Scrabble.]\nRandall: \"Zarg\" isn't a word.\nRandall's fiancée: But caaaancer.\nRandall: ...Ok, fine.[Randall and Randall's fiancée (wearing a knit cap) are listening to a Cueball-like friend. A large thought bubble is above their heads and it obscures the friends talk. The text below, split in three is the only part there can be no doubt about:]\nFriend: So next year you should come visit us up in the mounta\na\nand\nRandall and Randall's fiancée (thinking): \"Next year\"[Randall and Randall's fiancée are getting married, with a heart above their heads. Randall's wife's hair is growing back.][Randall and Randall's wife (wearing a knit cap) stand on a beach, watching a whale jump out of water.]\nFwoosh[Randall and Randall's fiancée sit on a bed, Randall's fiancée is talking on the phone. The person she is talking to, a doctor holding a clipboard, is shown inset.]\nRandall's fiancée: Oh god.[Randall and Randall's fiancée sit together while Randall's fiancée, now bald, is receiving chemotherapy. They are both on their laptops.]\nIV pump: ... Beeep ... Beeep ... Beeep ...[Randall and Randall's fiancée (who is wearing a knit cap) are paddling a kayak against a scenic mountain backdrop.][Randall and Randall's fiancée sit at a table, staring at a cell phone. There is a clock on the wall. Her head is stubbly.]\nRandall's fiancée: How long can it take to read a scan!?[Randall and Randall's fiancée are back at the hospital again, Randall's fiancée receiving chemo. They are playing Scrabble.]\nRandall: \"Zarg\" isn't a word.\nRandall's fiancée: But caaaancer.\nRandall: ...Ok, fine.[Randall and Randall's fiancée (wearing a knit cap) are listening to a Cueball-like friend. A large thought bubble is above their heads and it obscures the friends talk. The text below, split in three is the only part there can be no doubt about:]\nFriend: So next year you should come visit us up in the mounta\na\nand\nRandall and Randall's fiancée (thinking): \"Next year\"[Randall and Randall's fiancée are getting married, with a heart above their heads. Randall's wife's hair is growing back.][Randall and Randall's wife (wearing a knit cap) stand on a beach, watching a whale jump out of water. This is the last gray panel, with an additional label in normal black color.]\nFwoosh\nLabel: Two years[Randall and Randall's wife (with her hair noticably longer) are walking through a forest.][Randall's wife is sitting down, not in the forest anymore.]\nRandall's wife: My toe hurts and I found a report of a case in which toe pain was an early sign of cancer spreading.\nRandall: Wait—didn’t you stub your toe yesterday?\nRandall's wife: Yes, but what if this is unrelated?[Randall and his wife are going spelunking. The guide is gesturing deeper into the cave while Randall and his wife are climbing down.][Randall's wife stands on a rock above an alligator in a swamp, photographing the alligator.  Randall is on a balcony behind safety railings.]\nRandall: When they estimated your survival odds, I think they made some optimistic assumptions about your hobbies.[Randall's wife sits on an examination bed, listening to a doctor holding a clipboard.]\nDoctor: This is probably nothing. \nDoctor: But given your history, we should do a full scan. \nDoctor: We'll call with the results in a few days.  Try not to worry about it until then![Randall and his wife stand above a deep pond full of fish and other objects.  Randall's wife is piloting a wired underwater camera with lights.][Randall and his wife are standing next to each other.  Randall's wife has shoulder-length hair covering most of her face.]\nRandall's wife: Hard to believe—six years ago, I was bald.  But today, after a long struggle, I finally look like the little girl from The Ring.\nRandall: That's, uhh... good?\nRandall's wife: Hissssss[A line of six people, including Randall and his wife, stand and watch the solar eclipse.]"
}