{
  "num": 2411,
  "url": "https://xkcd.com/2411",
  "title": "1/10,000th Scale World",
  "img": "https://imgs.xkcd.com/comics/1_10000th_scale_world.png",
  "alt": "OCEAN PLAY AREA RULES: No running, no horseplay, no megatsunamis, and no trying to pry the wreck of the Titanic off the bottom.",
  "year": "2021",
  "month": "1",
  "day": "13",
  "transcript": "[At the top of the image, inside the panel, a large title is floating in the air.]\nRULESFor visitors to my 1/10,000th scale world1 meter = 10 km   1 ft = 10,000 ft ~ 2 miles[Each of the following rules is written near a character or point of interest on the map.][Two small dots with thin lines coming out of them horizontally are in the air near Cueball, who is brushing them off.]\nWatch out for airliners cruising near shoulder level[Small mountains are seen near the left edge of the screen, by Cueball's feet.]\nTrip hazard: Appalachian Mountains[A young Hairy is climbing on mountains reaching approximately Cueball's waist.]\nDo not stand or climb on Mt. Everest[Under the water, a small bump in the ground expells bubbles.]\nCaution: Hydro-thermal vents underfoot[Science Girl stands shoulder-deep in the ocean, peering down into the trench below.]\nChildren must be supervised while in the ocean, especially near trenches[Megan's hand is extended, and lightning from the cloud is jumping to her hand.]\nDanger: positive lightning! Do not touch cloud tops[Ponytail sits near some mountains, with a dotted line in the air stretching across her forehead.]\nAvoid hypoxia by regularly sitting to bring your lungs below the death zone[A blob-shaped thing with wiggly grey texture lines drawn all over is underground.]\nDo not dig near Yellowstone[A second Cueball is jumping in the air, a hand reached back, in position to smack a weather balloon.]\nPlease do not smack weather balloons[Some very tiny vertical lines extend from the ground.]\nBe careful not to step on cities with especially pointy towers, like Toronto, Seattle, and Dubai"
}