{
  "num": 2412,
  "url": "https://xkcd.com/2412",
  "title": "1/100,000th Scale World",
  "img": "https://imgs.xkcd.com/comics/1_100000th_scale_world.png",
  "alt": "The floor should be slightly curved, but we haven't figured out artificial gravity yet, so for now we just added a trace intoxicating gas to the air that messes with your inner ear and gives you a sense that the ground is tilting away from you.",
  "year": "2021",
  "month": "1",
  "day": "15",
  "transcript": "[At the top of the image, inside the panel, a large title is floating in the air.]\nRULES\nFor visitors to my 1/100,000th scale world\n1 meter = 100 km, 1 ft=100,000ft≈20 miles[Each of the following rules is written near a character or point of interest on the map.][Dark-colored aurorae are floating in the air.]\nOur aurora are probably non-toxic but please stop trying to taste them[Ponytail is kneeling and breaking off part of an ice cap. In her other hand, she holds a wine glass.]\nNo breaking off pieces of the ice caps to put in your drink[At around ankle height, a mountain is shown.]\nDo not step on Mount Everest[A relatively small ocean is shown on the right of Mount Everest.]\nCaution! [A pictogram of a person slipping.] Ocean floor slippery when wet[A cell coverage icon with one cell bar.]\nWarning: Limited cell network coverage above the ionosphere. Crouch down to get more bars[Megan is facing the aurorae. Thin horizontal lines are at her knees.]\nWear sunscreen; the ozone layer only protects you below the knees.[Cueball is standing with three meteors whizzing both at and away from him.]\nBeware of chest-level meteors[A dotted line is at the Cueball from the last rule's chest.]\n-100°C mesopause vest recommended[A wine glass is resting on the ground near a shallow depression.]\nIf Lake Tahoe or the Dead Sea dries up, refill them with this 5oz wine glass[​Another Cueball is standing, holding both hands up to his face.]\nSafety glasses required for protection from reentering spacecraft\nCueball: OW!\n(off-panel voice): What?\nCueball: I got a Soyuz in my eye[A tornado-shaped lightning sprite is hovering over a cloud.]\nDo not anger the sprites[A dotted line weaves belowground.]\nPlease stop digging through the Moho. Staff are tired of cleaning up large igneous provinces.[An arrow pointing above the panel top.]\nISS (14 feet up)\nReturns every 90 minutes\nHit it with a Nerf dart, win a prize!"
}