{
  "num": 2421,
  "url": "https://xkcd.com/2421",
  "title": "Tower of Babel",
  "img": "https://imgs.xkcd.com/comics/tower_of_babel.png",
  "alt": "Soon, linguists will be wandering around everywhere, saying things like \"colorless green ideas sleep furiously\" and \"more people have been to Russia than I have,\" and speech will become unintelligible.",
  "year": "2021",
  "month": "2",
  "day": "5",
  "transcript": "[The Tower of Babel is shown. It has a broad two sectioned base and above that extends straight up out of the top of the frame, with 10 identical segments. This is seen from afar, so the three people standing at the base of the tower is very small. But Cueball and Megan can be easily identified. They are standing on either side of a woman with big curly hair (which is first clear in the next panel). The text spoken is written over the tower in white sections that hides the tower. But the tower can be seen above, between and below these two text segments:] \nCueball: The Tower of Babel is complete!\nMegan: Let's go meet God![Cueball, the curly haired woman and Megan are now standing at the top of the Tower of Babel. The top is made of bricks, but the part of the last segment before the top looks like those shown in the first panel. God is represented by an off-panel voice coming from a star burst at the top of the panel. The three people look up in that direction.]\nCueball: Hi God!\nGod (off-panel): Wow, nice tower!\nGod (off-panel): You did a great job! I'm so proud!\nMegan: Thanks![Same settings but Megan has turned towards the curly haired woman holding an arm out towards her. The woman has taken one hand to her chin.]\nGod (off-panel): I'm going to give you a reward.\nGod (off-panel): What do you like about the world?\nCurly haired woman: Hmm. Words are really cool.\nMegan:  No, wait-[Same settings, in a broader panel. The curly haired woman lifts her hands up curled into fists. Her yell comes from a starburst over her head, to indicate the difference to normal speech. Megan has taken her arm down.]\nGod (off-panel): Great! I'm going to give you lots of languages to study, each with its own phonology, word ordering, morphosyntactic alignment...\nCurly haired woman: YESSSSSS!\nMegan:  We should not have brought a linguist."
}