{
  "num": 2425,
  "url": "https://xkcd.com/2425",
  "title": "mRNA Vaccine",
  "img": "https://imgs.xkcd.com/comics/mrna_vaccine.png",
  "alt": "To ensure lasting immunity, doctors recommend destroying a second Death Star some time after the first.",
  "year": "2021",
  "month": "2",
  "day": "15",
  "transcript": "[Cueball seated in a doctor's office getting a dose of a COVID-19 vaccine. Both he and the doctor are wearing masks; the doctor is also wearing a scrub cap.]\nDoctor: The vaccine contains mRNA instructions for making the virus spike protein.\nCueball: Weird, so the vaccine is just blueprints?\nDoctor: Yup! Your body reads the mRNA, makes the proteins, and then has an immune reaction to them.\nCueball: Why would my body attack something it made itself?\nDoctor: Well...[Princess Leia and General Dodonna in frame.]\nLeia: Here are the Death Star plans.\nDodonna: Thank you, Princess.[Dodonna, Ponytail, and White Hat in frame.]\nDodonna: These blueprints are from Princess Leia.\nPonytail: Ugh, she's always giving us projects.[Ponytail and Cueball in frame.]\nPonytail: Here, take these blueprints to your construction crew.\nCueball: Affirmative. What is it?\nPonytail: No idea. Something the Princess wants.\nCueball: Copy that.Panel heading: Soon...\n[A view from outside of the Death Star.]\nVoice from Death Star: Hi, Commander? Construction crew B here.[A view from inside the Death Star, with a planet visible through two adjacent windows. Cueball is standing at some kind of control/communications panel.]\nCueball: We finished building the Princess's big metal orb thing.[A view from outside the Death Star again, with the curve of the planet in the foreground.]\nVoice from Death Star: Do you know if she wants us to park it somewhere, or—\nVoices from the planet: AAAAAA!!![A view from the planet's surface with the Death Star in the sky. 3 Cueballs, a Megan-like character, and Ponytail are on the planet's surface.]\nVoice from Death Star: ...Is everything ok?\nCueball 1: AAAAAAA!\nCueball 2: Imperial battle station!!!\nPonytail & Cueball 3: AAAAAAAAAA\nOffscreen voice: Red Alert Red Alert[Another view from the planet's surface. There is some type of military encampment surrounded by an open field, with trees and mountains in the background. People are running around on the field, which also contains several currently grounded craft and several flying craft streaming toward the Death Star.]\nDeath Star voice: Hello?\nGeneric field voices: Get the fighters in the air!\nRed Alert\nBlow it up! Blow it up!\nAAAAA\nGeneric tree voices: AAAAAaa\nGeneric spacecraft voices: Kill it kill it kill it kill it kill it kill it[A zoomed-in view of the outside of the Death Star, which is accumulating light damage. Numerous spacecraft are shooting at it; various explosions occur on the Death Star's surface and in space nearby.]\nDeath Star voice: Hello?\nGeneric spacecraft voices: Shoot it! Shoot it! Shoot it!\nThat armor's too strong! We're not getting through!\nKeep firing![A view from inside the Death Star again with Cueball at the control panel and the planet in the background windows; various projectiles and explosions can be seen through the window.]\nCueball: Can everybody please just chill? We don't even have the laser thing wired up. We—\nBOOM\nHey!! I said, we...[Ponytail enters from the left, and points to her left. Princess Leia points at her.]\nPonytail: We can't get through! We're running out of proton torpedoes!\nLeia: Send every crew to build more torpedoes!\nPonytail: There aren't enough ships to—\nLeia: Build more ships!![Ponytail is standing still and Princess Leia is walking to the right with her fists raised.]\nPonytail: That thing is just sitting there. Are you sure we—\nLeia: Keep building ships! Build ships forever! Destroy the orb![A view of the Death Star in space and the curvature of the planet off to the side. An enormous torrent of (barely visible) ships is seen streaming from the planet's surface to the Death Star. The damage to the Death Star is slightly worse.]\nGeneric ship voices: aaaaAAAAAAAAaaaaa\nDeath Star voice: What is wrong with you people?[Back in the real world, Cueball is standing with arms hunched and a cartoon helix above his head. Megan stands next to him.]\nCueball: Definitely feeling a little sore.\nMegan: Yeah, they said you might have some side effects.\nMegan: You lie down—I'll get you some hot tea and a blanket.[An outside view of the damaged Death Star with ships swarming it.]\nGeneric voices: Die die die die! Die![An inside view; Cueball appears injured, and the control panel is damaged with a fire on the ground nearby.]\nCueball: I hate you all so much.[The outside of the Death Star again.]\nShip 1: What's that?!\nShip 2: Looks like a thermal exhaust port.\nShip 3: I'm going in![The outside of the Death Star.]\npew pew pew pew pew pew[Beat panel.][The Death Star explodes.][A disheveled Dodonna, Princess Leia, and Ponytail in frame.][The same frame.]\nLeia: Good work.[In the real world, Cueball sits on top of a bed with a blanket draped over his lap. Megan stands next to the bed.]\nCueball: I'm feeling better today.\nMegan: That's great!Panel heading: A few months later...\n[Cueball and White Hat walking past each other. Cueball is wearing a face mask; White Hat isn't but coughs into his elbow.]\nWhite Hat: Cough cough[The real Death Star drifts toward the planet.]\nDeath Star voice: We have reached the rebel system, Lord Vader.[View from inside the real Death Star.]\nVader: Now they shall witness the firepower of this fully armed and oper—[Leia, Ponytail, and Cueball in frame.]\nLeia: Thermal exhaust port!!\nPonytail: Aaa\nCueball: Aaa[An equally large torrent of ships stream from the planet to the real Death Star.]\nDeath Star voice: What.\nVarious ships: aA AAAAAAA aaa aAAAAAAA aaa\nAAAAAA aaa aAAAAA[The Death Star explodes, leaving debris trailing away.][In the real world, White Hat and Cueball continue to walk past each other.]\nCueball: ♫ ♫"
}