{
  "num": 2426,
  "url": "https://xkcd.com/2426",
  "title": "Animal Songs",
  "img": "https://imgs.xkcd.com/comics/animal_songs.png",
  "alt": "Dr. Fauci is not permitted to have a cat, because as director of the National Institute of Allergy and Infectious Diseases, his petting one would be considered giving aid and comfort to an allergen.",
  "year": "2021",
  "month": "2",
  "day": "17",
  "transcript": "[A man with a bit of hair, later shown to represent Dr. Fauci, is putting on a white lab coat as he walks past his fish tank. The tank, on a small table, has one small fish in it, looking at him. Inside the tank there is also a seaweed-like plant and a small castle and an even smaller pyramid. Seven music notes, 4 double and 3 single notes, are scattered about Fauci's speech which is written with lower case letters (normal capitalization) as opposed to normal xkcd text with all small caps.]\nDr. Fauci: ♫ Putting on my doctor coat ♫[Dr. Fauci is buttoning the coat. He is now standing to the right of the fish tank. The fish has turned towards him and has moved to the end of the tank near him. He still sings with the same letter type and six music notes, 3 double and 3 single notes, are scattered around the text.]\nDr. Fauci: ♫ It's the coat I wear ♫[Dr. Fauci is back to the left of the fish tank, looking at himself in a mirror, and touching his face. There is a small shelf with three items on the wall beneath the mirror. The fish has swam back to its original position turned towards him. He is still singing, with one double and one triple note on either side of his lyrics. An off-panel voice addresses him from the right, and he replies. These exchanges are written in normal xkcd small caps style.]\nDr. Fauci: ♫ so they know how good a doctor I am ♫\nOff-panel voice: Dr. Fauci?  The press conference is in five.\nDr. Fauci: Be right there![Caption below the panel:]\nIt's nice to think about how serious and important people probably also absentmindedly sing made-up songs to pets."
}