{
  "num": 2434,
  "url": "https://xkcd.com/2434",
  "title": "Vaccine Guidance",
  "img": "https://imgs.xkcd.com/comics/vaccine_guidance.png",
  "alt": "I can't wait until I'm fully vaccinated and can safely send chat messages in all caps again.",
  "year": "2021",
  "month": "3",
  "day": "8",
  "transcript": "[Megan's face is seen at the bottom of the panel with the CDC-logo slightly above her and to the left; it is a black rectangle with the letters in white, and with a white jigly line to the left of the first C.]\nMegan: Our new guidance: Fully vaccinated people can gather privately with no masks or distancing, and can visit with unvaccinated low-risk people in one household.\nMegan: Any questions?\nLogo: CDC[Blondie, Hairy and Megan are seen at the bottom of the panel in three separate rectangular panels with Blondie and Hairy's panels at the left above one another. Those panels are almost square and also smaller than Megan's, more rectangular panel to the right of theirs. This panel is centered at the middle of those two panels to the left, and the logo is still visible. It is also shown that Megan is standing behind a lectern. Blondie, above Hairy, is the one asking questions to Megan.]\nBlondie: If my neighbors and I are all vaccinated, can I visit them unmasked and drink milk straight from the jug in their fridge?\nMegan: I...You can visit, yes.\nBlondie: And the jug thing?\nMegan: ...Next question?\nLogo: CDC[In a frame-less panel there are two panels at the bottom, with Science Girl in the largest to the left and Megan in the smaller to the right, with the logo still visible, but unreadable still the lectern is shown.]\nScience Girl: I'm fully vaccinated. Can I ride my bike in my sister-in-law's house?\nMegan: In her house?\n Science Girl: Like, down the stairs.\nMegan: I guess? You should at least wear a helmet.\n Science Girl: Even if she's not high-risk?\nMegan: Any other questions?[White Hat is in a rectangular box at the bottom of the panel. Megan is replying from off-panel to the right from a star burst at the edge of the panel. At the bottom there is a message in a black rectangle with white text.]\nWhite Hat: I'm two weeks past my second dose.\nWhite Hat: Can I get a horse?\nMegan: Thank you all for coming.\nWhite Hat: What if I wear a mask?\nWhite Hat: What if the horse does?\nMessage: Meeting ended by host."
}