{
  "num": 2459,
  "url": "https://xkcd.com/2459",
  "title": "March 2020",
  "img": "https://imgs.xkcd.com/comics/march_2020.png",
  "alt": "\"I've traveled here from the year 2020 to bring you this vaccine!\"",
  "year": "2021",
  "month": "5",
  "day": "5",
  "transcript": "[In a 3 column by 5 row grid of panels, 15 monthly wall calendars are shown. All calendars have a large header with month and year given on two lines. Below this is a black border with 7 white lines, for each day of the week, and below that 5 rows with 7 columns, making all calendars the same, with 35 spaces. Nothing is shown in these grids. Next to each of these calendars Cueball is shown. In the first 12 panels, Cueball is standing next to the calendar, in only slightly different poses. The text on the calendars only change in the top row, then it stays the same for the next nine panels:]\nCalendar: January 2020\nCalendar: February 2020\nCalendar: March 2020\nCalendar: March 2020\nCalendar: March 2020\nCalendar: March 2020\nCalendar: March 2020\nCalendar: March 2020\nCalendar: March 2020\nCalendar: March 2020\nCalendar: March 2020\nCalendar: March 2020[In the bottom row's first panel the calendar is, as always, to the left, but now Cueball is wearing a mask and sitting on a chair leaning a bit to the left while he is being vaccinated by a masked Ponytail to his right. She is inserting the needle into his left arm. To the right is a tall but small table with the vial from which she has drawn the vaccine standing next to the lid of the vial.]\nCalendar: March 2020[The bottom row's second panel is similar to the previous with Cueball wearing a mask and sitting on a chair leaning a bit to the left while he is being vaccinated - although this time by a masked Hairy, standing to his right. Hairy is also inserting the needle into his left arm. To the right is a different small table, with only one leg. On it is a vial from which Hairy has drawn the vaccine. Also some other black things are lying on the table, maybe other syringes for administrating the vaccine.]\nCalendar: March 2020[In the final panel Cueball again stands next to the calendar, but finally the text has changed.]\nCalendar: May 2021"
}