{
  "num": 2464,
  "url": "https://xkcd.com/2464",
  "title": "Muller's Ratchet",
  "img": "https://imgs.xkcd.com/comics/mullers_ratchet.png",
  "alt": "Who knew you could learn so much about sexual reproduction from looking at pictures on the internet!",
  "year": "2021",
  "month": "5",
  "day": "17",
  "transcript": "[A caption sits above a slightly greyed-out photo of Hairbun holding out a squirrel to Cueball, who has his hand over his face and is leaning away. Below are arrows leading to much smaller variations of the photo, all altered in some way.]\n[From left to right: Image with the sides cropped and black text bordered by white in the bottom center; image with black text in white box with black border above squirrel, on Hairbun, and on Cueball; image identical to the original but with softer edges; image cropped around all sides to exclude all negative space around frame, with white text bordered by black near the top and bottom center; image cropped to cut out half of Hairbun and Cueball's legs and featuring the squirrel holding a sword out at Cueball; image same as the original except with black text bordered by white on top of the squirrel, Hairbun, and Cueball; and image blurred out and at low resolution with black text in white oval on top of Hairbun and Cueball.]\nCaption: When a photo goes around on social media, people create lots of new versions of it.[A larger depiction of an image altered to cut out some of Hairbun and Cueball's legs and the squirrel holding a sword to the left of a caption, with a faint, shadowed wordmark saying \"Made with SwordApp]\nCaption: Sometimes, one of the edited versions becomes more popular and supplants the original. But often, the new version isn't made from the best copy of the image. It may be pixelated, cropped, or watermarked.\n[The same image appears with a grey box around it showing the cropped-out areas and an arrow pointing into it saying \"lost\". To the left is a caption.]\nCaption: As long as those flaws are minor enough that they don't cancel out the big change, the new version can still win out. Each good change brings with it random background damage. The degradation only goes one way. Once an image is cropped, its descendents will be, too. This steady loss of information is called Muller's Ratchet.\n[The original photo and the edited replacement are side-by-side, with the original on the right and the replacement on the left. The area above the squirrel where the sword is shown in the replacement is circled with a dotted line in both images. In the original, the area inside is greyed out, and in the replacement, the entire image is greyed out except for that area.]\n[Arrows point from the emphasized parts of both images to a new photo below that combines the original image with the sword from the replacement. A caption sits to the left.]\nCaption: But there's a solution. The old versions are still around, so if you have an image editor that lets you splice together parts of two images, you can make a new version with the best parts of both. This process is called recombination...]\n[All previous panels are grouped in one big box, with a caption below the entire frame]\nCaption: People use evolutionary metaphors to explain the spread of internet content, but at this point we have so much more experience with the internet that I feel like it often makes more sense the other way around."
}