{
  "num": 2571,
  "url": "https://xkcd.com/2571",
  "title": "Hydraulic Analogy",
  "img": "https://imgs.xkcd.com/comics/hydraulic_analogy.png",
  "alt": "Current (water) running through the water (wires) causes it to boil, increasing the pressure (voltage), but resisting (impeding) the flow of hydroelectricity (water currents). This is the basis for Ohm's law.",
  "year": "2022",
  "month": "1",
  "day": "21",
  "transcript": "[Miss Lenhart stands next to a white board with two diagrams while pointing to the first. While she is explaining Cueball interrupts her from off-panel as seen by his voice coming from the right side out of a starburst on the panels edge. The diagrams are a schematic circuit diagram and a water flow diagram. There is a battery (with labels on top and bottom) on the left and a resistor on the right of the circuit as well as labels on each of these and one at the top part of the wire. There is a pump to the left and a tighter section of the pipe to the right, as well as labels on these and on the top part of the pipe. At the bottom there is two arrow pointing in towards the pipe, this also has a label.]\nMiss Lenhart: Electric current is like water flowing in a pipe. The pressure represents-\nCueball [off-panel]: Wait, hold on.\nLabels on circuit: + - V I R\nLabels on flow diagram: Pump F R D[The view changes so Miss Lenhart and the white board are seen from the side. She still stands next to the white board, arms now down, as Cueball approaches the board with a marker held in one hand. The diagrams can still be seen, but distorted from being viewed from the side, and no labels are readable.]\nCueball: Do you mind if I just...[Zoom in on Cueball, who is drawing on the white board, which is the left edge of the panel, i.e. not visible in the panel. Noises from the marker drawing on the board comes up from the tip of the marker pen. The movement of the pen is indicated with small lines on either side.]\nScribble\nScribble\nScribble[Miss Lenhart and Cueball, holding the marker pen down, stand on either side of the white board looking at Cueball's version with the merged diagram. He has connected the two, so instead of the wire going down after the resistor in the circuit diagram, it now is connected with water flowing to the right just below the resistor, and then up into the pump to the right of the resistor. At the bottom where the water pipe before bend up into the pump, the water now continues running to the left (the pipe was not been drawn around it by Cueball), and it now flows where the bottom part of the wire, from the circuit, was before, turning up below the battery and connect with it there. All the labels from before has been retained:]\nLabels on diagram: + - V I R Pump F R D[Miss Lenhart and Cueball stand on a podium with a Cueball like presenter. The presenter is holding two Nobel Prize medals up in his hands. He is holding them from the strings they are attached to, so the medals hangs below his hands.]\nPresenter: And for the design and construction of the liquitricity device, the Nobel Prize goes to..."
}