{
  "num": 2572,
  "url": "https://xkcd.com/2572",
  "title": "Alien Observers",
  "img": "https://imgs.xkcd.com/comics/alien_observers.png",
  "alt": "ALERT: Human 910-25J-1Q38 has created a Youtube channel. Increase erratic jerkiness of flying by 30% until safely out of range.",
  "year": "2022",
  "month": "1",
  "day": "24",
  "transcript": "[Three aliens are looking at a screen. They each have six tentacles, of which four are used as legs, and the other two can be used as arms. They also have a small mouth and two eye stalks with a large eye at the end of each. The eyes has large eyelashes all the way around. One of the aliens is standing to the left of the screen, indicating it by raising one of its tentacles. The other two aliens stand to the right of the screen looking at the picture. The screen's image depicts a cross-sectional diagram showing two humans in a rough landscape. There is a shaded area above each of the humans and the terrain. The shaded area's boundary consists of arcs of differing sizes centered upon each human. To the left of the first human there is also a small straight area over the ground. To the left of this towards the edge of the screen, what appears to be an arc with a very large radius that begins and rises high up compared to the other two arcs, around a point beyond the on-screen image's edge. The rightmost human's zone has a dashed region between concentric radii of different sizes indicating that this zone has been revised further out than before. Four flying-saucer like spaceships are shown in the air close to, but above, the shaded areas. One high near the left curve, one over the flat area, one near the intersection between the two small arcs and one over the middle of the right arc.]\nLeft Alien: Human 38XT11-B-C54  just bought a new phone with a 10x zoom, so we have to expand our restricted flight zone by 1,800 meters to keep our ship blurry.\nRight Alien: Seriously? Didn't they just upgrade?\nLeft Alien: I know, I know...[Caption below the panel:]\nThe hardest part of being an alien observing Earth is keeping track of what cameras everyone has."
}