{
  "num": 2575,
  "url": "https://xkcd.com/2575",
  "title": "What If? 2",
  "img": "https://imgs.xkcd.com/comics/what_if_2.png",
  "alt": "CLARIFICATION: By 9/13, I mean September 13th, not the 9th day of Jancember, the cursed 13th month that exists between December and January in the transdimensional temporal plane.",
  "year": "2022",
  "month": "1",
  "day": "31",
  "transcript": "[Randall, drawn as Cueball, is throwing his arms out as he stands next to a big red book with white drawings on the cover. The cover shows a large passenger plane that has just taken off, as can be seen since the landing gear still has the wheels extended (only one wheel is visible at the middle part and then the one in the front). A Tyrannosaurus Rex has jumped on to the plane and it is biting down on the ceiling of the plane a bit in front of the wings, as if on the back of a prey. The dinosaur has already broken through the ceiling. Below is a jagged landscape with small mountain like peaks in the background. Megan and Cueball are standing on the top of the second of two raised plateaus, looking up at the plane and dinosaur. There is unreadable white text above the plane, then a title beneath the plane, and the authors name below the landscape, and more unreadable text beneath that, all in white. Below the book, there is a small arrow pointing to the right bottom of the book, with a label beneath.]\nRandall: Announcement:  I’m publishing a what if? sequel!\nBook cover: what if? 2 \nBook cover: Randall Munroe\nIn stores 9/13, available for preorder now: xkcd.com/whatif2[Randall is shown holding up his smart phone in one hand. The screen lights up as indicated with small lines at the top. These point up to at least six SMS texts, each with two lines of text. They are shown in speech bobbles with a small arrow in the bobbles lower left corner. All six are covered partly by either the other five, or by Randall’s head, and none of them can be read in any meaningful way; only parts of sentences or words are clearly visible. The bobbles and the text in them are all drawn in gray. Randall is narrating (not speaking) in this panel, both above the SMS texts, and below.]\nRandall narrating: Ever since I wrote what if?, I’ve been flooded with questions. \nRandall narrating: And not just from readers- My friends and family stated texting them to me, too.\nText 1: Hey could s.. ele\nText 2: Hypothe…\nText 3: If you s… Jupiter…\nText 4: Could my c… or…\nText 5: Do you… my car…\nText 6: If I trie… the sun, would I…\nRandall narrating: Honestly, I love it.[Randall is again standing next to his red book talking. There is also a second version of the book lying to the right of the closed book, and this has been opened up to reveal two pages. The text is unreadable and the images are very hard to see, but it seems that two people are standing next to each other on the right page. The image at the top of the left page has been enlarged and shown to the right of the open book. It is an image of the Earth that is being peeled by a potato peeler, which takes off a large peel from the north part of Scandinavia and then goes via Russia into Asia. The title and author name can still just be read on the book,but maybe only because they are already known...]\nRandall: The questions are so good. People have asked about touching exotic  materials, traveling across space and time, eating things they shouldn’t, and smashing large objects into the Earth. There are questions about lasers, explosions, swingsets, candy, and soup. Several planets are destroyed-one of them by the soup.\nBook cover: what if? 2 \nBook cover: Randall Munroe[Zoom in on the top part of Randall speaking on.]\nRandall: Like the first book, what if? 2 also features collections of short answers, new lists of weird and worrying questions, and some of my favorite answers from the What if site.[Only the closed red book are shown in this panel, in an even larger version than in any of the previous panels. But it is still only the title and the author name that can be read, but in this version these can also be read on the spine of the book. Randall is narrating again, and there are text both above and below the book.]\nRandall narrating: If you want to get it when it’s released, you can preorder a copy at xkcd.com/whatif2\nBook spine: what if? 2 Randall Munroe\nBook cover: what if? 2 \nBook cover: Randall Munroe\nRandall narrating: Available Sep 13, 2022"
}