{
  "num": 2588,
  "url": "https://xkcd.com/2588",
  "title": "Party Quadrants",
  "img": "https://imgs.xkcd.com/comics/party_quadrants.png",
  "alt": "Single-elimination might provide more drama, but I think we can all agree that a comprehensive numerical scoring system will let us better judge the party's winner.",
  "year": "2022",
  "month": "3",
  "day": "2",
  "transcript": "[A solid black lined square chart is divided into four quadrants with two light gray lines. Above the chart the left and right column are labeled, and above the labels there is a bracket with a label written on the bracket. Similarly there is labels to the left, of the top and bottom rows, with a bracket indicating those also with a label written on the bracket:]\nTop: Fun for me\nTop: No Yes\nLeft: Fun for guests\nLeft: No Yes[The top left quadrant is empty. The same goes for the bottom left quadrant, except labels for items in the bottom right quadrant is written in the bottom left quadrant. In the top right quadrant, there is a single black point which is almost touching the right edge of the chart, and lies about a quarter of the way down from the top towards the gray line. The point is labeled:]\nLabel: Sporcle geography tournament \nLabel: with snacks! \nLabel: Live-updating scoreboard, no distracting music[In the bottom left quadrant there is a Venn diagram. It consist of two skewed ellipsoids, one with a solid line overlapping the other with a dotted line. The solid lined region goes further to the left, and the dotted line region goes further to the top, but both are mainly in the bottom right region, and the bottom right section is completely overlapping. Both regions are indicated with an arrow that goes to them from a label. The solid lined regions label is written to the left and it is entirely inside the bottom left quadrant. The dotted lined regions label is written in both of the lower quadrants, thoug mainly above the Venn diagram in the bottom right quadrant.]\nSolid lined label: Appropriate zone for a party \nDotted lined label: Appropriate for my birthday party"
}