{
  "num": 2597,
  "url": "https://xkcd.com/2597",
  "title": "Salary Negotiation",
  "img": "https://imgs.xkcd.com/comics/salary_negotiation.png",
  "alt": "\"We can do 0.33 or 0.34, but our payroll software doesn't allow us to--\" \"NO DEAL.\"",
  "year": "2022",
  "month": "3",
  "day": "23",
  "transcript": "[Ponytail sits in an office chair at her desk, with Cueball sitting in a similar chair on the other side with his hands on his knees. Ponytails has her hands on the desk and in front of her, there is a slim thing standing up. It could be a very small screen, but there seems to be no keyboard in front of her. Maybe it is a small tablet with a support for letting is stand up. Behind that there are what appears to be two piles of papers of different sizes.]\nPonytail: We'd like to extend an offer! The starting salary is $55,000.\nCueball: Wow. I guess I'm inside a negotiation!\nPonytail: I... Weird to phrase it like that, but-\nCueball: I can do this.[Zoom in on Cueball's upper half.]\nCueball: I won't accept a penny over $50,000. Sorry, I mean under. Under $60. I mean, $600. Thousand. $600,000. I want a 15% cut of the salary. Raise. Double down. Fold. Pass. Fill it up with regular.[The same shot, except Cueball is now holding three pieces of paper, and he is looking down on them. Ponytail is talking to him from off-panel.]\nPonytail (off-panel): Are you-\nCueball: Sorry, sorry. Let me start over.\nCueball: OK, my chart says... \nCueball: ...Can I borrow a calculator? What's 20% of $55,000?[Back to the scene from the first panel. Ponytail has taken one hand down to her knee, with the other still on the desk. Cueball has put the papers on his lap and has raised his hand in the air holding one finger up. In his other hand he holds either a borrowed calculator or his own smartphone.]\nPonytail: Listen, if you need to-\nCueball: I won't take this job for less than $61,333 point 3 repeating!\nPonytail: Sure, $61,333 is fine. That's actually-\nCueball: Point 3 repeating or I walk!"
}