{
  "num": 2599,
  "url": "https://xkcd.com/2599",
  "title": "Spacecraft Debris Odds Ratio",
  "img": "https://imgs.xkcd.com/comics/spacecraft_debris_odds_ratio.png",
  "alt": "You say this daily walk will reduce my risk of death from cardiovascular disease by 30%, but also increase my risk of death by bear attack by 300%? That's a 280% increased! I'm not a sucker; I'm staying inside.",
  "year": "2022",
  "month": "3",
  "day": "28",
  "transcript": "[A chart is shown. Above the chart there is a heading, with a subheading below it:]\nOdds ratio for head injuries from falling spacecraft debris\n(Monte Carlo Simulation)[The chart is rectangular with the X-axis labels above the chart with numbers from 1 to 5. These are places over vertical lines. The first at 1 is black, the other four are light gray. There are three smaller light gray ticks between each set of lines, and one on either side of the first and last. The distance between lines gets smaller and smaller towards the right, probably logarithmic.]\nX-axis: 1 2 3 4 5[The Y-axis is not scaled; there are no ticks or lines. Instead it just gives five labels from top to bottom. Above those labels there is an arrow pointing to the top one with a label above explaning the axis.]\nHours spent outdoors\nY-axis: \n0 (ref)\n1\n2-4\n5-10\n11+[Aligned with each of these five divisions of the Y-axis there is a dot. The top one is placed on the solid line under 1 as a reference point. The other four dots all have long error bars, with the dots at the center of these. The second dot is a bit to the left of the solid line, with the error bar going almost to the left edge of the graph and halfway to the first light gray line to the right. The third dot is located halfway between the solid and the first light gray line with the error bar just crossing the solid line, and almost reaching the gray line. The fourth dot is about a third way between the first and second of the gray lines, with the error bar crossing both these lines. The fifth and last dot is just past the second gray line, with the error bar crossing both that, going more than half toward the first gray line, and also just past the third gray line. On the same height as the two bottom dots, there are asterisks just right of the edge of the graph.]\n*\n*[Below the panel there is a caption:]\nOur new study suggests that spending more than 5 hours outside significantly increases your risk of head injury from spacecraft debris, so try to limit outdoor activities to 4 hours or less."
}