{
  "num": 2601,
  "url": "https://xkcd.com/2601",
  "title": "Instructions",
  "img": "https://imgs.xkcd.com/comics/instructions.png",
  "alt": "Happy little turtles",
  "year": "2022",
  "month": "4",
  "day": "1",
  "transcript": "[The screen displays a radio button that when pressed plays a 9-hour long audio file of coding instructions. Behind it is an image of a turtle.  The use of a radio button to trigger the audio may invoke the idea that you could be listening to a radio broadcast.][The audio transcript:]And here we want to show you that you can program a picture right along with us. We’ll use a single color, some unorthodox functions, and each line we’ll put a bit of nature’s masterpieces right here on our canvas. Today we’ll have them run all the functions across the stream, right now, that you need to program along with us. Starting with a simple one:TO DIST :X0 :Y0 :X1 :Y1\nLOCAL MAKE \"RX DIFFERENCE :X1 :X0\nLOCAL MAKE \"RY DIFFERENCE :Y1 :Y0\nOUTPUT SQRT SUM PRODUCT :RX :RX PRODUCT :RY :RY\nEND[Audio transcript of commentary only, no code:]\nAnd here we want to show you that you can program a picture right along with us. We’ll use a single color, some unorthodox functions, and each line we’ll put a bit of nature’s masterpieces right here on our canvas. Today we’ll have them run all the functions across the stream, right now, that you need to program along with us. Starting with a simple one:There we go! Just like that.One more done. No pressure.Really makes our programming life easier.There we go! Just like that.I think there's a programmer hidden at the bottom of every single one of us.Let me show you what is going on up here.I've just covered the entire canvas with just a bit of white pinned down. We start with a vision in our hearts and we put it on canvas. Merriam Webster defines a turtle as a noun:\nAny of an order (Testudines synonym Chelonia) of terrestrial, freshwater, and marine reptiles that have a toothless horny beak and a shell of bony dermal plates usually covered with horny shields enclosing the trunk and into which the head, limbs, and tail usually may be withdrawn.Here are some interesting notes from \"Interesting facts about turtles. A little nature study by a scientist\", Forest and Stream, January 1916:\nOver a great many years I have taken a great interest in the land turtle. I have at the present time a number, some of which I have had for at least 17 years to most people. They were ugly and repulsive as the head when fully protruded and extended, looks like a snake. And furthermore their clumsy method of progression. Does not add anything attractive. One of the interesting points about turtles is their great variety of foods. They are, as a rule, good scavengers eating all kinds of decomposing and putrefying materials, beef or in fact any meat in Eden. I have seen them eat the flesh of birds and of moles, and while earthworms are relished by them, any worm or grub is taken. Worms from shell barks and ordinary maggots are gotten rid of in a hurry. Blackberries, may-apples, cherries and mulberries, tomatoes, cucumbers–and one vegetable eagerly eaten by my stock is green sugar corn, either raw or cooked in the spring when they first come out of the soil, and food is not plentiful in their pen. I have bought canned corn and they certainly have made it disappear very quickly, beetles and tumble bugs, potato bugs, either in larval or mature forms, are destroyed. Toad stools, especially the large flat pink ones, white and yellow ones are eaten, while I have seen them pass a black toadstool by several days unnoticed.Here we have a happy little \"pen down\" statement. That's it. And then…Occasionally when a female drops an egg on the ground, it is quickly eaten by the others. Ordinary hen's eggs are eaten and a great relish enjoyed hugely by them, as is thick sour milk. I have placed a quantity of this milk in two or three places in the pen and in five minutes it is surrounded by the turtles, just like flies on a lump of sugar. The scrapings of Limburger cheese have also been eaten.  A piece of butter which had been upon a platter in the icebox for months was placed before them and this was eaten in due time. Crab apples and cantaloupe are enjoyed by them, but watermelon is not so eagerly gobbled up like the cantaloupe. I was surprised one morning when I found one of the large turtles had caught and disembowelled the very large toad which I had in the yard. I have seen turtles eating at 11:00 at night when one would think they would be resting.Here you have the power to do anything you want.They prefer the shade and at certain times during the day if the sun is very hot, they retreat under the logs which I have for a shelter during rain, they are very active and move about with heads and necks outstretched, enjoying the shower bath hugely and evidently on the outlook for worms. Just as some birds after or during a shower, the youngest of turtles I have ever had seems to take to the same food as the adults. As a rule, they emerge in April, sometimes the middle of the month, but as early as April sixth they make their appearance. If the weather does not stay warm, they again go back to their retreats. Mating commences almost within a day or 2 after their emergence. The males are quite persistent in their lovemaking, biting at the female etc. And on two occasions I have seen the scale removed from the shell of the female and blood ooze from these surfaces.I made friends with a turtle yesterday, and he gave me his phone number. I asked, is that a landline? He said, no, it's my shell phone.It is interesting to see the males fight among themselves. They raise themselves as high as possible and lunge and bite and snap at each other In getting away from his opponent. The beaten one will beat a hasty retreat and retract his front feet or back feet as occasion demands and glide. Not run away. Running away is slow as compared to this turtle propulsion. It is not a slide, it is really a darting forward glide. Just recently I saw one male maltreating another in which the second fellow had all parts retracted and was being snapped at, pushed, and actually rolled over on his back by his opponent. Occasionally one can see a turtle dragging another one along the first one having the second fellows hind leg between his shell. This has probably been the result of a scuffle. I have never known a land turtle to bite, but have often seen them open their mouths wide and hiss or draw in their breath with a hissing or sighing sound. Some people have turtles in their cellars believing that they catch rats and mice. I tried keeping some of mine in the cellar for 2 seasons in the wintertime. They kept up a constant walk exactly like a caged beast. I gave them meat, vegetables and water, but on no occasion did they take the proffered food. In the spring, I found several of them dead. I believe that these turtles died because they were exhausted from wandering around and around during their time of hibernation. I also believe that this unnatural hibernation led them to refuse all food. Regarding the catching of rats and mice in cellars. I believe that rats and mice might be kept away by the noise made by the turtle making its endless march around the cellar. But I doubt whether a turtle could catch a rat or a mouse. In my yard, I had a galvanized iron pin three feet in length by 2 feet in width by 3 inches in depth for water. In this the turtles would enjoy themselves drinking from the edge with heads submerged or with the entire body submerged for sometimes as long as several hours. And even for a whole day, even in the country where I now have the herd, I have a small dish in which they can just get in and they certainly appreciate a bath.How about some interesting things in \"10 facts about marine turtles\" from the WWF UK?\nThere are seven species of marine turtle. Marine turtles were around more than 100 million years ago and lived alongside dinosaurs. These days, scientists recognize seven species of marine turtle, the hawksbill, the loggerhead, the leatherback, the Olive Ridley, the green, the flat back and the Kemps Ridley. Turtle shells are made of over 50 bones fused together. So they are literally wearing their bones on the outside. They also have light spongy bones that help them float. Their young lives are a mystery. The first few years of a marine turtles' life are known as the lost years. That's because the time between when the hatchlings emerge until they return to coastal shallow waters to forage is incredibly difficult to study the lost years they spend at sea, which can be up to 20 years largely remain a mystery to us. They can be ginormous. Marine turtle species vary greatly in size. The smallest Kemps Ridleys measure around 70 cm long and weigh up to 40 kg whilst the leatherback can reach up to 180 cm long and weigh 500 kg. That is over ten times heavier. Amazingly, whales hold the world record for the largest marine turtle ever found in 1988. A leatherback was found ashore measuring 2.5 m long, 2.5 m from flipper to flipper and weighing over 900 kg. It's survival of the fittest. It is estimated that only around one in 1000 marine turtle hatchlings make it to adulthood. This is down to the long time it takes for them to reach maturity and the many dangers faced by hatchlings and juveniles. From predators to marine plastics. They make some interesting noises. Female leatherbacks make some strange noises when they are nesting, some of which sound similar to a human belch. Just let it happen. They have color preferences, turtles seem to prefer red, orange and yellow food. They appear to investigate these colors more than others when looking for a meal. You know, I'm beginning to suspect it's turtles all the way down. They always return home. Females return to the same beach, they hatched on to lay their own eggs and bury them in sand nests. Marine turtles' amazing ability to navigate comes from their sensitivity to the earth's magnetic fields.Here are some more interesting bits from \"Interesting facts about turtles, a little nature study by a scientist\", Forest and Stream, January 1916.\nThe laying of eggs, this is one of the most instructive things that I have ever watched. Invariably they chose in my yard a situation with a southern exposure when desiring to lay. In only two instances was an eastern exposure observed, and once a western part of the yard being a cement walk, we could sometimes observe the female making motions as for digging the nest. Sometimes for a half a day she would remain stationary and with her back legs commenced to work for this purpose, lifting her to the grass plot. In a short time she would commence to dig first with the left hind foot. She would remove a little dirt and pile it up on her left side, then with the right hind foot and pile the removed dirt upon the right side. This would be repeated again and again probably for hours until the proper size hole and depth was obtained. Egg laying does not always occur during the daytime, as I have observed one or two digging away past midnight. Sometimes they will have dug for about an inch or so and then not make any more progress downward. In these instances they have met with obstructions like a small stone which they cannot remove. I have with a pair of forceps removed the obstruction on several occasions with the turtle still in it and after a minute or two she resumes her work.There is an artist in the bottom of everybody.The nest or repository is about 3 inches in depth and about an inch and a half or a little more in width. When she has it finished, she discharges her eggs into it. When the egg is deposited in the hole, she is not just satisfied in dropping it, but she reaches down with her hind leg and places the egg horizontally and covers a little dirt over it. Then the second egg and the remaining eggs are all treated similarly and when the last one is deposited and placed, she commences to fill up with the dirt that remains. She puts into the hole with an alternate right and left leg until all is filled in. She pats it with both her hind feet together and then with her body raised and lowered pets and smooths over the place where the eggs are buried. Then she leaves it and never looks after it as the sun now plays its part in hatching the eggs. The eggs are whitish in color with a semi-elastic shell about the size of a pigeon egg. The number laid by a turtle varies. I have seen three and on one occasion I have seen eight late at one sitting. I have also observed one turtle laying its eggs, covering them over, and a little later–a day or two–another female dug in the same place, removed the eggs and laid her own in this doubly-dug repository. Once, a female dug six hours and laid four eggs. Another dug several hours. The whole measured 2 inches across and three and a half inches in depth. And she laid eight eggs within a half hour. Not all eggs hatch out. But in the instance where eight were laid, I had the pleasure of seeing six little baby turtles come out. Other eggs which were laid in a hole dug with a western or eastern exposure never came to anything. I have dug carefully into these nests, but I have always come upon decomposing eggs. The most interesting egg laying I ever witnessed: The turtle commenced to dig at six p.m, and was still busy at work the next morning at eight o'clock. Five days later a second turtle dug these eggs out, deposited four of her own, and covered the nest up personally. I do not believe that the turtle digging out the previous batch of eggs was vindictive or mischievous but that the ground seemed soft and easily worked. Therefore it took advantage of the spot.Average person paints three turtles a year factoid. Actually just statistical error, the average person paints 0 turtles per year. Georg who lives in cave and eats over 10,000 each day is an outlier and should not have been counted.The young turtles, when they make their emergence at the end of three months, are dark in color and quite active. If you place one on its back at this time it will arch its head and neck and come around its normal position. The shell, of course, is quite soft, but in about three years the shell really becomes hardened though some clear portions of the shell around the edges are still soft. The color of the shell gradually changes to that usually seen in the head, and soft parts are modeled speckled or of a solid color. I have two in my collection where the head and neck are solid yellow.Do you know what a sea turtle's favorite sandwich is? Peanut butter and jellyfish. That sounds weird, but it's actually true. Just ask the next sea turtle you meet. But I think we shouldn't mention it to the jellyfish.Here are some interesting observations from \"Odd facts about turtles\", Christian observer, May 11th 1919.\nIt has been said that the turtle, like the whale, has no other enemy than man, and as much as both the little creature and the big pursued their various ways in practical immunity from harm and the fear of sudden death. In many ways, the turtle is one or the strangest of living things. Whales must come to the surface frequently to breathe, and it is pretty well known what they feed upon. The seal cannot remain beneath the sea nearly so long as the whale, and his food is very well known. But the turtle in all his varieties, in all his ways, is a most mysterious animal. It does not indeed seem to matter to him whether he stays beneath the surface for an hour or for a week. Nor does it trouble him to spend an equal time on land if the need arises. Your turtle is neither fish, flesh nor fowl. Yet his flesh partakes of the characteristics of all three. Eating seems a mere superfluidity with him since for weeks at a time he may be headed up in a barrel with a bung out and emerged after his long fast apparently none the worse for his enforced abstinence from food, from light, and almost from air. In the whole category of animal organisms, there is none so tenacious in life as the turtle. Injuries that would instantly be fatal even to fish leave the turtle apparently undisturbed and his power of staving off death is nothing short of marvelous. Just as soon as a baby turtle emerges from the egg off he scuttles down to the sea. He has no one to teach him, no one to guide him in his curious little brain. There has implanted a streak of caution based upon the fact that until a certain period in his life his armor is soft and no defense against hungry fish, and he at once seeks shelter in the tropical profusion of the gulf weed, which holds within its branching fronds an astonishing abundance of marine life here. The young turtle feeds unmolested while his armor undergoes the hardening process. Whatever the young sea turtle eats and wherever he eats it is not generally ascertained, one thing is certain it agrees with him immensely. He leads a pleasant sort of life basking in the tropical sun and cruising leisurely in the cool depths. Once he has attained the weight of 25 pounds which usually occurs within the first year, the turtle is free from all danger after that no fish or mammal, however ravenous, however well armed with teeth, interferes with the turtle. Once he has withdrawn his head from its position of outlook into the folds of his neck, between the 2 shells, intending devourers may struggle in vain to make an impression upon him.How about some neat facts courtesy of \"10 cool facts about turtles\" from Deutsche Welle?\nThey have been around for a really, really long time. There is a reason why turtles look a little prehistoric. The first ever specimens evolved around 260 million years ago in the late Triassic period. Shortly after their arrival, the earth experienced a mass extinction event that wiped out about 90% of all life on land. Luckily for the turtles, their burrowing and water dwelling habits set them up for long term survival in this strange new world. They have one of the longest lifespans in the animal kingdom. While a turtle's lifespan largely depends on the species, almost all of them have the potential to live to a ripe old age. A typical pet turtle can make it to anywhere between 10 and 80 years, while larger species often keep going for more than 100 years because it's so difficult to accurately measure age over a century. Researchers think some turtles could even be hundreds of years old. They come in all shapes and sizes. There are currently 356 known species of turtles. As a rule, they are all reptiles with a hard cartilage shell, but that is about where the similarities end. There are sea turtles, leatherback turtles, snapping turtles, pond turtles, soft shelled turtles, and of course tortoises.It is your creation. You can do anything you want to do.Not all turtles or tortoises but all tortoises or turtles. Yes, technically all tortoises are in fact turtles. They belong to the Testudines family, which includes reptiles whose bodies are protected by a bony outer shell. But the main difference between turtles and tortoises is that tortoises live exclusively on land while most turtles live in or near water. Some turtles are vegetarians while others are carnivorous. Most turtles are actually omnivores but a few species are more picky when it comes to their diet. Most tortoises are happy to munch on leafy greens or fruit. Not the fearsome looking alligator turtle, which is almost entirely carnivorous and feeds on anything from fish to small mammals that venture too close to the water's edge. All species lay their eggs on land when they are ready to lay their eggs. Even water dwelling turtles will dig their nests in the sand or the earth near their habitat, but they are not the nurturing type. No species of turtle sticks around to raise their young. When the babies hatch they are on their own. A turtle's gender is determined by temperature, like crocodiles and alligators. A turtle's gender is determined after fertilization. If the turtles' eggs incubate below 27.7 degrees Celsius, the hatchlings will be male. But if the eggs incubate above 31 degrees they will be female. If the temperature is somewhere in between or fluctuates, a mix of male and female babies will hatch as oceans. Warm turtles tend to give birth to more females. They have an amazing sense of direction. Sea turtles are known for their amazing ability to return to the exact beach where they were born years later. Like many animals, turtles can navigate their way at sea by sensing the individual lines of the magnetic field, but they can also remember the magnetic signature of coastlines and send tiny variations in magnetic fields allowing them to guide themselves home. Excellent vision, too–turtles have strong underwater eyesight. Researchers have discovered that they can see a range of different colors and even prefer some colors to others. Although sea turtles are famous for their internal gps there is evidence to suggest they do not see very well on land. Many species are endangered, having survived for millions of years. Six out of seven turtle species are classified as threatened or endangered as a result of human activity. Every year thousands become trapped in commercial trawl nets while in some parts of the world they are killed for their eggs, meat and shells.How about some interesting facts from turtle facts by Alina Bradford, writing for livescience.com?\nTurtles are reptiles with hard shells that protect them from predators. They are among the oldest and most primitive groups of reptiles, having evolved millions of years ago. Turtles live all over the world in almost every type of climate.And then....According to the integrated taxonomic information system, the turtle order Testudines (or Chelonia) splits into two suborders, Cryptodira and Pleurodira, and then further splits into 13 families, 75 genera and more than 300 species.They say everything looks better with odd values for things but sometimes I put even values just to upset the interpreter.\"Turtle\", \"tortoise\" and \"terrapin\" are often used interchangeably as synonyms, but there are distinct differences between the types of chelonians, according to the San Diego Zoo.\n Turtles spend most of their lives in water. They are adapted for aquatic life with webbed feet or flippers in a streamlined body. Sea turtles rarely leave the ocean except, to lay eggs in the sand. Freshwater turtles live in ponds and lakes, and they climb out of the water onto logs or rocks to bask in the warm sun.\n Tortoises are land animals. Their feet are round and stumpy, adapted for walking on land. They also dig burrows with their strong forelimbs, and slip underground when the sun gets too hot.\n Terrapins live on land and in water, usually in swamps, ponds, lakes and rivers.\nWith so many different types of turtle, There is no average size. The largest sea turtle species is the leatherback turtle. It weighs 600 to 1500 pounds and is about 4.5 to 5.25 feet long, according to the World Wildlife Federation. The Galapagos tortoise grows up to six feet long and 573 pounds, according to the San Diego Zoo. The largest freshwater turtle in North America is the alligator snapping turtle. It can grow to 2.5 feet long and weigh as much as 200 pounds. The Yangtze giant softshell turtle is the largest softshell turtle. It measures up to 3.6 ft across and weighs up to 309 pounds.\nA turtle's shell is a modified rib cage and part of its vertebral column, according to the animal diversity web at the University of Michigan. The top part of the shell is called the carapace, and the bottom is called the plastering, according to the San Diego Zoo. The shell is made up of about 60 bones that are covered by plates called scutes. Scutes are made of keratin, the same material that makes up human fingernails.Ralph Waldo Emerson once wrote that all the thoughts of a turtle are turtles and of a rabbit rabbits. So let's try to think like a turtle.Many turtles are able to retract their heads and feet into their shells. Turtles are placed in the two suborders based on the method of retraction, according to the animal diversity web at the University of Michigan. [...] —dires draw their heads straight back into the shell. Sea turtles have lost the ability to retract their heads.\nHabitat\nTurtles are very adaptive and can be found on every continent except Antarctica. Most turtle species are found in southeastern North America and South Asia. Only five species live in Europe, according to doctors Foster and Smith, a veterinarian business based in Wisconsin. [...]\nSea turtles can be found in the Coral Triangle, an area that includes the waters of Indonesia, Malaysia, the Philippines, Papua New Guinea, coastal East Africa, the Meso-American reef in the Caribbean, the Galapagos islands, and the gulf of California. Hey, what do you get if you cross a turtle with a giraffe? A turtleneck!The African helmeted turtle is the most common turtle in Africa, according to Animal Planet. It is a hunter scavenger that eats young birds and small mammals. It steals bait from fishermen's hooks. It also releases a foul smelling liquid from glands in its legs.Turtles are not social creatures. While they typically don't mind if there are other turtles around them, they don't interact or socialize, according to Encyclopedia Britannica. Most turtles are active during the day, spending their time foraging for food.\nTurtles are not silent creatures. Some sound like electric motors, some sound like belching humans and some bark like dogs. The red-footed tortoise From South America clucks like a chicken.Most turtles are omnivores. They eat a variety of different things depending on their species. Musk turtles eat molluscs, plants, small fish and insects. The cooter turtle is mostly vegetarian, and the green sea turtle only eats grasses and algae.I read in the L.A. Times this morning that 42,000 Mazda cars were recalled because of a spider problem. Really makes you think, doesn't it?The alligator snapping turtle lures in fish with its tongue which looks like a worm. It wiggles its tongue to attract a hungry fish and then snaps down on it with its strong jaw. It also eats aquatic plants, snakes, frogs, fish, worms, clams, crayfish and other turtles.All turtles lay eggs. They find a place on land to lay their eggs, dig a nest into the sand or dirt and then walk away. No species of turtle nurtures their young. \nTurtles reach the age to mate at different times. Some come of age as young as a few years old, while others don't reach sexual maturity until around 50 years has passed.\nSome species fight for the right to mate with a female, while others seduce her with a mating ritual to mate. Male and female turtles intertwine their tails so that their shell openings line up perfectly. \nSea turtles travel from the ocean to lay eggs on beaches. Usually, sea turtles lay around 110 eggs in a nest, though the flat back turtle only lays 50 at a time.\nThe temperature of the sand affects the sex of the turtle. The perfect beach temperature produces an equal number of male and female offspring. Due to rising temperatures, too many sea turtle females are being born, contributing to the decline in species numbers.According to the International Union for Conservation of Nature, many turtle species are listed as threatened, endangered or critically endangered. For example, the ploughshare tortoise and radiated tortoise are estimated to be extinct in the next 45 years.A pair of Russian tortoises went into space In 1968, the Soviet Union launched Zond 5, a space probe that was the first spacecraft to orbit the moon. It returned safely and the tortoises survived. They had lost about ten percent of their body weight, but they remained active and showed no loss of appetite, according to NASA.I even talked to turtles at times, but you need to understand LOGO to appreciate the great, great things that have been created. We spend so much of our life typing, looking, but never, ever seeing."
}