{
  "num": 2612,
  "url": "https://xkcd.com/2612",
  "title": "Lightsabers",
  "img": "https://imgs.xkcd.com/comics/lightsabers.png",
  "alt": "A lot of Jedi romances start with this turning into a Lady and the Tramp spaghetti situation.",
  "year": "2022",
  "month": "4",
  "day": "27",
  "transcript": "[Two Cueball like Jedi are engaging each other in a duel using lightsabers over 12 panels of equal size, with sound effects as the only sound. In the first panel the left Jedi has his lightsaber extended holding it in both hand pointing towards the other, who at this time is just turning his lightsaber on.]\nTssssss\nClick[Almost same position of the Jedi, but the right Jedi's lightsaber has now extended, making a sound. He is holding it up near his head in both hands] \nTsss[Then they run towards each other and swing their lightsabers towards each other, two small arcs indicating the swing of the lightsabers.][The two beams hit each other and connects at the middle in a big bloop of light, with drops of \"light\" jumping off both above and below the connected lightsabers. Both Jedi still holds on to their handles with both hands. A loud sound comes out of the connection:]\nBloop[The Jedi stands still holding their handles. The beam is now forming a bow between the two handles.][The left Jedi violently shakes his handle causing a wave to travel down the beam towards the right Jedi.]\nShake shake[As the left Jedi's end of the beam comes to rest the wave travels all the way the right Jedi's handle causing his hands to shake, although a bit less than the original shake.]\nShake shake[Back to the bow of light between them, but the beam is visibly still shaking, but no wave is traveling any longer.][Same setting but the shaking has stopped. The right Jedi turns his lightsaber off on his handle with a sound:]\nClick[The beam of light is retracted quickly into the handle of the Jedi turning his lightsaber off. So quickly that the two Jedi, still holding on to their handles are pulled up in the air and towards each other as the sound of the beam turning off is heard. Lines indicate their movement and shadows on the ground beneath them indicate they are in the air.]\nZhhhiiiip[When the beam is completely retracted the two handles collide and so do the heads of the two Jedi with a loud sound. They still hold on to their handles with both hands. They still hang in the air with shadows on the ground beneath them.]\nBonk[In the final panel the two Jedi lie unconscious on the ground with their heads towards each other and with their arms stretched out towards each other. The connected handles lie between them.]"
}