{
  "num": 2633,
  "url": "https://xkcd.com/2633",
  "title": "Astronomer Hotline",
  "img": "https://imgs.xkcd.com/comics/astronomer_hotline.png",
  "alt": "Employment statistics have to correct for the fact that the Weird Bug Hotline hires a bunch of extra temporary staff every 17 years.",
  "year": "2022",
  "month": "6",
  "day": "15",
  "transcript": "[Cueball, with a headset on, is sitting in an office chair at a desk in front of his computer screen, hands on the keyboard. He receives a call, and the callers voice is shown in a jagged frame above Cueball, between his two lines of text.]\nCueball: Hello, Emergency Astronomer Hotline. How would you describe the lights?\nCaller on phone: I don't know! Help!\nCueball: Stay calm. Is it day? If so, that's The Sun.[Cueball is now seen en face with the headset, but the computer etc. is not shown. The callers voice is now written normally but with zigzag lines going to the text from Cueball's headphone. Cueball's reply have a normal line going up to it.]\nCaller on phone: No, the sun set and then the light appeared!\nCueball: Hmm, could be stars. Are they stationary?\nCaller on phone: No, they're all zipping around bushes.[In a frame-less panel, the setting returns to the one from the first panel. Also with the callers voice in jagged frames again.]\nCueball: Aha! Fireflies!\nCaller on phone:  \"Fireflies\"?\nCueball: Lightning bugs. Tree blinkers. Ground stars.\nCueball: They're fine.\nCaller on phone: Phew![Same setting as first panel, but broader panel. After Cueball's reply and a short reply from the caller as in the first panel. There is a sound indicating transfer to another hotline. Then to the right there is a square panel with jagged edge, with the voice from the other hotlines employee.]\nCueball: We don't know much about them as they're too fast for our telescopes, but I can transfer you to the Weird Bug Hotline.\nCaller on phone: Sure, thanks.\nTransfer of call. *Click*\nWeird Bug Hotline on phone: Hi, Weird Bug Hotline. Is it currently biting you?"
}