{
  "num": 2639,
  "url": "https://xkcd.com/2639",
  "title": "Periodic Table Changes",
  "img": "https://imgs.xkcd.com/comics/periodic_table_changes.png",
  "alt": "It's nice how the end of the periodic table is flush with the edge these days, so I think we should agree no one should find any new elements after #118 unless they discover a whole row at once.",
  "year": "2022",
  "month": "6",
  "day": "29",
  "transcript": "Changes I would make to the periodic table\n[A modified periodic table is shown, with changes in red.][Helium is moved from the upper right corner to the second column next to hydrogen.]\nMove helium over here. It fits nicely!\n[Two elements labeled TBD are added to the left of boron and aluminium.]\nElements in this corner are cool. Add more!\n[A narrow triangular shape is wedged between fluorine and neon.]\nSp (Spite element)\n[Tx replaces five elements: scandium, titanium, vanadium, chromium and manganese.]\nMerge these boring metals with titanium to make *tixanium*\n[The symbols of sodium (Na), potassium (K), iron (Fe), silver (Ag), gold (Au), tin (Sn) and lead (Pb) are changed to use letters from their English names (So, Pm, I, Sv, Gd, Tn and Ld respectively).]\nUpdate Latin/Neo-Latin symbols to match names. This isn't ancient Rome.\n[The symbols of indium, antimony, tellurium, thallium and bismuth are changed to symbols containing the letter C followed by Roman numerals II to VI, respectively.]\nReplace the blander post-transition metals with new kinds of carbon\n[The symbol of tungsten is changed from W to Tg.]\nThat W annoys me\n[Neodymium, in the lanthanides/actinides block, is independantly highlighted, with an arrow and new outline suggesting it is to be moved directly below the Nickel column of the main table.]\nNeodymium can stay—magnets are cool\n[Arrows and outlines indicating that parts of the other lanthanide and actinide rows are also to be placed under the bottom of the main table, to make this a new and complete single row. Those not included, and not otherwise obscured by floating text, are scribbled over.]\nMove\nInserting the lanthanides and actinides properly makes the table too wide. Triage is needed. Each element will be offered free training to help adjust to its new column.\n[The symbols of terbium, erbium and ytterbium, all part of the prior move, are changed to Ty, Dh and Jk, respectively.]\n3.4% of all elements are named after Ytterby, Sweden (pop. 3,000). Let's keep yttrium, but rename the other 3 after bigger cities (tokyium, delhium, and jakartium?) to be more fair."
}