{
  "num": 2649,
  "url": "https://xkcd.com/2649",
  "title": "Physics Cost-Saving Tips",
  "img": "https://imgs.xkcd.com/comics/physics_cost_saving_tips.png",
  "alt": "I got banned from the county fair for handing out Helium-2 balloons. Apparently the instant massive plasma explosions violated some local ordinance or something.",
  "year": "2022",
  "month": "7",
  "day": "22",
  "transcript": "[The comic shows four rows each with a drawing and an explanation text belonging to each drawing. They alternate between having the drawing on the left and the right side. Above the first row is a large header:]\nPhysics Cost-Saving Tips[The first row has a drawing of a diagramatical spinning disc, at an angle. It is identified with an 'I', with a dotted axial arrow labelled 'L' and a rotational movement labelled 'ω' (small omega). \nI\nL\nω[To the right of the diagram is this text:]\nTry replacing regular vectors with pseudovectors whenever possible[The second row shows a square wave with three maxima between four minima. Below the central maxima and the two nearby minima are five arrows pointing down (two bending left two right one straight down). Each arrow points to one of five sine waves below the square wave, in three rows, with different wavelengths. The one with the shortest wavelength is the top left, then the wavelength becomes longer for the one to the right and even longer for each of the next two, in the next row with the final very long wave with longest wavelength at the bottom, with the straight down arrow pointing to that. The long waves at the bottom has the same frequency as the square wave.][To the left of the waves is this text:]\nA square wave can be broken down into an infinite supply of valuable sine waves[The third row shows two atomic models. The left containing two protons (white with a \"+\" sign), two neutrons (black) and orbited by two electrons (white with a \"-\" sign, small outlines, dotted orbits/movement lines). The right model is drawn similarly but without the black neutrons.]\n+ +\n- -\n+ +\n- -[The atoms have labels below and there is an extra message for the second model:]\n4He\n2He\n(Decays fast- use quickly)[To the right of the models is this text:]\nCut waste by buying lighter isotopes that don't have any dead-weight neutrons[The fourth row shows a flat rectangular bar, drawn in perspective with a scattering of four small circles with \"-\" sign inside them and ten lines looking like parts of circles, all on the top face towards the far end.]\n- - - - [A bending arrow goes from a label above the bar and points to one of the circles. And on the forward-facing side of the bar there is a label.]\nArrow: Free electrons\nLabel: Iron[To the left of the bar is this text:]\nConductors are a great source of free electrons\n(May carry charges)"
}