{
  "num": 2658,
  "url": "https://xkcd.com/2658",
  "title": "Coffee Cup Holes",
  "img": "https://imgs.xkcd.com/comics/coffee_cup_holes.png",
  "alt": "Theoretical physicist: At the Planck length, uncountably many.",
  "year": "2022",
  "month": "8",
  "day": "12",
  "transcript": "[The first panel has text only and is phrasing a question:]\nQ:\nHow many holes are there in a coffee cup?[Each of the next four panels has a caption at the top to indicate the kind of person answering the question. In the first of these Ponytail stands holding a coffee cup in its handle.]\nCaption: Topologist\nPonytail: One.[In the next panel Hairy stands to the right of Ponytail, holding the coffee cup in its handle at an angle so he can to look into it.]\nCaption: Normal person\nHairy: IDK, does the opening count as a hole?[In the next panel Hairbun is shown in closeup, holding her hand out palm up to indicate two drawings of coffee cups with handles to her left. The top drawing is larger and shows the cup with coffee inside, and a hole drilled at the bottom part of the side away from the handle. Coffee pours out of this hole. Beneath and further left is a smaller version of the same cup, but now without coffee. Instead two curved arrows goes from above to below through the hole of the handle and the hole now drilled in the bottom part of the cup. Each arrow is labeled with a question-mark.]\nCaption: Philosopher\nHairbun: To answer that question, consider another: If we drill a hole in the side, how many holes are there now?\n?\n?[Cueball, without any cup, stands with a drawing of a caffeine molecule above and to the right of him. It has two \"rings\" with 5 and 6 atoms. Those rings are connected along one side. There are 9 \"edges\" on this, three of those has one atom attached to it and 3 others have four atoms attached to them (one atom with three others attached). The two that are at the end of the edge that belongs to both rings have no atoms attached, and the final of the 9 also has no atom.]\nCaption: Chemist\nCueball: 1021 in the caffeine alone"
}