{
  "num": 266,
  "url": "https://xkcd.com/266",
  "title": "Choices: Part 3",
  "img": "https://imgs.xkcd.com/comics/choices_part_3.jpg",
  "alt": "Wait, this is space -- how are you talking to me? And, as an afterthought, what's up with the hole in reality?",
  "year": "2007",
  "month": "5",
  "day": "23",
  "transcript": "[A white Megan floats in a bubble against a dark blue space backdrop. She is at the top of the bubble. Her thoughts (not connected to her by a speak line) are shown above her in white.]\nMegan (thinking): I should feel scared.[She falls from the top of the bubble, the bubble rises, or both.]\nMegan (thinking): But I don't.[She hits the bottom of the bubble, and the bubble begins to fall down.]\nMegan (thinking): Maybe this is a dream.[She floats over the top of the now still bubble.]\nMegan (thinking): But it doesn't feel like one.[She now floats in the middle of the still bubble, in a larger panel. The sky behind her now has many stars and light effect. A voice speaks from off-panel above.]\nVoice (off panel): Okay, found you.\nMegan: Who are you?\nVoice (off panel): Er, hang on. \nVoice (off panel): This next part might be a little weird.[Beat panel, where Megan just floats in her bubble on the same background, but in a smaller panel.][A large panel where many distorted copies of Megan whirl around the original Megan in her bubble; she also bends backwards. The stars and light display in the background is more clear around her bubble, that now creates a lens effect, that even distorts the distorted Megans even more. Around her bubbles edge and the lens edge, there are three places where brown lines appear on both these edges.][All the copies have disappeared except for one who is hanging suspended outside Megan in her bubble. The new one is almost a mirror image, but not quite. The background is more dark blue, with fewer features.][The Megan copy raises her hand and speaks. There are again more stars in the background.]\nMegan copy: Sorry — hi, me.\nMegan: ...Hi."
}