{
  "num": 2663,
  "url": "https://xkcd.com/2663",
  "title": "Tetherball Configurations",
  "img": "https://imgs.xkcd.com/comics/tetherball_configurations.png",
  "alt": "Ground-pole-ball-pole can be fun if you shake the first pole to get the second one whipping around dangerously, but the ball at the joint gets torn apart pretty fast.",
  "year": "2022",
  "month": "8",
  "day": "24",
  "transcript": "[Four panels show four different configurations in which the elements of a tetherball game could be connected. Two persons are trying to play each of these configurations in each panel, in a side view of the ground and the people and their particular game upon it. Below, within each panel, a star rating with five stars (progressively filled or empty) is shown. Above, within each panel, a label states the combination of parts in use. Above all four panels, there is a heading:]\nTetherball configuration playability ratings[Megan holds on to the rope with both hands while looking at Cueball holding the ball in both hands, who is looking back at her. They are standing at equal distances on either side of where the rope is connected to the ground. The rope goes from the ground to the left up and through Megan's hands and then to the right over to the ball. The configuration has a one-star rating, with one filled and four empty stars.]\nGround–rope–ball[Ponytail is stretching as high as she can while waving one hand towards the ball that sits at the top of a pole much taller than she is. Hairbun is standing on the other side of the pole looking at Ponytail. The configuration gets a one-star rating, with one filled and four empty stars.]\nGround–pole–ball[Ponytail is looking at and holding on to the rope to the left of, but close to, where it is tethered to the ground. The rope then goes up to the top of a pole, but this pole is supported only by its attachment at the other end to the ball, which White Hat looks at as he holds it in both hands to angle it steeply up in Ponytail's direction. The configuration gets a two-star rating, with two filled and three empty stars.]\nGround–rope–pole–ball[Cueball is standing to the left of the pole, from where a rope goes down to the right to a ball that Megan balances on one hand while preparing to hit it with her other hand. She is looking at the ball and Cueball is looking at Megan. This standard configuration of tetherball gets a five-star rating, with five full stars.]\nGround–pole–rope–ball"
}