{
  "num": 267,
  "url": "https://xkcd.com/267",
  "title": "Choices: Part 4",
  "img": "https://imgs.xkcd.com/comics/choices_part_4.jpg",
  "alt": "Making out with yourself: now an official xkcd theme? Troubling.",
  "year": "2007",
  "month": "5",
  "day": "24",
  "transcript": "[Megan in a bubble is floating in outer space (on a dark blue background) next to her clone outside the bubble. Megan is simulating sitting down in the middle of the bubble. The clone reaches one arm out toward the bubble. There is no line from the first part of the clone's text to the rest of the text. It is given from the context who speaks. There are always more stars in the panels to the left than those to the left.]\nClone: I shouldn't do this, but I pulled you out for a moment to give you a hint.\nMegan: A hint?\nClone: Take wrong turns. Talk to strangers. Open unmarked doors. And if you see a group of people in a field, go find out what they're doing. Do things without always knowing how they'll turn out.[Megan leans towards the clone, the clone \"lies\" on her tummy with arms forward and legs lifted up.]\nMegan: Why tell me this?\nClone: You're curious and smart and bored, and all you see is the choice between working hard and slacking off. There are so many adventures that you miss because you're waiting to think of a plan. To find them, look for tiny interesting choices. And remember that you are always making up the future as you go.[Megan is \"sitting\" down with her hands on her knees. The clone stands and lifts an arm up.]\nMegan: So, wait, what is this place? Am I going to wake up thinking this was a dream?\nClone: This is... Think of this as after the game, outside the theatre. To go in, I had to suspend disbelief, forget the outside.[Megan again leans towards the clone; the clone spreads out her arms.]\nMegan: So you... Huh. Why give me hints I'm going to forget?\nClone: You'll forget this trip but I think the hints should stay with you.\nMegan: ...If this is a game, are you— are we— cheating?\nClone: Yup.[Megan still leans towards the clone. The clone leans a little back, her arms down.]\nMegan: Is that a good idea?\nClone: Well it's an interesting one.  We'll see how it goes.\nMegan: Well, I guess I'll see you aroun—[Megan leans towards the clone with a hand up, the clone leaning even more back, almost like she is falling backwards.]\nMegan: Wait a minute; have you brought me here before?\nClone: I ... Maybe. Once.\nMegan: For another hint?\nClone: Er. \nClone: Actually we just made out.\nMegan: We wh—\nClone: Bye!"
}