{
  "num": 2678,
  "url": "https://xkcd.com/2678",
  "title": "Wing Lift",
  "img": "https://imgs.xkcd.com/comics/wing_lift.png",
  "alt": "Once the air from the top passes below the plane of the wing and catches sight of the spooky skulls, it panics, which is the cause of turbulent vortices.",
  "year": "2022",
  "month": "9",
  "day": "28",
  "transcript": "[Caption at the top of the panel above the drawing:] \nHow a wing produces lift[The drawing is a diagram of the cross-section of a plane wing. It is large and rounded on the left end and flat on the bottom while the top curves down to meet it at a sharp point to the right. There are many small arrows indicating the flow of wind, in front of, above and below and behind the wing. Four sections of the wind have captions.][The arrows come from the left of the panel, point towards the wing, and then half begin to go over and half begin to go under. There is a caption in the middle of this flow:] \nAirflow splits around the top and bottom of the wing[The arrow flowing above continue to the back without caption. But the arrows going under the wing goes by a circle underneath the wing. The circle is connected to an arrow which points to the underside of the wing indicating that the content of the circle represents the underside of the wing. The circle shows a repeating pattern of small black (simplified) skulls, that not only fills the circle but can be seen on the arrow pointing to the underside of the wing. There is a caption to the right of this:] \nSpooky skulls microprinted on the bottom of the wing frighten the air, which flees away downward[The arrows going above the wing begins to curve downward at the end of the wing. In the middle of these arrows is a caption:] \nTop air goes to see what's wrong[After the spooky skulls the the arrows under the wings also begins to curve downwards and both streams of arrows from above and below have joined at the end of the wing and are all pointing to the bottom right of the panel. In front of them is a caption:] \nBy Newton's third law, downward deflection of air pushes wing upward"
}