{
  "num": 2684,
  "url": "https://xkcd.com/2684",
  "title": "Road Space Comparison",
  "img": "https://imgs.xkcd.com/comics/road_space_comparison.png",
  "alt": "I wonder how hard it would be to ride an electric scooter in a hamster ball.",
  "year": "2022",
  "month": "10",
  "day": "12",
  "transcript": "[Overhead views of ten segments of highway in two rows with a caption above. Each road segment has a caption and a different scenario.]\nRoad Space Comparison[50 people in the bottom left of the highway, all fitting into a single lane and taking up about a fourth of the length of the road.]\n50 people walking[50 bike riders in the bottom left of the highway, extending about halfway up the road and spilling over slightly into the second-to-leftmost lane]\n50 people riding bikes[A single bus, fitting into roughly the same space as the 50 people from the first scenario]\n50 people riding a bus[33 cars, taking up the entire length of all three lanes]\n50 people in 33 cars[One long string of connected bike riders, curving slightly and extending down the entire length of the middle lane]\n50 people on one tandem bicycle[40 cars in pairs, each pair with a single person straddling the windows between them. They take up the entire highway segment and each pair extends partway from the outer lanes into the middle]\n20 people driving 40 cars[Six buses on the lines between lanes taking up the majority of the highway, 30 cars arranged in stacks across the top]\n30 cars riding on 6 buses[39 evenly-spaced hamster balls with a person inside each, taking up the majority of the highway except a space at the top]\n50 people in human-sized hamster balls[An oversized car taking up all three lanes at the bottom of the highway, with a pair of ropes and a beam attached to the front bumper. The beam is attached to 40 miniature cars in front arranged into four lines]\nOne giant car pulled by 40 tiny ones[The road is bisected by a large river taking up about half of its original area, with a dock and rowboat attached to the lower shore. 50 people, 30 goats, 20 cabbages, and 10 wolves are in groups on the same side]\n50 people with 30 goats, 20 cabbages, and 10 wolves."
}