{
  "num": 2690,
  "url": "https://xkcd.com/2690",
  "title": "Cool S",
  "img": "https://imgs.xkcd.com/comics/cool_s.png",
  "alt": "Although I hear they were caught cheating off of Rosalind, who sat at a desk in front of them.",
  "year": "2022",
  "month": "10",
  "day": "26",
  "transcript": "[10 drawings evolving from simple dashes, to a \"cool S\" symbol, to a representation of DNA. Unless otherwise stated, each drawing adds to the previous drawing]\nFirst drawing -  three vertical lines side by side over three equally sized vertical lines\nSecond drawing - Two diagonal lines added from the bottom of the top left line to the top of the bottom middle line, and the bottom of the top middle line to the top of the bottom right line\nThird drawing - Four diagonal lines added from the top of the top left line and top right line, and the bottom of the bottom right line and bottom left line. The two lines at the top meet above the top middle line, at a 90 degree angle. The two lines at the bottom meet below the bottom middle line, at a 90 degree angle, making an incomplete \"Cool S\", missing two lines.\nFourth drawing - Two diagonal lines added. One from top of the bottom left line, pointing towards the bottom of the top middle line; it stops halfway where it intersects with the line between the top of the bottom middle line and the bottom of the top left line drawn in the second drawing. One from bottom of the top right line, pointing towards the top of the bottom middle line; it stops halfway where it intersects with the line between the bottom of the top middle line and the top of the bottom right line drawn in the second drawing. forming a complete \"Cool S\"\nFifth drawing - Resets the last few steps and is the same as the second drawing.\nSixth drawing (located under the first drawing, making a new line of drawings) -  The lines from the fifth drawing remain present and untouched, but there are now three vertical lines side by side above and below, with  a gap left between them and the previous lines.\nSeventh drawing - The pattern between the middle two sets of three lines established in the second drawing is repeated above and below, such that for each pair of three lines, Two diagonal lines are added from the bottom of the top left line to the top of the bottom middle line, and from the bottom of the top middle line to the top of the bottom right line\nEighth drawing -  The pattern between the middle two sets of three lines established in the fourth drawing is both reimplemented, and repeated in the upper and lower two sets of lines. One from top of the bottom left line, pointing towards the bottom of the top middle line; it stops halfway where it intersects with the line between the top of the bottom middle line and the bottom of the top left line drawn in the second drawing. One from bottom of the top right line, pointing towards the top of the bottom middle line; it stops halfway where it intersects with the line between the bottom of the top middle line and the top of the bottom right line drawn in the second drawing.\nNinth drawing - \nTenth drawing - [Caption below the panel]:\nThe structure of DNA was originally discovered by a group of especially cool middle school researchers."
}