{
  "num": 2698,
  "url": "https://xkcd.com/2698",
  "title": "Bad Date",
  "img": "https://imgs.xkcd.com/comics/bad_date.png",
  "alt": "\"Even split between us, this will pay way better than the Jumanji sponsorship I came into the date with.\"",
  "year": "2022",
  "month": "11",
  "day": "14",
  "transcript": "[Cueball and Megan are sitting at a table in a restaurant with their meals still on their plate and filled wine glasses. Megan hands her cellphone over the table to Cueball.]\nMegan: Psst — this date is going so badly that the people around us are posting it live.\nMegan: Look. [Zoom in just on Cueball in his chair. He is holding the cellphone while he sees a video. What the video shows is shown above him in a frame. The \"video\" window shows a scene from earlier in their date. And below the picture there is a title and below that an eye with the number of followers shown. In the scene they are sitting as in the first panel, but both have their arms raised. Cueball's arms towards Megan and she has her arms above her head. Small lines from above her head from where her speech line comes out indicates that she is agitated and speaks loudly.]\nMegan in video: Unbelievable– Have you even seen Jumanji?\nVideo caption: Date disaster 252k following\nCueball: Oh no.[Zoom in on Megan in her chair.]\nMegan: But it's okay: I got us a sponsorship.\nMegan: You just need to play along...[Scene expands to include the two nearest people at the two nearby tables. Both are typing frantically at their phones, (indicated with vibration lines on either side of their phones), using both hands, to document the date disaster live. Ponytail is to the left of them with food on her plate and a glass of water on her table and Hairy is to the right with a wine glass on his table. Cueball has raised one hand with a finger pointing up. Megan points a finger towards Cueball but is looking down at her phone held up in the other hand, to check their following.]\nCueball: I could never go home with someone with such bad taste in mattresses. I need the soft support of the ProFirm 3000.®\nMegan: Wait, I can order one! With same-day delivery, it can–\nCueball: You had your chance."
}