{
  "num": 2705,
  "url": "https://xkcd.com/2705",
  "title": "Spacetime Soccer",
  "img": "https://imgs.xkcd.com/comics/spacetime_soccer.png",
  "alt": "Spacetime Soccer, known outside the United States as '4D Football' is a now-defunct sport. Infamous for referee decisions hinging on inconsistent definitions of simultaneity, it is also known for the disappearance of many top players during... [more]",
  "year": "2022",
  "month": "11",
  "day": "30",
  "transcript": "[On a gray \"rubber sheet\" visualization of a gravity well is drawn some of the lines of a standard Association Football (Soccer) pitch. Visible features of the standard pitch are the outside borders, the goals and the small and large boxes around each goal. Absent are the corner quarter circles, the penalty spots and associated D, and the center line. The central circle is lost/concealed by the curvature of the gravity well. There are a number of other lines encircling and radial to the gravity well, they are visually identical to the familiar pitch markings so it is unclear whether these are intended to be drawn on the pitch or merely indications of the shape of the surface, or both, for the purpose of helping players to avoid the well. The lengthwise field boundary line on the visible far side partly follows/is partly followed by a suitable radial line before splitting off and conspicuously curving within the respective lip of the well to rejoin the radial line emerging at the complimentary angle in the opposing half of the field. A total of twenty figures can be seen on the pitch. Two are standing near the goal mouths, while the rest are distributed fairly evenly around the field, ten on each side of the middle. As they are all white stick figures on the gray surface, it is impossible to say which are on each team or if one is the referee. Five are within the inner circle around the well, and are distorted or tilted by the increased slope of the surface. A ball with motion lines is landing by the feet of one player who is running up one wing near, but left, of the central part of the field. This player is close to but not within the deeper part of the well. The players seems to be both women and men, as several look like Cueball and some like Hairy, and also many look like Megan and some like Ponytail. The color of the field becomes darker the deeper it goes into the well, from the normal gray color that extends from the two ends of the pitch to about halfway to the center of the field, in six steps until it is almost black at the deepest part of the well that is visible over the rim of the near part of the field.][Caption below the panel:] \nSpacetime Soccer got a lot of criticism for how many players fell into the gravity well, but what ultimately doomed it was the advanced mathematics required to figure out the offsides rule."
}