{
  "num": 2707,
  "url": "https://xkcd.com/2707",
  "title": "Astronomy Numbers",
  "img": "https://imgs.xkcd.com/comics/astronomy_numbers.png",
  "alt": "I adopted a cat that weighs 12 solar masses. Laser pointers love chasing it.",
  "year": "2022",
  "month": "12",
  "day": "5",
  "transcript": "[Ponytail is standing in front of a whiteboard writing on it with a pen, while Cueball looks over her shoulder from behind her. On the board is an almost circular ellipse with a cross that centers on a dot towards the left side of it. On the right side there is a small circle on the ellipse's line. There are several lines of wiggles representing unreadable text. To the left of the ellipse there are two lines near the top of and four near at the bottom of the ellipse. Ponytail is writing a fifth line below these almost under the ellipse. At the bottom to the left there is a rectangular frame with a line of text beneath it and at the bottom left corner there is a line forming a half closes rectangle around two dots.]\nPonytail: …And we need to correct for our elliptical orbit. On January 1st, Earth will be approaching the sun at a rate of ...let's see...\nPonytail: 65 miles per hour.\nPonytail: Weird. Okay.\nCueball: Weird?[Ponytail has turned towards Cueball, the pen is no longer in her hand and the white board is no longer shown.]\nPonytail: I get suspicious whenever I see a normal number in astronomy. We're not supposed to have those. Feels wrong.\nPonytail: Scales should all be incomprehensible.[Megan in a lab-coat raised her hand palm up towards an animal carrier cage standing on her desk. The cage has a handle and five air holes are at the top. Behind two of them something black inside the cage can be seen. Ponytail is standing on the other side of the desk looking at Megan. Above the top of the panels frame there is a panel with a label:]\nEarlier, at the vet:\nMegan: Your cat weighs 12 lbs.\nPonytail: Ridiculous, nothing weighs \"12\". You must mean 10-20? Or 1040?\nMegan: Fine. Your cat weighs 3x10-30 solar masses.\nPonytail: Okay. Better."
}