{
  "num": 2711,
  "url": "https://xkcd.com/2711",
  "title": "Optimal Bowling",
  "img": "https://imgs.xkcd.com/comics/optimal_bowling.png",
  "alt": "If you want to bowl a strike, the optimal place is almost certainly inside a bowling alley, although with a little luck any establishment uphill from one could also work.",
  "year": "2022",
  "month": "12",
  "day": "14",
  "transcript": "[The header is surrounded on either side by small drawings of two bowling pins and a bowling ball.]\nData for Optimal Bowling[Four line graphs are depicted. Each has a numbered one-word general description in a box at the top, an unlabeled y-axis, and a labeled x-axis. The relevant curve and other comments on each graph are in red.]1. Aim\n[The graph's x-axis is labeled from -180° to 180°.]\nRelease Direction\n[The red curve on the graph is just above the x-axis at all points except for a steep peak around 0°. The red curve is labeled:]\nRelative Probability of Strike2. Speed\n[The graph's x-axis is labeled from 10-1 to 108, with the last point on the x-axis labeled \"Speed of Light\".]\nBall Speed (m/s)\n[The red curve on the graph starts at the x-axis for 10-1, reaches its peak around 10, then declines and becomes a dashed line ending around three-quarters of the peak around 102. The remainder of the curve is replaced by two labels:]\nEquipment Damage [from approximately 102 to approximately 105]\nWidespread Destruction [from approximately 105 to the end of the axis]3. Spin\n[The graph's x-axis is labeled from 0 to 1012.]\nSpin (RPMs)\n[The red curve on the graph starts about halfway from its peak for 0, reaches its peak somewhere between 0 and 1,000, then declines and becomes a dashed line around 1,000, soon after which the remainder of the curve is replaced by two labels:]\nBall Explodes [from approximately 10,000 to approximately 107.5]\nWidespread Destruction [from approximately 107.5 to the end of the axis]4. Weight\n[The graph's x-axis is labeled from 100 to 1040.]\nBall Mass (kg)\n[The red curve on the graph starts just above the x-axis for 100, rises steeply and drops steeply ending just above the x-axis, then becoming a dashed line, all before reaching 1010. The remainder of the curve is replaced by two labels:]\nEquipment Damage [from approximately 109 to approximately 1022]\nBlack Hole Created  [from approximately 1025 to the end of the axis]"
}