{
  "num": 320,
  "url": "https://xkcd.com/320",
  "title": "28-Hour Day",
  "img": "https://imgs.xkcd.com/comics/28_hour_day.png",
  "alt": "Small print: this schedule will eventually drive one stark raving mad.",
  "year": "2007",
  "month": "9",
  "day": "24",
  "transcript": "[Above the panels of the main comic, there is a ruler-like time line diagram that shows the hours in a week. It has 6 black sections labeled \"bed\" in white text, at the top and 7 black sections labeled \"night\" in white text, at the bottom (the first and last sections are split in two as it goes from the end of the week to the start of the (next) week. So there are 8 night sections, but they only cover 7 times 12 hours). The night sections always go from 6PM to 6AM. But the bed sections are only 8 hours long and they only stay fully over the night sections two times, and two times they are not above the night sections at all. Above the ruler, the bed times are shown. These labels are over the relevant ticks on the ruler. The ruler has small ticks for every two hours, longer ticks at noon, and a line that goes all the way through the ruler dividing each day. The ruler begins on midnight as Sunday starts and ends as Saturday finishes at midnight. Below the ruler each day are labels with the three-letter abbreviations in a much larger font. Here below the rulers, text is transcribed with the day first, then night or bed according to which comes first, and the time interval for bed given after each bed. The first and last night will only be a partial word and only the first time will there be a (ni)ght to start.]\nSun\nght\nBed\n10AM 6PM\nNightMon\nBed\n2PM 10PM \nNightTue\nBed\n6PM 2AM \nNightWed\nNight\nBed\n10PM 6AMThu\nNightFri\nBed\n2AM 10AM \nNightSat\nBed\n6AM 2PM \nNig[Below the ruler are five panels. In the first, two Cueball-like guys are talking together. Cueball is addressing his friend with one hand raised.]\nCueball: You have trouble sleeping right?\nFriend: Only when your mom is over.[Cueball is now standing next to a an easel with a large version of the chart shown above the panels. Cueball is pointing to the chart while his friend is looking at it.]\nCueball: Since your work is flexible-\nFriend: -Like your mom-\nCueball: -you should try the 28-hour day - 20 awake, 8 asleep (or 19/9 if you prefer).\nFriend: I prefer your mom.[Cueball moves forward toward his friend, with the chart behind him. He holds both hands, held together, up in front of him. The easel with the chart can now be seen to have three legs, as opposed to only two shown in the previous panel.]\nCueball: It synchs up with the week - you spend weekdays awake normally, then on weekends you can go out all night.\nFriend: Just like your mom.[In a frameless panel, only Cueball is shown from the torso up. He gestures with both arms raised on each side of him.]\nCueball: It means four extra hours daily. You can stay up until you're exhausted every day and then spend a full 9 hours asleep each night![Back to both again, but without the chart. Cueball leans toward his friend as his friend lifts a hand to his chin.]\nFriend: But how much time can I spend doing your mom?\nCueball: You? I'm guessing three or four minutes, tops.\nFriend: ...Well played."
}