{
  "num": 342,
  "url": "https://xkcd.com/342",
  "title": "1337: Part 2",
  "img": "https://imgs.xkcd.com/comics/1337_part_2.png",
  "alt": "Trivia: Elaine is actually her middle name.",
  "year": "2007",
  "month": "11",
  "day": "13",
  "transcript": "[Cueball standing an looking down at his Cueball-like friend, who is sitting on the floor near an armchair holding a cloth to his face.]\nFriend: So the greatest hacker of our era is a cookie-baking mom?\nCueball: Second-greatest.\nFriend: Oh?[The next panel is only half height as Cueball's narration is written as a caption above the panel without a frame around it. In the panel to the left lies a young Elaine with a ponytail on the floor typing at a keyboard while looking at a screen connected to a computer behind it with lots of wires and open case. The computer appears to have been pieced together and there is a screwdriver lying next to her and an open box lies behind her. Little Bobby Tables (a kid version of Cueball) is painting with a broad brush at an easel to the left. There is a clear drawing with two parts going up and one down, but it's not easy to see what it should look like. He is holding his other hand up in the air, like he is enjoying the painting.]\nCueball (narrating): Mrs. Roberts had two children. Her son, Bobby, was never much for computers, but her daughter Elaine took to them like a ring in the bell.[The front of a car is in frame with side mirror and steering wheel visible. Mrs. Roberts is waving goodbye to her daughter who is wearing a backpack and is holding a walking stick. She is about to begin climbing a staircase built into a rocky mountain side. The first 11 step are visible. Behind the two and the stair are two distant mountain peaks, and above them two clouds. Cueball continues to narrate, this time inside the panel:]\nCueball (narrating): When Elaine turned 11, her mother sent her to train under Donald Knuth in his mountain hideaway.[Donald Knuth, drawn with hair only around his neck, is standing with a pointing stick at a chalk board with graph traversal patterns on it and two blocks of unreadable text the top may be a matrix. This small panel is also lower than the next panel, with Cueballs narration above:]\nCueball (narrating): For four years she studied algorithms.\nDonald Knuth: Child—[Donald Knuth whips around from the board slashing the stick like a sword. Elaine jumps, making a somersault (indicated with a line curving on it self from floor to sword) and lands on the stick balancing with her arms out.]\nDonald Knuth: Why is A* search wrong in this situation?\nStick: swish\nElaine: Memory usage!\nDonald Knuth: What would you use?\nElaine: Dijkstra's algorithm![Donald Knuth and Elaine are outside, seen from behind while they are both writing on a chalkboard with a thick line down the middle to separate their work. On both sides their writing can be seen but it is unreadable. Where there is only text visible on Donald Knuth's side there is also what appears to be a drawing or matrix at the top of Elaine's. But a similar thing could be behind Donald Knuth's head. Elaine is no longer wearing her hair in a ponytail but have long straight white hair like her mom Mrs. Roberts. To the left there is a stump from a tree, some grass and maybe a puddle of water. Further back there is a small jagged hill and a flat horizon. To the right there are four mountain peaks and a flat high plateau towards the horizon. The frame of the panel does not include the top and bottom corner, but cuts a rectangular section of both places. In these two sections outside the panel is the last two paragraphs of Cueball's narrating:]\nCueball (narrating): Until one day she bested her master\nDonald Knuth: So our lower bound here is O(n log n)\nElaine: Nope. Got it in O(n log (log n))\nCueball (narrating): And left."
}