{
  "num": 344,
  "url": "https://xkcd.com/344",
  "title": "1337: Part 4",
  "img": "https://imgs.xkcd.com/comics/1337_part_4.png",
  "alt": "Mrs. Roberts would have gotten up sooner, of course, but she was busy piping find ~ and find ~nomad into xargs shred, just in case.",
  "year": "2007",
  "month": "11",
  "day": "14",
  "transcript": "[Elaine is sitting under tree on a grassy meadow typing on her laptop. Two trees are in the background where rolling hills goes to the horizon with a single cloud over the trees. Above the frame is text narrated by the Cueball from the first panel in the 2nd comic in the series:]\nCueball (narrating): As time passed, Elaine intensified her hacking work, anonymously publishing exploit after exploit.[Elaine, wearing a backpack, is walking up to a door where her mom Mrs. Roberts is greeting her in the open door at the top of two steps. Above this very low panel's frame, there is more of Cueball's narration:]\nCueball (narrating): To crack open proprietary hardware, she teamed up with one of the top experts in signal processing and data transferring protocols.\nElaine: Hi, mom.\nMrs. Roberts: Hello, dear. Did you have fun?[Elaine is lying on the floor with her laptop in front of her facing left with a charger on the floor further left. Mrs. Roberts is sitting to the right facing right on a chair working on her computer at a table. Cueball is still narrating above the frame:]\nCueball (narrating): They were an unstoppable team.\nElaine: I finished the CSS decryptor.\nMrs. Roberts: Good, dear. I'll send it along to Jon.[Pan to the right where two men in black bowler hats arrive. Both hold briefcases - the first guy's reads RIAA, and the other guy's reads MPAA. Cueball's last narration in the comic is above the frame:]\nCueball (narrating): And were eventually noticed.\nRIAA man: Game's over.\nMPAA man: You're coming with us.\nBriefcase 1: RIAA\nBriefcase 2: MPAA[Pan back left to the women. Mrs. Roberts stays in her chair sitting at her computer still typing, the screen emitting light, but Elaine has moved around to the right of the table and pulls out her folding knife and swings it open.]\nElaine: Oh, are we?\nMrs. Roberts: Now now, Elaine-\nKnife: Shink[Pan back right to the two men who simultaneously pull katana swords out of each of their briefcase, while still holding onto the handle with the other hand. When when opened like this, it causes two pieces of paper to fly out of the RIAA man's briefcase and a notebook to fly out of the MPAA man's briefcase.]\nKatanas: Shing[Pan back to the women. Mrs. Roberts continues to type on the laptop, a line going up from the keyboard indicating activity. Elaine still holds her open folding knife out, so the tip now touches the right frame of the panel.]\nMrs. Roberts: Don't let them provoke you, dear.\nMan (off-panel): We don't want to hurt you, Ma'am.\nMrs. Roberts: Don't by silly. Record company employees can't just go into houses and slice people up.[Pan back right to the two men who hold up the katana swords having left their briefcases closed on the floor. The closest RIAA man is holding a hand up, the other MPAA man is holding his sword in two hands and pointing it threateningly forward.]\nRIAA Man: Ah, so you haven't read the DMCA.\nMPAA Man: Title IV, Section 408: Authorization of Deadly Force.[A wide panel showing the whole scene with even Mrs. Robert now standing having just pushed her chair back, the computer inert. Elaine is bending in the knees, knife at the ready. Both bowler hat men, still holding their swords as before, but no hands up, have turned to look right back over their shoulder to see who speaks, as a voice comes from off-panel right.]\nRichard Stallman (off-panel): Hark![The scene pans further right, so the two women are no longer in the panel, but Richard Stallman can now be seen with his wild beard and long hair and holding two katana swords, one in front of him and one over his head also pointing towards the two bowler hat med. They are standing normally, looking back at Stallman. The MPAA man nearest him holds a hand to his mouth as he speaks.]\nRichard Stallman: Cease this affront to freedom \nRichard Stallman: Or stand and defend yourselves!\nMPAA Man: Stallman!"
}