{
  "num": 378,
  "url": "https://xkcd.com/378",
  "title": "Real Programmers",
  "img": "https://imgs.xkcd.com/comics/real_programmers.png",
  "alt": "Real programmers set the universal constants at the start such that the universe evolves to contain the disk with the data they want.",
  "year": "2008",
  "month": "2",
  "day": "1",
  "transcript": "[A Cueball like man sits at a computer, programming. Cueball stands behind him and looks over his shoulder.]\nCueball: nano? Real Programmers use emacs.[Megan appears behind him.]\nMegan: Hey. Real Programmers use vim.[A second Cueball like man appears behind her.]\nEd Cueball: Well, Real Programmers use ed.[A third Cueball like man appears behind him.]\nCat Cueball: No, Real Programmers use cat.[Hairbun appears behind him.]\nHairbun: Real Programmers use a magnetized needle and a steady hand.[A fourth Cueball like man enters, facing them all. We see him facing the last two Cueball like men and Hairbun.]\nButterfly Cueball: Excuse me, but Real Programmers use butterflies.[A Cueball like programmer is standing and holding out a butterfly in front of his computer. The butterfly flaps its wings.]\nButterfly Cueball (narrating off-screen): They open their hands and let the delicate wings flap once.[The next two panels are smaller and the two texts below are written uninterrupted respectively above and below both panels. The first panel is the Cueball like programmer with the butterfly, and above him four curved arrows pointing up or down. The second panel shows the upper atmosphere, with large clouds far below and the earth even further down. Also here are shown seven of the same type of arrows.]\nButterfly Cueball (narrating off-screen): The disturbances ripple outward, changing the flow of the eddy currents in the upper atmosphere.\nButterfly Cueball (narrating off-screen):  These cause momentary pockets of higher-pressure air to form,[Also the next two panels are smaller and the texts below are written uninterrupted above both panels. The first panel shows the atmosphere, again with clouds, and four parallel lines coming from above, and then they begin to merge, getting quite close at the bottom of the panel. The second panel shows the four lines merging on a driver platter.]\nButterfly Cueball (narrating off-screen):  Which act as lenses that deflect incoming cosmic rays, focusing them to strike the drive platter and flip the desired bit.[All the programmers who has commented so far stands in the order they have commented facing the last Cueball like man who slaps his forehead.]\nCueball: Nice. 'Course, there's an emacs command to do that.\nCat Cueball: Oh yeah! Good ol' C-x M-c M-butterfly...\nButterfly Cueball: Dammit, Emacs."
}