{
  "num": 442,
  "url": "https://xkcd.com/442",
  "title": "xkcd Loves the Discovery Channel",
  "img": "https://imgs.xkcd.com/comics/xkcd_loves_the_discovery_channel.png",
  "alt": "I love the title-text!",
  "year": "2008",
  "month": "6",
  "day": "27",
  "transcript": "[The comic is in parody of the Discovery Channel commercial showing various clips of people singing a song with the chorus line \"Boom De Yada.\"]\n[The comic is divided into a grid of 4 by 6 panels, each depicting a character or situation often from a previous xkcd strip.]\n[In each panel is written a part of a song similar to the song from the Discovery Channel commercial.]Panel 1:\n[Megan spinning around.]\nI love momentum.Panel 2:\n[Megan laying on floor tinkering with EEE PC hamster ball robot.]\nI love to engineer.Panel 3:\n[Beret Guy standing in bakery holding a loaf of bread in each hand, sign with \"PIE!\" in background.]\nI love this bakery!Panel 4:\n[Cory Doctorow in goggles and red cape flying superman-style.]\nI love the blogosphere!Panel 5:\n[Cueball running in large hamster ball.]\nI love the whole worldPanel 6:\n[Depiction of internet sludge (4chan b-Random)]\nAnd all its messed-up folks.Panel 7:\n[Cueball and Megan immersed in playpen balls.]\nBoom De Yada\nBoom De YadaPanel 8:\n[Mass of playpen balls with speech \"I put on my robe and wizard hat\" originating from it.]\nBoom De Yada\nBoom De YadaPanel 9:\n[Black Hat giving a moving and shaking gift to a kid with party hat.]\nI love your suffering.Panel 10:\n[Diagram showing RSA fingerprint authentication between two people.]\nI love cryptography.Panel 11:\n[Cueball and Megan in bed covered by red sheet.]\nI love entangled sheets.Panel 12:\n[Cueball hanging from kite string holding camera.]\nAnd kite photography.Panel 13:\n[Map of the internet.]\nI love the whole worldPanel 14:\n[Cube with red spider on top.]\nAnd all its mysteries.Panel 15:\n[Two people sword-fighting on rolling office chairs.]\nBoom De Yada\nBoom De YadaPanel 16:\n[Classroom with two students and Mrs. Lenhart.]\nBoom De Yada\nBoom De YadaPanel 17:\n[Cueball saying \"Barack me Obamadeus!\" to another man speaking energetically at a podium.]\nI love elections.Panel 18:\n[Cueball holding schematic diagram of a transistor in front of his crotch.]\nI love transistors.Panel 19:\n[Cueball and Megan in bed, Cueball saying \"There must be taft slash fiction.\"]\nI love weird pillow talk.Panel 20:\n[Cueball speaking to Megan.]\nI love your sister.Panel 21:\n[Roller coaster with Cueball in front car holding chess board and thinking about a move.]\nI love the whole world.Panel 22:\n[Beret Guy standing in the midst of leafless trees.]\nThe future's pretty cool!Panel 23:\n[Megan doing the MC Hammer slide towards Cueball.]\nBoom De Yada\nBoom De YadaPanel 24:\n[Cueball and Megan on an electric skateboard.]\nBoom De Yada\nBoom De Yada"
}