{
  "num": 461,
  "url": "https://xkcd.com/461",
  "title": "Google Maps",
  "img": "https://imgs.xkcd.com/comics/google_maps.png",
  "alt": "Apparently Google assumes you're traveling during the ferry's normal operating hours. We lost two hours circling that damn lake (to say nothing of the Straw Man).",
  "year": "2008",
  "month": "8",
  "day": "11",
  "transcript": "My road trip with my brother ran into trouble around page three of the Google Maps printout[Google Maps printout.]\n← 70. Slight left at RT-22 - go 6.8 mi\n→ 71. Turn right to stay on RT-22 - go 2.6 mi\n← 72. Turn left at Lake Shore Rd - go 312 ft\n→ 73. Turn right at Dock St - go 427 ft\n[An icon of water] 74. Take the ferry across the lake. - go 2.8 mi[A car is driving in the dark.]\nBrother: Okay, now take Dock St toward the ferry.\nCueball: We're supposed to take a ferry? It's past midnight, and these woods are creepy.\nBrother: Google Maps wouldn't steer us wrong.[Cueball and his brother stand outside the car. The ferry has a sign on it reading CLOSED.][Cueball is standing next to his brother, who is holding a Google Maps printout.][Cueball motions towards his brother.]\nCueball: Let me see those directions.[Google Maps printout.]\n[An icon of water] 74. Take the ferry across the lake. - go 2.8 mi\n↗ 75. Climb the HILL toward Hangman's Ridge, avoiding any mountain lions. - up 1,172 ft\n↷ 76. When you reach an old barn, go around back, knock on the second door, and ask for Charlie. - go 52 ft\n[An icon of a van] 77. Tell Charlie the Dancing Stones are restless. He will give you his van. - Careful\n[An icon of a straw man] 78. Take Charlie's van down Old Mine Road. Do not wake the Straw Man. - go π mi\n← 79. Turn left on Comstock. When you feel the blood chill in your veins, stop the van and get out. - go 3.2 mi\n↓ 80. Stand very still. Exits are north, south, and east, but are blocked by a Spectral Wolf. - go 0 ft\n[An icon of a menacing face] 81. The Spectral Wolf fears only fire. The Google Maps Team can no longer help you, but if you master the wolf, he will guide you. Godspeed. - go ?? mi"
}