{
  "num": 495,
  "url": "https://xkcd.com/495",
  "title": "Secretary: Part 2",
  "img": "https://imgs.xkcd.com/comics/secretary_part_2.png",
  "alt": "That helmet won't save him.",
  "year": "2008",
  "month": "10",
  "day": "28",
  "transcript": "[Blondie as a news anchor sitting behind a desk is reading from a paper she holds in her hands. There is a picture of Black Hat on a screen behind her. There is a caption below the picture.]\nBlondie: Breaking news—the President has made a nomination to the new post of Internet Secretary. We know little about the man, shown here.\nCaption: Possibly a haberdasher?[Blondie keeps talking over a scene showing her standing with a microphone in front of a water filled moat that has been dug between the road and a house. A small stair up to the house is just on the other side of the moat. Behind her is Cueball with a large TV camera on his shoulder pointing towards her and the house.]\nBlondie (narrating): Attempts to reach the nominee at home were unsuccessful.\nBlondie: What the hell kind of apartment has a moat?[Back to Blondie behind her desk, the paper is gone and she leans one arm on the desk. There is no screen behind her.]\nBlondie: To understand the culture from which he came — and which he may soon administer — we sent a reporter to what we're told is the source of that culture. \nBlondie: Tom?[This panel is much larger than the three previous panels and partly hidden behind the last. Tom, looking like Cueball with a military helmet with camouflage marks strapped under his chin, holds a large microphone in front of him while standing in front of a large screen. The screen shows with a message board with four picture posts. Each picture has a text to the right but those are unreadable scribbles. The top drawing is of a man with wild hair who holds out his hands with thumbs up. The next is text. Then there is a circle with a smaller circle in the middle and at the bottom what appears to be a Cueball-like man with a fencing mask. Blondie still speaks to him from off-panel left.]\nTom: I'm coming to you live from the 4chan /b/ board. Despite the tube cloggage, nascent memes are flying fast and furious.\nBlondie (off-panel): Why are you wearing a helmet, Tom?\nTom: I'm not sure.\nImage with text only: /b/ [Ponytail is sitting in front of a large control unit using the two levers coming out of it from below two buttons that are again below the lit screen. A voice comes from off-panel left. Above the top of the panels frame there is a frame with a caption:]\nMeanwhile in Ron Paul's blimp.\nRon Paul (off-panel): Ahoy! What news of the blogs?[Zoom out showing Ponytail who has turned around on her office chair away from the controls towards Ron Paul drawn like Cueball but with a cane. She holds up a piece of paper with a small square insert visible at the top. Apart from that it is white.]\nPonytail: Dr. Paul! The President's named his nominee!\nRon Paul: It's not me?[Ron Paul's blimp is shown from the outside. His voice can be seen coming from the airship. There is text on the blimp, with the four letters after the first written mirrored to spell another word.]\nRon Paul (from inside the blimp): Wait! I remember that guy from the campaign! He's a notorious troll!\nBlimp: \nRon Paul \nRƎVO⅃UTION[Back inside the blimp Ron Paul points to Ponytail while his other hand is lifted to his chin. His cane leans against his legs. Ponytail looks at him from her chair, the paper now held in her lap.]\nRon Paul: They mustn't put him in charge. Quick, call the capitol![Ponytail turns around on her chair towards the controls and takes hold of one of the sticks. Ron Paul has taken the cane in his hand again.]\nPonytail: Can't, sir. The tubes just went down completely.\nRon Paul: Blast![Ponytail now holds on to both sticks as Ron Paul lifts his cane up into the air pointing away from her up and right.]\nRon Paul: Then we'll go ourselves. Full speed ahead![A full view of the blimp hanging in the air to the left over a broad landscape. There seems to be a small lake just in front of the blimp. The horizon is shown all along this full width panel and after the lake there are five small mountain peaks, two behind the three in front. After the last of these there follows one more peak and a small mound. Features are shown on the ground. In the air in front of the blimp there are a small cloud inside the panel at the end of the lake, and a large cloud breaking the upper frame over the end of the five mountain stretching over the next peak and mound.]\nBlimp: \nRon Paul \nRƎVO⅃UTION[Same image. The blimp has advanced minutely taking the tip clearly over the lake. Beat panel #1]\nBlimp: \nRon Paul \nRƎVO⅃UTION[Same image. The blimp has advanced minutely again. Beat panel #2]\nBlimp: \nRon Paul \nRƎVO⅃UTION[Same image but now the two speak from within the blimp. The blimp has again advanced minutely so the gondola below the blimp is now also almost at the edge of the lake..]\nRon Paul: I said full speed!\nPonytail: It's a blimp, sir!\nBlimp: \nRon Paul \nRƎVO⅃UTION"
}