{
  "num": 513,
  "url": "https://xkcd.com/513",
  "title": "Friends",
  "img": "https://imgs.xkcd.com/comics/friends.png",
  "alt": "Friends with detriments.",
  "year": "2008",
  "month": "12",
  "day": "5",
  "transcript": "[Cueball is talking to a girl.]\nCueball: I have a crush on you.[Cueball is shown alone.]\nCueball: I could ask you out, and move on with my life if you said no.Cueball: Or, WE COULD BE FRIENDS!Cueball: See, I don't want to consider that you might not be attracted to me. I'm scared of rejection, so I've decided relationships should grow smoothly out of friendships.[Megan is shown sitting at her computer.]\nCueball: When you have problems, I'll be there for you, night after night.\nCueball: Selflessly.\nComputer (Instant message from boy): *hug*[Megan is shown slamming door and walking to Cueball to get a hug.]\nCueball: I'll tear down the jerks you date, and wait for you to realize how good I am for you. That only I will ever understand you.\nSLAM\nMegan: Sniff\nCueball: There there[Cueball is shown alone again.]\nCueball: You don't want to hurt my feelings, and I won't ever force the issue. I'll tell myself it's because I \"Value our friendship.\"Cueball: Bit by bit, I'll make you depend on me.[Cueball and girl are shown sitting on a rock in a park, reading a book together.]\nCueball: You'll think about how long it would take to build this kind of connection again.[Cueball and girl are shown sitting on a couch drinking, getting closer, and kissing.]\nCueball: And in a moment of weakness\nCueball: and loneliness\nCueball: you'll give in.[Megan is shown sitting at the computer with Cueball behind her facing the other way washing dishes.]\nCueball: It'll feel comfortable and natural. You'll quietly revise your definition of love and try to be happy. And sometimes you will be.[Megan is shown sitting at the computer.]\nCueball: Only the wistfulness in your gaze and the tiny pause before you say \"I love you\" will hint that this wasn't the ending you'd hoped for.\nCueball: Sound good?[Megan is holding hands with another boy, talking to Cueball.]\nMegan: ...I'm going to date this jerk.\nCueball: But he doesn't respect you!"
}