{
  "num": 521,
  "url": "https://xkcd.com/521",
  "title": "2008 Christmas Special",
  "img": "https://imgs.xkcd.com/comics/2008_christmas_special.png",
  "alt": "'How could you possibly think typing 'import skynet' was a good idea?'",
  "year": "2008",
  "month": "12",
  "day": "24",
  "transcript": "The 2008 XKCD Christmas Special\nDue to the slowing economy, we could only afford to produce the prime-numbered panels.\nYou should be able to infer the missing parts of the story easily enough.\nWe apologize for the inconvenience.\n[The first panel is blank.]\n[Megan carrying Christmas lights and Cueball watching.]\nMegan: I'm going to one-up those Christmas light displays on YouTube.\n[Megan thinking.]\nMegan: Hmm. Needs more flair. Do you know what happens when you fire sodium pellets into a snowbank?\nCueball: No.\nMegan: Me neither.\n[The next panel is blank.]\n[Megan sitting in front of a console.]\nMegan: Whoops, one of the Arduino control boards sublimated.\nMegan: If only I could make it self-repairing...\n[The next panel is blank.]\nMegan: Shit. The system has become sentient.\nCueball: Friggin' Python.\nSystem: GRAAARR!\n[The next three panels are blank.]\n[Megan showing laptop to Cueball.]\nMegan: But according to this email forward, Santa is secretly a Muslim!\nCueball: It explains everything!\n[The next panel is blank.]\nMegan: Okay, the cloned raptors are hunting the last of the cyborgs. We're safe.\nCueball: Are you sure you thought this through?\n[The next three panels are blank.]\n[Two couples appear in this next panel.]\nCueball: Are the raptors contained?\nPonytail: Sure. Unless they figure out how to build lightsabers.\n[The next panel is blank.]\n[Guy with hat fighting with a raptor using lightsabers.]\nCueball: It's all right. I've got her.\n[Lightsaber appears from behind.]\nSnap-hiss!\nCueball: ...Clever girl.\n[The next three panels are blank.]\n[Bill Gates is holding a weapon over Santa's body. The two girls are watching.]\nMegan: Great. Bill Gates kills Santa.\nBill Gates: I thought it was Stallman with a dyed beard.\n[The next five panels are blank.]\n[Megan and Black Hat are looking at a tree.]\nMegan: Where did you get this Christmas tree?\nBlack Hat: Nowhere.\nMegan: Did you cut down the Yggdrasil?\nBlack Hat: ...Maybe.\n[The next panel is blank.]\n[Megan and Cueball holding hands and looking at reader.]\nMerry Christmas from XKCD <3\n[The last panel is blank.]"
}