{
  "num": 526,
  "url": "https://xkcd.com/526",
  "title": "Converting to Metric",
  "img": "https://imgs.xkcd.com/comics/converting_to_metric.png",
  "alt": "According to River, \"adequate\" vacuuming systems drain the human body at about half a liter per second.",
  "year": "2009",
  "month": "1",
  "day": "5",
  "transcript": "Guide to Converting to Metric[There are five frames with tables for different units. Between the two upper frames is the following text:]\nThe key to converting to metric is establishing \nnew reference points. When you hear \"26°C\", \ninstead of thinking \"That's 79°F\" you should think,\n\"that's warmer than a house but cool for swimming.\" \nHere are some helpful tables of reference points:[The frame to the left of the above text has the header \"Temperature\", and lists the following temperatures on the left, with the corresponding descriptions on the right: 60°C, Earth's hottest; 45°C, Dubai heat wave; 40°C, Southern US heat wave; 35°C, Northern US heat wave; 30°C, Beach weather; 25°C, Warm room; 20°C, Room temperature; 10°C, Jacket weather; 0°C, Snow!; -5°C, Cold day (Boston); -10°C, Cold day (Moscow); -20°C, Fuckfuckfuckcold; -30°C, Fuuuuuuuuuuck!; -40°C, Spit goes \"clink\".]\n[Next to the last three entries we see Cueball  spitting on the ground. The spit bounces.]\nCueball: Ptoo\nSpit: Clink![The frame to the right of the above text has the header \"Length\", and lists the following lengths on the left, with their corresponding descriptions on the right: 1 cm, Width of microSD card; 3 cm, Length of SD card; 12 cm, CD diameter; 14 cm, Penis; 15 cm, BIC pen; 80 cm, Doorway width; 1 m, Lightsaber blade; 170 cm, Summer Glau; 200 cm, Darth Vader; 2.5 m, Ceiling; 5 m, Car-length; 16 m 4 cm, Human tower of Serenity crew.]\n[To the right of the table is a human tower of four of the people from the Serenity crew. The head of the upper person is right below the first entry.][The frame below and to the left of the above text has the header \"Speed\".  Below this, there are three columns: the left is labeled \"kph\", the center is labeled \"m/s\", and the right is unlabeled but contains the corresponding description for each speed.  From left to right, the entries read: 5, 1.5, Walking; 13, 3.5, Jogging; 25, 7, Sprinting; 35, 10, Fastest human; 45, 13, Housecat; 55, 15, Rabbit; 75, 20, Raptor; 100, 25, Slow highway; 110, 30, Interstate (65 mph); 120, 35, Speed you actually go when it says \"65\"; 140, 40, Raptor on hoverboard.][The frame directly below the above text has the header \"Volume\", and lists the following volumess on the left, with their corresponding descriptions on the right: 3 mL, Blood in a fieldmouse; 5 mL, Teaspoon; 30 mL, Nasal passages; 40 mL, Shot glass; 350 mL, Soda can; 500 mL, Water bottle; 3 L, Two-liter bottle; 5 L, Blood in a human male; 30 L, Milk crate; 55 L, Summer Glau; 65 L, Dennis Kucinich; 75 L, Ron Paul; 200 L, Fridge.]\n[Next to the entry on nasal passages and shoot glass (starting one entry higher and finishing one entry lower) are the following text:]\nSo, when it's blocked\nthe mucus in your\nnose could about \nfill a shot glass.\n[Below this text is a drawing of a mucus filled shot glass.] \nRelated: I've\ninvented the \nworst mixed \ndrink ever.\n[Below this next to the four last entries we see Cueball shoving Summer Glau, Dennis Kucinich and Ron Paul into an open fridge. Above the fridge in a loosely drawn ellipse are the following text:]\n55+65+75<200[The frame below and to the right of the above text has the header \"Mass\", and lists the following masses on the left, with their corresponding descriptions on the right: 3 g, Peanut M&M;; 100 g, Cell phone; 500 g, Bottled water; 1 kg, Ultraportable laptop; 2 kg, Light-medium laptop; 3 kg, Heavy Laptop; 5 kg, LCD monitor; 15 kg, CRT monitor; 4 kg, Cat; 4.1 kg, Cat (with caption); 60 kg, Lady; 70 kg, Dude; 150 kg, Shaq; 200 kg, Your mom; 220 kg, Your mom (incl. cheap jewelry); 223 kg, Your mom (also incl. makeup).]\n[Next to the entries of cat and cat (with caption) are two drawings of cats. The second one has a caption across its chest.]\nCat (with caption): Mrowl?\n[Below this and next to the lady and dude entries are drawings of Megan and Cueball.]"
}