{
  "num": 526,
  "url": "https://xkcd.com/526",
  "title": "Converting to Metric",
  "img": "https://imgs.xkcd.com/comics/converting_to_metric.png",
  "alt": "According to River, \"adequate\" vacuuming systems drain the human body at about half a liter per second.",
  "year": "2009",
  "month": "1",
  "day": "5",
  "transcript": "Guide to Converting to Metric[There are five frames with tables for different units. Between the two upper frames is the following text:]\nThe key to converting to metric is establishing new reference points. When you hear \"26°C\", instead of thinking \"that's 79°F\" you should think, \"that's warmer than a house but cool for swimming.\" \nHere are some helpful tables of reference points:[The frame in the top left lists the following temperatures on the left, with the corresponding descriptions on the right. Next to the last three entries we see Cueball spitting on the ground. The spit freezes.]\nTemperature60°C    Earth's hottest\n45°C    Dubai heat wave\n40°C    Southern US heat wave\n35°C    Northern US heat wave\n30°C    Beach weather\n25°C    Warm room\n20°C    Room temperature\n10°C    Jacket weather\n0°C       Snow!\n-5°C     Cold day (Boston)\n-10°C   Cold day (Moscow)\n-20°C   Fuckfuckfuckcold\n-30°C   Fuuuuuuuuuuck!\n-40°C   Spit goes \"clink\"Cueball: Ptoo\nSpit: Clink![The frame in the top right lists the following lengths on the left, with their corresponding descriptions on the right. To the right of the table is a human tower of four of the people from the Serenity crew. The head of the upper person is right below the first entry.]\nLength1 cm         Width of microSD card\n3 cm         Length of SD card\n12 cm       CD diameter\n14 cm       Penis\n15 cm       BIC pen\n80 cm       Doorway width\n1 m           Lightsaber blade\n170 cm     Summer Glau\n200 cm     Darth Vader\n2.5 m         Ceiling\n5 m           Car-length\n16 m 4 cm Human tower of Serenity crew.[The frame in the bottom left has three columns]  \nSpeedkph   m/s   \n5      1.5    Walking\n13    3.5    Jogging\n25    7       Sprinting\n35    10     Fastest human\n45    13     Housecat\n55    15     Rabbit\n75    20     Raptor\n100   25    Slow highway\n110   30    Interstate (65 mph)\n120   35    Speed you actually go when it says \"65\"\n140   40    Raptor on hoverboard[The frame in the bottom middle lists the following volumes on the left, with their corresponding descriptions on the right. \nVolume3 mL     Blood in a fieldmouse\n5 mL     Teaspoon\n30 mL    Nasal passages\n40 mL    Shot glass\n350 mL   Soda can\n500 mL   Water bottle\n3 L         Two-liter bottle\n5 L          Blood in a human male\n30 L        Milk crate\n55 L        Summer Glau\n65 L        Dennis Kucinich\n75 L        Ron Paul\n200 L      Fridge[Next to the entry on nasal passages and shot glass (starting one entry higher and finishing one entry lower) is the following text:]\nSo, when it's blocked, the mucus in your nose could about fill a shot glass.[Below this text is a drawing of a mucus filled shot glass.] \nRelated: I've invented the worst mixed drink ever.[Below this next to the four last entries we see Cueball shoving Summer Glau, Dennis Kucinich and Ron Paul into an open fridge. Above the fridge in a loosely drawn ellipse is the following text:]\n55+65+75 < 200[The frame in the bottom right lists the following masses on the left, with their corresponding descriptions on the right3 g          Peanut M&M\n100 g     Cell phone\n500 g    Bottled water\n1 kg       Ultraportable laptop\n2 kg       Light-medium laptop\n3 kg       Heavy laptop\n5 kg       LCD monitor\n15 kg     CRT monitor\n4 kg       Cat\n4.1 kg    Cat (with caption)\n60 kg     Lady\n70 kg     Dude\n150 kg   Shaq\n200 kg   Your mom\n220 kg   Your mom (incl. cheap jewelry)\n223 kg   Your mom (also incl. makeup)[Next to the entries of cat and cat (with caption) are two drawings of cats. The second one has a caption across its chest.]\nCat (with caption): Mrowl?\n[Below this and next to the lady and dude entries are drawings of Megan and Cueball.]"
}