{
  "num": 540,
  "url": "https://xkcd.com/540",
  "title": "Base System",
  "img": "https://imgs.xkcd.com/comics/base_system.png",
  "alt": "I once got to second base with a basketball player. She was so confused.",
  "year": "2009",
  "month": "2",
  "day": "6",
  "transcript": "[At the top there is a four panel regular comic strip.]\n[Cueball and Ponytail are talking; Ponytail is sitting on the back of a chair with her feet on the seat, and Cueball is sitting on the floor facing her.]\nPonytail: So how far did you get with her?\nCueball: Second base?[Zoom in on Ponytail on the chair.]\nPonytail: Wait, which one is that? Below the waist, but... not under the clothes?\nCueball (off-panel): I think that's... shortstop?[Cueball now almost lies down and Ponytail is sitting on the armrest of the chair.]\nPonytail: You should try crossing the pitcher's mound. Then down the 50-yard line, and right past her ten-pin.\nCueball: Sounds tricky.[Again a zoom in on Ponytail now on the armrest.]\nPonytail: Yeah. Last time I tried it, I got a red flag. If you know what I mean.\nCueball (off-panel): I really don't.[Below the strip there is a large frame with a diagram of a baseball diamond.]\n[At the bottom left there is a box with tis text:]\nThe \"Base\" Metaphor Explained[Bases are pointed too with thick black arrows (except home plate) and there are also arrows pointing to different parts of the diagram. All arrows and points marked with \"x\" have a description, as do the dashed lines covering the field. Below they will be listed anti-clockwise from the home plate.][Along the line towards first base is the following five items in the order they appear:]\n[x slightly right of home plate:]\nEye contact\n[Black arrow pointing to a base half way to first base outside the line:]\nYour Base\n[x inside the line opposite your base]\nPassing notes\n[Black arrow pointing to a base further along and outside the line:]\n0110 0010 0110 0001\n0111 0011 0110 0101\n0010 0000 0011 0010\n[x Slightly before first base:]\nDownloading Star Trek fanfiction and replacing Riker's name with your crush's.[Black arrow pointing to first base:]\nFirst base: Kissing[Further along the line past the first base is one x point in the right outfield:]\nEye contact from Janeane Garofalo.[On the way towards second base there are the following two items:]\n[A region along the line from first to second has been marked off by a dotted line. It has the following text written inside:]\nThe boring zone.\n[x some way inside the line next to the boring zone:]\nUsing the scroll thingy on that one Apple mouse[Black arrow pointing to second base:]\nSecond base: Hands under the shirt and/or licking[On the route from second to third base are eight items:]\n[A dotted line traveling from near the outfield above second base, then crossing the second baseline about 1/3 of the way to third base, snaking its way almost down to the home plate ending close to the third baseline. The following text is written along the dotted line inside the diamond:]\nThe orgasm line\n[Above second base a large black arrow crosses the orgasm line near the outfield:]\nNapoleon's forces\n[x below the Napoleon arrow right before crossing the orgasm line:]\nFursuits\n[Two arrows points to the second base line on each side of the orgasm line:]\nHands on the pants\nHands in the pants\n[x some way into the diamond just past the orgasm line:]\nDry humping\n[x same distance down the second base line as dry humping, but equally far outside the line still infield:]\nFursuits (crotchless)\n[x almost at the extension of the 3rd base line close to the outfield:]\nStanding anywhere near Peaches[In the left outfield there are two x points:]\n[x in the outfield halfway along the second base line:]\nRetrograde wheelbarrow\n[x in the outfield almost at the extension of the third base line:]\n2outfielders1glove.[Foul of the third base line just left of where the grass line divides the in- and outfield:]\nAnal sex (fill in your own \"foul ball\" pun here.)[Black arrow pointing to third base:]\nThird base: Oral sex (formerly \"hands in the pants\")[On the route from third to home plate there are four items:]\n[Between third base and home there is a dotted line that makes a curve from right outside the third base line and ends right afer it has crossed the orgasm line. The text is written inside the diamond with the first word above and the other two below the dotted line:]\n\"Virginity\" (Maginot) line\n[A large black arrow curves around the end of the \"Virginity\" line outside of the diamond:]\nTeens\n[A large black arrow points from outside the diamond to a point right between home plate and the virginity line:] \nSharing root PWs\n[x just before home plate at the end of the orgasm line inside the diamond:]\nThigh contact"
}