{
  "num": 551,
  "url": "https://xkcd.com/551",
  "title": "Etch-a-Sketch",
  "img": "https://imgs.xkcd.com/comics/etch-a-sketch.png",
  "alt": "Surrounded by boring mysteries.",
  "year": "2009",
  "month": "3",
  "day": "4",
  "transcript": "[Cueball is sitting on a bench playing with a pink Etch-a-Sketch.]\nCueball: Hey. If I draw enough lines, I can see what's behind the screen.[Close up on the Etch-a-Sketch's screen.]\nCueball (off-screen): Oh man, almost...[Cueball looks at the Etch-a-Sketch.]\nEtch-a-Sketch: Hi![Head of Megan appears in the black hole Cueball has drawn on the Etch-a-Sketch screen.]\nMegan: You're cute![Cueball is looking closer on the Etch-a-Sketch screen.]\nCueball: Wha—\nMegan (out of the Etch-a-Sketch): I'm the one who draws when you turn the knobs. \nMegan (out of the Etch-a-Sketch): It's lonely in here.[Cueball holds the Etch-a-Sketch further away from his head.]\nCueball: It's lonely out here too.\nMegan (out of the Etch-a-Sketch): I'm glad you found me, then![Cueball holds the Etch-a-Sketch very close to his face. Panels start to break away into thought bubbles.]\nMegan (out of the Etch-a-Sketch): Let's be friends\nMegan (out of the Etch-a-Sketch): And never be alone again.[The next panel is almost gone in the thought bubbles. In the remaining top left corner there are three pink hearts, the top one of these looks like it was drawn on an Etch-a-Sketch.][From the last two panels the above turns out to have been a fantasy of Cueball. There is a rather large break between the first three lines of panels to the last line. Between the previous line of panels (from the middle panel ) to the last line, there are three large circles, which then continues with seven more inside the next panel down to Cueball sitting with the etch-a-sketch.]\nCueball: *Sigh*[Close up of the Etch-a-sketch where the black hole Cueball has drawn shows what is really behind the glass; just the mechanics of the machine, with a pin that moves on a cross and removes the sand from the screen.][Zoom back out to Cueball who shakes etch-a-sketch above his head.]"
}