{
  "num": 556,
  "url": "https://xkcd.com/556",
  "title": "Alternative Energy Revolution",
  "img": "https://imgs.xkcd.com/comics/alternative_energy_revolution.jpg",
  "alt": "The moment their arms spun freely in our air, they were doomed -- for Man has earned his right to hold this planet against all comers, by virtue of occasionally producing someone totally batshit insane.",
  "year": "2009",
  "month": "3",
  "day": "16",
  "transcript": "[A field with seven wind turbines is silhouetted against a dusk sky. One of the turbines is much closer than the others. The panel is double height and width of the two next panels to the right.][Cueball standing and Megan sitting on the ground are overlooking the wind turbines.]\nCueball: I'm all for green energy, but those turbines creep me out. They remind me of War of the Worlds, or the Tripod books.[While the two are in the same position but longer to the left in the panel wiggly lines form around the last word to indicate a high rumbling sound.]\nMegan: They are unnerving.\nCueball: I can't shake the feeling that at any moment they'll— \nRumble[The next line in the comic has five small square panels:]\n[A leg begins to split off one wind turbine.]\nCrack[The leg separates from the body of the wind turbine.][The new leg lands on the ground.]\nBoom[Another leg begins to split off the other side of the wind turbine's body.]\nCrack[The new leg hits the ground, forming a tripod base.]\nBoom[A panel even wider than the first, but the same height as the 2nd and 3rd panel. Four of the wind turbines rampage across the field. Six smoke plumes rise from the ground where there are also nine to ten distinct red fires burning. The turbines move towards towers and buildings to the right.][Cueball and Megan are now both standing. This panel and the last three panels in the last row is all the same size, a third of the total comic in width and the same height as the previous panel.]\nMegan: Oh no.\nCueball: Al Gore, you've doomed us all.\nMegan: It's coming this way!\nCueball: Run![One of the enormous tripod wind turbine feet lands right behind the running couple, sending debris flying.]\nBoom[Cueball and Megan run up a small hill (that continue up in the next panel).]\nMegan: What now?\nCueball: Someone has to stop them.\nMegan: But who could-\nVoice (off panel): Stand aside![A man with a black hat  and a beard sits mounted on a horse at the top of the hill, lance at the ready.]"
}