{
  "num": 566,
  "url": "https://xkcd.com/566",
  "title": "Matrix Revisited",
  "img": "https://imgs.xkcd.com/comics/matrix_revisited.png",
  "alt": "I actually remember being entertained by both the sequels while in the theater. They just don't hold up nearly as well in later comparison.",
  "year": "2009",
  "month": "4",
  "day": "8",
  "transcript": "[Megan stands below two pieces of text, in a panel that is without a frame.]\nToday was the ten-year anniversary of the release of The Matrix. \nI sat down to watch it again.\nMegan: Holy fuck, ten years ago?[The next three panels of the first row and the next two rows spoofs three scenes from The Matrix.][In scene 1 Morpheus with sunglasses and Trinity with hair bun are talking to Cueball-Neo. Morpheus has his hands together.]\nMorpheus: Unfortunately, no one can explain what the matrix is. You have to see it for yourself.[Trinity lifts her hand.]\nTrinity: Sure you can. It's a computer simulation in which you live, thinking it's reality.\nNeo: Oh.[Morpheus takes his hands down and turns around glaring at Trinity who has also taken her hand down.]\nTrinity: ...What? \nTrinity: Look, maybe you just suck at explaining.[In scene 2 Morpheus is talking to Neo while holding a red pill and a blue pill. To the far right is a part of a table.]\nMorpheus: ...Or you take the red pill, and I show you how deep the rabbit hole goes.[Neo takes both pills from Morpheus.][Neo crushes both the red and blue pills on a table top.]\nCrush[Neo snorts the resulting purple powder through a pipe he holds up to his face (his nose).]\nSnort[Morpheus and Neo are shown upside down in a frame with inverted colors, i.e., black background with white lines.]\nMorpheus: Now look what you've done.\nNeo: Where are we?\nMorpheus: I have no idea.[In scene 3 Neo, wearing a long, black trench coat, at a metal detector, is accosted by the Cueball-like security guard.]\nGuard: Please remove any keys, metallic items, weapons—[Neo steps close to the guard and opens his trench coat towards the guard, who is facing the reader. The reader can't see what Neo has under his coat.][Same scene as above, but side view: Neo, on the left, is opening his coat toward the guard, who is on the right and seems to be looking down. Nobody speaks.][Same scene as above but the guard now looks up to Neos face and finally speaks:]\nGuard: Eww.[In the last row of the comic we see three characters that have obviously just finished watching The Matrix. Cueball is sitting on the floor nearest to the TV, Megan is sitting on the floor, farther from the TV and a Cueball-like friend is sitting on an armchair, farthest from the TV.]\nCueball: I forgot how good that movie was.\nFriend: Wanna put on the other two?[Cueball, still sitting has turned to face Megan. They exchange looks without speaking.][View of room, which is now empty, as is the chair. Sounds comes from off-screen to the right.]\nCrash\nWham \nFriend (off-screen): Ow! Ow![Cueball and Megan are back in the room, zoomed in so the TV is no longer visible, but the chair is and it remains empty. The friend is nowhere to be seen.]\nCueball: I forgot how good that movie was.\nMegan: Too bad they never made any sequels.\nCueball: True."
}