{
  "num": 572,
  "url": "https://xkcd.com/572",
  "title": "Together",
  "img": "https://imgs.xkcd.com/comics/together.png",
  "alt": "This scavenger hunt is getting boring. Let's go work on the treehouse!",
  "year": "2009",
  "month": "4",
  "day": "22",
  "transcript": "[Cueball and Megan are running in a field, holding hands. They are running away from another pair which also looks like Cueball and Megan. This pair stands in the background, next to a small box. There may be something lying on top of the box, but it is difficult to see clearly. The sun is shining above them.][Cueball and Megan are in a boat on a lake, very romantic. Cueball is speaking to Megan, illustrated with a heart.]\nCueball: ♡[Cueball and Megan sit together on a bench on a beach, watching the sunset.][Cueball and Megan stand in front of an altar under a wedding arch, with confetti falling around them. He is wearing a butterfly and she a veil.][Cueball and Megan, now old and wrinkled, sit together holding hands on their porch at the top of a small stair outside their house. He has a sailor cap on and Megan now wears her hair in a bun. Although the woman looks like Hairbun, and the old man is wearing a sailor cap, we can assume this is still Megan and Cueball given the juxtaposition of the preceding panel.][The same setting is depicted but seen from the side of the house. Cueball begins walking away from Megan using his cane. He has descended from the stair. Finally, Megan speaks, and unusually there is a speech bubble, with an extra smaller bubble hanging on to it for the second sentence.]\nMegan: Dear? Where are you-\nMegan: Come back![Cueball approaches an old couple, presumably the kids from the first panel now turned old. They seem tired, looking down all the time. The man only has hair around his neck and also a cane. The woman has long thinning hair. The box from the first panel is between Cueball and the other two. On top of it lies a piece of paper][Same picture except that Cueball is now standing still and has picked up the paper from the box and writes on it with a pen. Again there is a speech bubble.]\nCueball: Okay,[The paper is shown. It is a scavenger hunt list with at least six items. The three first items have been checked off. The last item is blocked by the speech bubble, but can be seen to be there from the check box.] \nScavenger \nhunt:\n☒ Indian-head penny\n☒ Snake skin\n☒ Happiness\n☐ Four-leaf clover\n☐ Shark tooth\n☐ [covered by speech bubble]\nCueball (off-panel): What's next?"
}