{
  "num": 574,
  "url": "https://xkcd.com/574",
  "title": "Swine Flu",
  "img": "https://imgs.xkcd.com/comics/swine_flu.png",
  "alt": "Bad flu epidemics can hit young adults hardest because they provoke their powerful immune systems into overreaction, so to stay healthy spend the next few weeks drunk and sleep-deprived to keep yours suppressed.",
  "year": "2009",
  "month": "4",
  "day": "27",
  "transcript": "[Caption:]\nTwitter is great for watching \nuninformed panics unfold live.[The comic shows a twitter search results page with \"Swine flu\" in the search box and a gray search button.]\ntwitter [Swine flu] (search)[The results is displayed in a frame below the search panel:]\nRealtime results for Swine flu 0.05[This next line is highlighted in yellow. Most text here and below is written in normal black font, but the underlined links in the main text is in blue. Below each tweet is a line with info and reply links etc. all in gray font. Between the yellow line and the first tweet and between each tweet is a dotted line.]\n1,918 more results since you started searching. Refresh to see.Skeeve37: Oh god I ate pork yesterday before I knew about swine flu!Less than 10 seconds ago from web ∙ reply ∙ view tweetHanneloreec: Without duct tape I can't seal the door to keep out swine flu but I can't get duct tape without going outside! Help!\nLess than 10 seconds ago from web ∙ reply ∙ view tweetPaulyshorefan: How long until the swine flu reaches me here in Madagascar?\nLess than 10 seconds ago from web ∙ reply ∙ view tweetCrackMonkey74: Swine flu is God's punishment for the ACLU and lesbians and 9/11 and nanobots!\nLess than 10 seconds ago from web ∙ reply ∙ view tweetTwilight7531: I fell down the stairs and there was a crack and a jagged white thing is sticking out of my arm guys is this swine flu?\nLess than 10 seconds ago from twitterific ∙ reply ∙ view tweetWigu: @Untoward: No, that sounds like syphilis, not swine flu. What did you say you did with a pig?\nLess than 10 seconds ago from tweetdeck ∙ reply ∙ view tweet2011Seniursrule: My Dad said flu vaccines are linked to autism, so to be safe from swine flu I'm trying to lick an autistic kid.\nLess than 10 seconds ago from web ∙ reply ∙ view tweet"
}