{
  "num": 580,
  "url": "https://xkcd.com/580",
  "title": "The Race: Part 4",
  "img": "https://imgs.xkcd.com/comics/the_race_part_4.png",
  "alt": "Things are rarely just crazy enough to work, but they're frequently just crazy enough to fail hilariously.",
  "year": "2009",
  "month": "5",
  "day": "7",
  "transcript": "[Cueball and Nathan Fillion are ready on the start line on their electric skateboards.]\nVoice off panel: On your mark...Voice: Get set...\nNathan: Remember episode 11, when I got all naked in that desert?Voice: Go!\n[Nathan speeds away leaving Cueball standing at the start line.]Voice: ...I said \"Go.\"\nVoice: Someone throw some water on him.\nCueball: Can't...get it...out of my head...[Nathan on walkie talkie, speeding on his skateboard.]\nNathan: He's right behind me. Kaylee, I'm gonna try a Crazy Ivan.\nJewel [on walkie talkie] (579 shows Nathan's naming confusion): That doesn't make any sense, Nathan.\nNathan: Trust me.Jewel: No, I mean it's not a skateboard maneuver. The concept doesn't even apply to this situation.\nNathan [via walkie talkie]: That's why it just might work!\nJewel: No, that's the opposite of true!Nathan: On my mark, override the remote differential and throw her into a spin.\nJewel [via walkie talkie]: okay, but—\nNathan: Mark!\nWHAM[Nathan lying injured on the ground next to his skateboard, Cueball cruises past.]\nWhirrrrrrrr[Nathan, trying to stand up.]\nNathan: I'm down. Tell Summer \"The chickens are in the hayloft. Plan Gamma is a go.\"[Nathan, one foot on skateboard, looking at walkie talkie.]\nmumbling from walkie talkie\nJewel: She says, \"Plan gamma acknowledged. The meerkats are in the bag.\n[Summer Glau is walking off panel.]Jewel [to walkee talkie]: So we're good?\nNathan: Hard to tell with her. Do you see an actual bag of meerkats?\nJewel: No.\nNathan: Then we're probably good.[Cueball screeching to a halt as he sees Summer Glau.]\nCueball: Oh! Hi, Miss Glau! I'd love to talk, but Nathan's back on his feet and catching up.[Summer grabs Cueball's arm.]\nGrab\nCueball: Wha—[Summer kicks Cueball in the face whilst pulling his arm towards her, he flies off his skateboard.][Summer walking away as Cueball lies crippled on the floor with his sunglasses beside him.][Cueball still lying on the floor.]Cueball [thinking]: I've never been so turned on in my life."
}