{
  "num": 585,
  "url": "https://xkcd.com/585",
  "title": "Outreach",
  "img": "https://imgs.xkcd.com/comics/outreach.png",
  "alt": "Completely implausible? Yes. Nevertheless, worth keeping a can of shark repellent next to the bed.",
  "year": "2009",
  "month": "5",
  "day": "18",
  "transcript": "[Ponytail faces two Cueball-like guys. All three are wearing goggles and lab-coats. Between them on a shelve stands a microscope and a beaker.]\nPonytail: The tracking tag will record the shark's movement and habits.[The capsule is shown to float upward towards a water surface.]\nPonytail (narrating): Then, it will pop free and float to the surface.[A coast is shown, with arrows directed from water to land. A small white circle on one of the arrows indicate the balloon.]\nPonytail (narrating): We can't afford a recovery program, so the capsules will inflate helium balloons, drift over land,[The capsule is shown in close up. It has a caption on it.]\nPonytail (narrating):  And hopefully be found and mailed to us. Any questions?\nCaption: If found please call[Ponytail is standing over a groggy shark on a boat, with water behind her and a coastline in the background. She attaches the tracking tag to the shark.]\nChunk[The shark is dropped headfirst off the boat, into the water with a large splash.]\nSploosh\nShark: !!![The course of the shark is shown, weaving around islands.][The capsule is shown sticking out of the shark at the moment it is ready to pop free.]\nClick[The capsule remains attached to the shark.][The balloon starts to inflate, still attached to the shark and underwater.]\nHissss[As the balloon inflates, it starts to pull the shark to the surface.]\nShark: ??[The balloon breaks the surface, pulling the shark with it.][Science Girl with a black ponytail, eating an ice cream cone is standing together with Cueball to the right in an otherwise empty frame.][Two screaming scientists (A Cueball-like guy and Ponytail) runs past the two, who turns to look after them. The guy is holding the microscope and Ponytail the beaker from the first frame.]\nScientists: Aaaaaaaa[A shark attached to a huge balloon floats past the girl and Cueball, it follows the scientists while snapping it's jaws.]\nShark: Chomp chomp[After the shark is gone, Science Girl turns to Cueball.]\nScience Girl: Daddy?\nCueball: Yes?\nScience Girl: I want to be a scientist."
}