{
  "num": 599,
  "url": "https://xkcd.com/599",
  "title": "Apocalypse",
  "img": "https://imgs.xkcd.com/comics/apocalypse.png",
  "alt": "I wonder if I still have time to go shoot a short film with Kevin Bacon.",
  "year": "2009",
  "month": "6",
  "day": "19",
  "transcript": "[The first panel is very large and shows a dark scene with one large meteor in front and four smaller in the background showering the darkened earth. They are all five black with yellow fire around them and a fire trail behind them, and all are flying from the top left corner and down towards right. The sky at the top is pitch black, but then the sky turns blood red under dark clouds. Two large mountain peaks, one almost pyramid shaped, are shown to the left and to the right there are two smaller peaks towards the distant horizon. The mountains and the ground around them are mainly black, but with red, orange and yellow streaks spread all over the black area beneath the mountain peaks, maybe indicating fire or lava, or reflections in water or blood. At the bottom right corner a normal white panel is superimposed on this apocalyptic image.][The smaller panel at the bottom of the first is halfway over the first panel, haflway below, and only to the right of the middle of the first panel. Beret Guy is running towards left, with his arms raised in the air.]\nBeret Guy: The apocalypse! The skies burn, the seas turn to blood, and the dead walk the earth![From here a normal sequence of panels in three rows begin beneath the second panel. This leaves a gap between the apocalyptic panel and the first row of regular panels, on the left side where the 2nd panel did not reach over. In this panel Beret Guy (coming from the right) finds Cueball.]\nCueball: The dead what?\nBeret Guy: Walk the earth![Cueball running right in a thin panel.]\nCueball: I have to go.[Cueball sitting on a chair at a table scribbling vigorously and noisily with a pen on a paper. Mathematical symbols appear above Cueball's head, including a summation from i=0 to n, a logarithm of n and the square root of a number.]\n∑ni=0ik1/i log(n)\n√163\nScribble\nScribble[Cueball running right again, in a thin panel, pen and paper in hand.][Cueball opening door with label:]\nMath Dept\nCueball: The dead return! \nCueball: Everyone, quick, get your names on here![Cueball stand on the left side of a table looking left over his shoulder. Five people are lining up to sign the paper lying on the right side of the table. The first who signs with a pen is Blondie, then in line follows Megan, a Cueball-like guy, Ponytail and another Cueball-like guy who stand with one hand to his chin looking right, away from the other.]\nBlondie: At last!\nGuy looking right: I hope there's time![Cueball running right in yet a thin panel, with pen and the paper flowing behind him.][Cueball walks right with the paper and pen in his hand as he arrives at at a cemetery as revealed by an old worn sign. Scary sounds appear off-panel right.]\nSign: Cemetery \nRising dead (off-panel): Hurrghhh[Cueball, still going right, arrives at a grave, pen in hand and the other hand almost outside the panel, but with a corner of the paper just visible. The grave has a large gravestone to the right and in front of it there is a Cueball-like guy rising up from the ground using his arms to push up on the base of the stone and the small pile of earth towards Cueball. The guy looks very worn, with dirt on his head and scratches on his cheek.][Cueball bends a little down and offers pen and paper to the raised dead man who looks up at him when he is addressed.]\nCueball: Paul Erdős?\nErdős: Yes?\nCueball: We need you to sign this."
}