{
  "num": 635,
  "url": "https://xkcd.com/635",
  "title": "Locke and Demosthenes",
  "img": "https://imgs.xkcd.com/comics/locke_and_demosthenes.png",
  "alt": "Dear Peter Wiggin: This letter is to inform you that you have received enough up votes on your reddit comments to become president of the world. Please be at the UN tomorrow at 8:00 sharp.",
  "year": "2009",
  "month": "9",
  "day": "10",
  "transcript": "[The \"real\" names and the fact that the squirrel is vomiting comes from the official transcript on xkcd.][Valentine (a.k.a. Demosthenes, with long dark hair), is laying on her back on the ground looking up at the sky with her hands behind her head. Peter (a.k.a. Locke, looking like Cueball) is attracting a squirrel with some food his hand.]\nValentine: Ender's up there saving the world, but down here it's falling apart politically. What can we do?[Peter turns towards and sits down, leaning back on one hand. Valentine sits up in a similar position. Her hair looks like a mix between Megan and Hairbun's hair. The squirrel behind Peter is bending over the food Peter has thrown out for it.]\nPeter: I know — we get on the nets and anonymously post political opinions. People reading our articles will see our intelligence, recognize how clear and logical our arguments are, and insist that we be put in charge, so we can fix everything!\nValentine: Brilliant![Beneath the first two panel is large panel displaying a blog page. The background is light gray and then there are four white rectangular sections with rounded corners.]\n[There is a heading in the top central section:]\nLocke\nPowered by Wordpress[Below is the largest section, which extends below the panel. It has a scroll bar to the right which is partly scrolled down. The last sentence of a post can be seen at the top, with a time stamp below. Then follows the heading of a new post and the first line of this, which is partly cut off at the bottom of the panel:]\nwhich is why we must reach out to the Russian leadership.\nPosted at 3:15AM by Locke\nComments (0)\nThe Problem with China\nIn recent months much has been made of[To the right is two sidebars. The top one shows recent posts:]\nRecent posts:\n>> A few thoughts on...\nComments (0)\n>> Russian Aggression...\nComments (1)\n>> Trade policy and the...\nComments (0)\n>> And one more thing...\nComments (0)\n>> Everyone's wrong about...\nComments (1)[Below this is list of links to other websites, this section also extends below the panel. The second link is partly cut off at the bottom of the panel, so it is not possible to see that this is probably also underlined:]\nBlogroll:\n>> Demosthenes\n>> FiveThirtyEight"
}