{
  "num": 681,
  "url": "https://xkcd.com/681",
  "title": "Gravity Wells",
  "img": "https://imgs.xkcd.com/comics/gravity_wells.png",
  "alt": "This doesn't take into account the energy imparted by orbital motion (or gravity assists or the Oberth effect), all of which can make it easier to reach outer planets.",
  "year": "2009",
  "month": "12",
  "day": "28",
  "transcript": "Main Text\nGravity Wells scaled to Earth surface gravity\nThis chart shows the \"depth\" of various solar system gravity wells.\nEach well is scaled such that rising out of a physical well of that depth — in constant Earth surface gravity — would take the same energy as escaping from that planet's gravity in reality.\nEach planet is shown cut in half at the bottom of its well, with the depth of the well measured down to the planet's flat surface.\nThe planet sizes are to the same scale as the wells. Interplanetary distances are not to scale.\nDepth = (G × PlanetMass) / (g × PlanetRadius)\nG = Newton's constant\ng = 9.81 m/s2Planetary Descriptions\nTo Sun, very very far down\nMercury\nVenus\nEarth - 6379 km [originally 5,478 km]\nMoon - 288 km\nMars - 1,286 km\nGanymede\nIo\nJupiter\n[A drawing of a \"very deep\" gravity well, \"Your mom\" at the bottom, several member of \"local football team\" falling down towards her.]\nJupiter is not much larger than Saturn, but much more massive. At its size, adding more mass just makes it denser due to the extra squeezing of gravity.\nIf you dropped a few dozen more Jupiters into it, the pressure would ignite fusion and make it a star.\nEuropa\nTitan\nTwo alarms: Weeoooeeoooeeooo\nSaturn\nRings\nUranus\nNeptune\nMegan: An even more glorious dawn awaits!Mars Inset\n[Mars gravity well, with one of the Mars rovers on its surface, with its moons Deimos and Phobos as smaller gravity wells.][Figure of a man (to scale) in Deimos's gravity well.]\nYou could escape Deimos with a bike and a ramp.[Figure of a man (to scale) in Phobos's gravity well.]\nA thrown baseball could escape Phobos.Earth Inset\n[Zoomed-in view of Earth/moon gravity well, featuring the relative locations of the atmosphere, Low Earth Orbit, the International Space Station, the Space Shuttle, GPS satellites, and satellites in geosynchronous orbit.]\nCueball: This is why it took a huge rocket to get to the moon but only a small one to get back.It takes the same amount of energy to launch something on an escape trajectory away from Earth as it would to launch it 6,000 km upward under constant 9.81 m/s2 Earth gravity.Hence, Earth's well is 6,000 km deep."
}