{
  "num": 683,
  "url": "https://xkcd.com/683",
  "title": "Science Montage",
  "img": "https://imgs.xkcd.com/comics/science_montage.png",
  "alt": "The rat's perturbed; it must sense nanobots! Code grey! We have a Helvetica scenario!",
  "year": "2010",
  "month": "1",
  "day": "1",
  "transcript": "[Two columns of four panels are shown below two captions.]\nLeft: Movie Science Montage\nRight: Actual Science Montage[Below the four rows of panels in the two montages will be described, Movie first then Actual as the two are synchronized in time.][Movie: Cueball passes a test tube to Ponytail sitting at a large control console to the left looking at it's glowing screens at the bottom. At the top there is a flashing lamp. Both are wearing lab coats and goggles. A a hamster ball and a Newton's cradle stand on a shelf above them.][Actual: Cueball stand behind Ponytail, also here both are in lab coats with goggles. Ponytail place a sample from a test tube into a small device standing on a table. An analog clock on the wall above them is at five minutes past ten.][Movie: A small glowing sample has been placed next to a rat inside a cage standing on a table. Ponytail, is holding a glowing implement up towards the cage; she has another rat in her hand and also a rat sitting on top of her head. Cueball is speaking into a device with a curled wire going to the wall.]\nCaged Rat: Squeak![Actual: Cueball is behind Ponytail standing in front of the machine which is working on the sample. The clock on the wall above them is at ten minutes past ten.]\nMachine: ...whirrrrrr...[Movie: Zoom in on Ponytail who pulls on two levers on a machine, which is shooting a beam of some sort downwards onto a sample, possibly the same as in the cage with the rat.][Actual: Cueball and Ponytail still waits for their sample to be analyzed in the small device. The clock on the wall above them is at twenty five minutes past eleven. Cueball has removed his goggles when the machine finally completes the test.]\nMachine: ...whirrrr...\nMachine: Bing![Movie: Zoom in on Cueball who is operating a complicated-looking chemical apparatus with a scope, flasks, coils, and bubbles.]\nCueball: Paint flecks from the killer's clothing match an antimatter factory in Belgrade!\nPonytail (off panel): Let's go![Actual: Cueball look over Ponytail's shoulder while she examine the sample she has just taken out of the small device. The clock is hidden behind their spoken text. Presumably this occurs right after the bing.]\nCueball: Okay, we've determined there's neither barium nor radium in this sample.\nPonytail: Probably."
}