{
  "num": 725,
  "url": "https://xkcd.com/725",
  "title": "Literally",
  "img": "https://imgs.xkcd.com/comics/literally.png",
  "alt": "The chemistry experiment had me figuratively -- and then shortly thereafter literally -- glued to my seat.",
  "year": "2010",
  "month": "4",
  "day": "9",
  "transcript": "[Cueball and a Cueball-like friend are walking left together. The friend turns his head towards Cueball who speaks, but is interrupted by voice from behind them off-panel right.]\nCueball: I was literally glued to my seat through the entire-\nOff-panel voice: Hah!\nOff-panel voice: You mean \"figuratively\"![A crazy man walks into the next frame-less panel. He has messy hair and a messy beard. Cueball and his friend stop walking and turns toward him.]\nCueball: Who are you?\nCrazy man: Eighteen years I've watched you! \nCrazy man: Waiting![A flashback panel. Four kids are standing around talking to each other. To the left is a girl with a ponytail and in front of her is a kid looking like Cueball - this is the Crazy man as a kid. He speaks to two kids in front of him, the one looking like Cueball, is actually Cueball as a kid, and then another kid with short black hair is standing with him. Above this panels frame, which is not as high as the other panels, there is text narrated by the crazy man. He also narrates a line at the bottom of the panel where the flashback panels frame is cut of at the bottom right.]\nCrazy man (narrating): Ever since that day in seventh grade when you humiliated me.\nCrazy man as a kid: I told him and he literally exploded!\nCueball as a kid: Uh, unless he physically burst, you mean \"figuratively\".\nKid with hair: Hah.\nCrazy man (narrating): Remember?[Cueball and his friend has moved back away from the crazy man to get some more distance between him and themselves.]\nCrazy man: I knew one day you'd slip, and I vowed I'd be there to see you fall. How does it feel?\nCueball: You are literally the craziest person I've ever met.\nCrazy man: You did it again!\nCueball: No, I didn't."
}