{
  "num": 730,
  "url": "https://xkcd.com/730",
  "title": "Circuit Diagram",
  "img": "https://imgs.xkcd.com/comics/circuit_diagram.png",
  "alt": "I just caught myself idly trying to work out what that resistor mass would actually be, and realized I had self-nerd-sniped.",
  "year": "2010",
  "month": "4",
  "day": "21",
  "transcript": "[In the upper left corner there is a map scale, labeled with 1 mi (1 km).]\n[Underneath the scale is a circuit diagram with the following items connected:]\nAn antenna symbol.\nA blender.\nAn Arduino, labeled with \"Arduino, just for blog cred\".\nA chip, labeled \"Most expensive chip available\".\nA symbol for an inductor.\nA pattern that looks like a highway cloverleaf.\nA battery symbol (with the + and - symbols on the wrong ends) with a value of √2V.\nA resistor symbol label \"120Ω or to taste\". \nA switch that is labeled \"glue open\".\nA transistor with two emitters, one P and one N, and no collector.\nA jar of scarab beetles.\nA resistor labeled \"brown blue orange\".\nAn unlabeled resistor with a center tap.\nA capacitor.\nA diode.\nA ground.\nAn inductor.\nAn another inductor.\nThe two inductors and ground are all covered by a \"solder blob\".\nA \"666 timer\" that has pin 5 going into a question mark.\nA compass rose.\nA battery, labeled 50V, with grounds on both sides.\nA long horizontal wire that is labeled \"pull this wire really tight\". \nAn AC source that is labeled 240V, shorted out, with a label on the short \"Omit this if you're a wimp.\"  \nAn inductor that is labeled with \"11kg\".\nA Batman symbol.\nA squirrel.\nA wire that is labeled as a distance 3/8\".\nA 50V battery.\nA frowny face.\nA vertical wire with a 90 degree bend labeled \"caution\".\nA balloon.\nAn inductor symbol with a line on the bottom edge labeled as \"warm front\".\nA resistor labeled \"ë\".\nAn electric eel.\nA capacitor.\nAn unlabeled resistor.\nA gob of hot glue attached to a chip with an inverter hooked to an XOR gate, both with feedback into each other.\nA neck strap.\nA bridge rectifier labeled as \"Moral rectifier\".\nA bottle of magic smoke.\nA fishing bobber.\nA broken wire labeled with a question mark.\nA vertical wire labeled with \"electrons single file\".\nA switch labeled \"Hire someone to open and close switch real fast.\"\nA contact labeled \"touch tongue here\".\nA resistor labeled \"5Ω (decoy)\" with only one terminal connected.\nA methyl group attached to a wire.\nA complex mesh of 1Ω resistors labeled with \"Oh, so you think you're such a whiz at EE201?\"\nA wire labeled \"electrons single file\".\nA wire bent in a U shape with an upside-down ground on the end.\nA flux capacitor with the bottom wire labeled \"I-95\".\nA wire labeled \"yarn\".\nAn arena with two diodes going in and one leaving.\nAn anode labeled \"Bury deep, but not too deep.\"\nA motor labeled \"vibrator\".\nA resistor with a value of π.\nA 500V AC source.\nA wire that leads out of frame with a label \"to center of sun\".  \nA 55 MPH speed limit sign.\nAn SR latch (flip-flop) labeled \"may use an actual sandal instead\". \nA holding pen.\nA wire in a knot.\nA resistor labeled \"8mm\".\nA resistor symbol labeled \"not a resistor; wire just does this\".\nA motor symbol labeled \"to scale\".\nA tangled mess of wires connected and jumping over each other.\nA photo diode labeled \"tear collector\".\nA wire in the shape of a ECG.\nA light bulb.\nA capacitor-looking symbol labeled \"3 liters\".\nA resistor labeled \"yes\".\nAn unlabeled inductor.\nA resistor with a question mark as a label.\nAn inductor labeled \"Take off shirt while wiring this part.  Ooh, yeah, I like that.\"\nA ground symbol immersed in a beaker of holy water."
}