{
  "num": 734,
  "url": "https://xkcd.com/734",
  "title": "Outbreak",
  "img": "https://imgs.xkcd.com/comics/outbreak.png",
  "alt": "Let's get dinner after we promptly destroy all the X-7 we've manufactured.",
  "year": "2010",
  "month": "4",
  "day": "30",
  "transcript": "[Cueball and Megan stand outside a door into a laboratory (with the word \"LAB\" in large letters on the door). Cueball is leaning back against the door. A Cueball-like zombie which is clearly falling apart, walking with its hands stretched out in front of it, is visible through a window into the laboratory. At the top of the panel there is a frame around a yellow area with narration, which goes over the top of this panel's frame.]\nNarrator: The outbreak started with Patient Zero...\nCueball: He was exposed to toxin X-7— now he's a bloodthirsty monster!\nMegan: Has he been in isolation?\nZombie: Braaains![Cueball turns towards the door, pushing on it and partly blocking the door's label (\"LA\"). A noise indicates the zombie banging on the door from inside. Megan runs right her head and hand already partly outside the frame.]\nCueball: Yes, but I can't hold this door for long!\nMegan: Hang on, I've got a gun in my truck.\nZombie (hitting the door): Wham[In this frame-less panel Cueball opens the door a crack, leaning back with a hand in front of his face, as Megan shoots with her shotgun through the open door at the zombie inside.  The word \"LAB\" on the door is no longer blocked.]\nShotgun: BLAM[Cueball and Megan stand together away from the laboratory door. Megan still holds shotgun down. At the top and bottom of the panel there is two more frames around a yellow areas with narration, which goes over the top and bottom of this panel's frame. As Cueball and Megan talk, their names are revealed.]\nNarrator: And ended with Patient Zero five minutes later.\nCueball: So, I never got your name. I'm Ryan.\nMegan: Laura.\nNarrator: The remaining 90 minutes of the movie will be a romantic comedy."
}