{
  "num": 761,
  "url": "https://xkcd.com/761",
  "title": "DFS",
  "img": "https://imgs.xkcd.com/comics/dfs.png",
  "alt": "A breadth-first search makes a lot of sense for dating in general, actually; it suggests dating a bunch of people casually before getting serious, rather than having a series of five-year relationships one after the other.",
  "year": "2010",
  "month": "7",
  "day": "2",
  "transcript": "[In a frame that breaks the top of the first panels frame:]\nPreparing for a date:[Hairy with wet hair and a towel around his waist thinks with his hand to his chin. There are four situations, but it is not possible to read the fourth line.]\nHairy: What situations might I prepare for?\n1) Medical emergency\n2) Dancing\n3) Food too expensive[Close-up on Hairy's face, who is still thinking.  There are again four situations, but again it is not possible to read the fourth line.]\nHairy: Okay, what kind of emergencies can happen?\n1)   A) Snakebite\n B) Lightning strike\n C) Fall from chair[Zoooming out again to full figure of Hairy. He is still thinking... There are four snakes, but again it is not possible to read the fourth line. The word Danger stands beneath the three dots above the \"?\" after each snake.]\nHairy: Hmm. Which snakes are dangerous? Let's see...\nDanger\n1)A)a) Corn snake ?\n b) Garter snake ?\n c) Copperhead ?[Hairy is sitting down in a chair with a laptop in his lap, while still wearing the towel.]\nHairy: The research comparing snake venoms is scattered and inconsistent. I'll make a spreadsheet to organize it.[Bottom panel is larger than top four, and aligned to right. Ponytail meets Hairy on his front stoop. She is carrying a purse, and looks down at the towel he is still wearing. Hairy holds his arms in the air.]\nPonytail: I'm here to pick you up. You're not dressed?\nHairy: By LD50, the inland taipan has the deadliest venom of any snake![Below this last panel are the following caption:]\nI really need to stop using depth-first searches."
}