{
  "num": 799,
  "url": "https://xkcd.com/799",
  "title": "Stephen Hawking",
  "img": "https://imgs.xkcd.com/comics/stephen_hawking.png",
  "alt": "Guys? The Town is supposed to be good, and I thou--' 'PHYSICIST STEPHEN HAWKING DECLARES NEW FILM BEST IN ALL SPACE AND TIME' 'No, I just heard that--' 'SHOULD SCIENCE PLAY A ROLE IN JUDGING BEN AFFLECK?' 'I don't think--' 'WHAT ABOUT MATT DAMON?'",
  "year": "2010",
  "month": "9",
  "day": "29",
  "transcript": "[Stephen Hawking with glasses and dark hair is sitting in his special wheelchair with a computer screen in front stuck to the chair and a large black rear wheel with four large white spokes. He is facing Cueball and Megan. His voice appears in a square machine readable font.]\nStephen Hawking: I thought maybe later we should go see a movie.\nCueball and Megan: !!![Cueball and Megan are running right.][The top half of a front page of a folded newspaper is shown in a frame-less panel. There are wavy plants on either side of the papers name at the top. Below this there is a big headline covering the page width in three rows. Below this is the article that covers the rest of the front page in five columns. The first column is the broadest and it is the beginning of the articles main body of text which is unreadable all the way trough. This columns has text all the way down. The top of the second and third column has a close up picture of Stephen Hawking face, he is sitting in his chair, but it can only be seen down to the top of the screen. The picture sits in the center of the article. Below there is a large caption. The rest of these two columns is more unreadable text. The fourth and fifth column begins with another large sub heading that covers an area of the same size as the picture to the left of it. Above this text there is a line that aligns with the top of the picture, so that it with the picture and the first line of text to the left makes a kind of division line all across the paper below the heading. The rest of these two columns is more unreadable text, except in the fifth column just above the middle where a small heading, with a frame around, raises a question which is just readable.]\nThe Times\nPhysicist Stephen Hawking suggests we see more films\nCaption: Smartest man alive\nSecondary headline: What could he know that we don't?\nQuestion: Is this a warning?[Stephen Hawking is sitting alone in his chair (like in the first image), looking down.]"
}