{
  "num": 803,
  "url": "https://xkcd.com/803",
  "title": "Airfoil",
  "img": "https://imgs.xkcd.com/comics/airfoil.png",
  "alt": "This is a fun explanation to prepare your kids for; it's common and totally wrong. Good lines include \"why does the air have to travel on both sides at the same time?\" and \"I saw the Wright brothers plane and those wings were curved the same on the top and bottom!\"",
  "year": "2010",
  "month": "10",
  "day": "8",
  "transcript": "[In a frame-less picture to the left of the first panel there's a picture of a cross section of an airfoil (a plane wing), with a small black arrow pointing down on the wing from above and similar but larger arrow pointing up on the wing from below. Two lines beginning close to each other at the right respectively moves over and under the wing ending in arrow heads to the left. Just before and after the wing four small lines crossing the long arrows indicate approximately where the path of the lines stop being parallel. Above the drawing there is a caption. Below, in a speech bubble with an arrow pointing towards the next panel to the right, is the text that the teacher Miss Lenhart has just used to describe the drawing.]\nHandling a student who challenges your expertise with an insightful question:\nMiss Lenhart: So, kids, the air above the wing travels a longer distance, so it has to go faster to keep up. Faster air exerts less pressure, so the wing is lifted upward.[Miss Lenhart is shown standing while a student asks a question from off-panel.]\nStudent (off-panel): But then why can planes fly upside down?[Miss Lenhart is pondering the question. Beat panel. Three long and curved arrows point out from the right frame of this panel, leading to each of the next three panels which are arranged vertically above each other, making the comic much deeper in this column than in the first two.][In the top panel Miss Lenhart turns away from the students taking a hand to her chin. Overlaid on the top of the panel there is a small frame with a caption:]\nRight:\nMiss Lenhart: Wow, good question! Maybe this picture is simplified—or wrong! We should learn more.[In the middle panel Miss Lenhart stands as before. Overlaid on the top of the panel there is a small frame with a caption:]\nWrong:\nMiss Lenhart: It's... complicated.\nMiss Lenhart: And we need to move on.[In the bottom panel Miss Lenhart visibly ball her hands in to fists and leans a little forward looking more down. Overlaid on the top of the panel there is a small frame with a caption:]\nVery wrong:\nMiss Lenhart: Santa Claus is your parents."
}