{
  "num": 804,
  "url": "https://xkcd.com/804",
  "title": "Pumpkin Carving",
  "img": "https://imgs.xkcd.com/comics/pumpkin_carving.png",
  "alt": "The Banach-Tarski theorem was actually first developed by King Solomon, but his gruesome attempts to apply it set back set theory for centuries.",
  "year": "2010",
  "month": "10",
  "day": "11",
  "transcript": "[Beret Guy, holding his arms out, stands behind a large orange pumpkin with the stem on top. It is sitting on a table. The pumpkin has been carved out as a lamp with large hole, and a lit candle is visible in the hole. The hole is in the shape of another carved out pumpkin. An interviewer speaks from off panel.]\nInterviewer (off-panel): So what did you—\nBeret Guy: I carved a pumpkin!\nInterviewer (off-panel): ...[Black Hat stands behind a large orange pumpkin which has not been carved out as a lamp, but the stem at the top has been removed and is placed tilting on the side of the pumpkin. It is sitting on a table. A gray box stands next to and partly in front of the pumpkin. On the end of the box there is a label at the top with unreadable text and below that some kind of drawing with a circle at the top. The interviewer speaks from off panel.]\nInterviewer (off-panel): Taking on teen vandals, I see.\nBlack Hat: Heavens, no. My pumpkin simply has chest pains. In fact, I'll leave a note warning them not to smash it.\nText on box:\nNitro-\nglycerin\nDo Not\nShake[Megan stands next to a large orange pumpkin with the stem on top. It is sitting on a table. The pumpkin has been carved out as a typical Halloween lamp. The bottom part of a white candle stick is visible in the mouth shaped hole. The hole is in the shape of a typical jack-o' lantern, with two slanted eyes, double slit nose and a smiling mouth with a tooth sticking out from both upper and lower lip, on either side of the candle stick.]\nMegan: My pumpkin's name is Harold. He just realized that all the time he used to spend daydreaming, he now spends worrying. He'll try to distract himself later with holiday traditions, but it won't work.[Cueball stands next to a two orange pumpkins with their stems on top, the left pumpkin is slightly larger than the right which is partly in front of the larger pumpkin. They have not been carved out even though a knife lies next to them to the right in front of Cueball on the table where they both stand. The interviewer speaks from off panel.]]\nCueball: I carved and carved, and the next thing I knew I had two pumpkins.\nInterviewer (off-panel): I told you not to take the axiom of choice."
}