{
  "num": 806,
  "url": "https://xkcd.com/806",
  "title": "Tech Support",
  "img": "https://imgs.xkcd.com/comics/tech_support.png",
  "alt": "I recently had someone ask me to go get a computer and turn it on so I could restart it. He refused to move further in the script until I said I had done that.",
  "year": "2010",
  "month": "10",
  "day": "15",
  "transcript": "[Cueball is on his cellphone, and holding up a small square piece of hardware with a foot in the other hand. Two wires go from the hardware down to the floor, where one is connected to a box on the floor with two black antennas, and then another wire goes out the other side of this, and bot this and the second wire from the hardware Cueball is holding goes under his desk, on top of which is his open laptop.]\nCueball: ...restart my computer? I know you have a script to follow, but the uplink light on the modem is going off every few hours. The problem is between your office and the modem.[Zoom in on Cueball's torso, still on the phone and with the hardware in hand.]\nCueball: My computer has nothing to do with... OK, whatever, I \"restarted my computer.\"\nCueball: It's still down, and even if it comes back, it's going to die again in a few hours, because your—[Cueball on the phone has walked closer to his desk with the laptop, but holds down the hand with the hardware so it is below the panels frame.]\nCueball: I don't have a start menu. This is a Haiku install, but that's not import—\nCueball: Haiku? It's an experimental OS that I ... oh, never mind.[Cueball has paced away from his desk to the left so it is no longer in the panel. He has put the hardware down next to the box with antennas on the floor. Wires going off panel right toward the desk.]\nCueball: I'm sorry, but this won't get fixed until I talk to an engineer. Can you look around for someone wearing cargo pants, maybe a subway map on their wall?[Hairy is the tech support person on the other end sitting in an office chair at a desk. A phone is hooked up on his table with two wires coming out. He is wearing a headset. He leans back in the chair and looks behind him to the right. Cueball talks to him over the phone indicated with a zigzag line.]\nHairy: There's a chick two phones over with a stuffed penguin doll and a poster of some bearded dude with swords.\nCueball (on the phone): Perfect. Can you put her on?\nHairy: Sure.[The engineer, a woman with black hair in a ponytail, sits in an office chair at her desk typing on her lap top. She also has a headset. Behind her laptop sits a small penguin doll. Cueball talks to her over the phone indicated with zigzag lines.]\nCueball (on the phone): Hey, so sorry to bother you, but my connection—\nEngineer: Yeah, I see it. Lingering problems from a server move.\n<type type>\nEngineer: Should be fixed now.\nCueball (on the phone): Thank you so much.[Zoom in on the engineers torso. The back of the chair and the top of her laptop just inside the panel.]\nEngineer: No problem. Hey, in the future, if you're on any tech support call, you can say the code word \"shibboleet\" at any point and you'll be automatically transferred to someone who knows a minimum of two programming languages.[Zoom in on Cueball on the phone scratching his neck. The engineer talks to him over the phone indicated with zigzag lines.]\nCueball: Seriously?\nEngineer (on the phone): Yup. It's a backdoor put in by the geeks who built these phone support systems back in the 1990's.\nEngineer (on the phone): Don't tell anyone.[The last panel is split in two sections. In the top part still with a zoom in on Cueball, he takes the phone down to hang up. Only this section in inside a frame. The frame is normal at the top and half way down to the left, but only a small way down on the right side. The bottom part of the frame connects these two normal parts but with a wavy line to indicate that this is the end of a dream. In the frame-less part of the panel below Cueball is sitting up in his bed, having lifted his head fro the pillow behind him to the left. He lifts him self up with one hand while the other takes the sheet down over his body. The last part it thus drawn outside the rest of the framed part of the comic.]\nCueball: Oh my god, this is the greatest—Cueball: Wha—\nCueball: ...Dammit."
}