{
  "num": 850,
  "url": "https://xkcd.com/850",
  "title": "World According to Americans",
  "img": "https://imgs.xkcd.com/comics/world_according_to_americans.png",
  "alt": "It's not our fault we caught a group on their way home from a geography bee. And they taught us that Uzbekistan is one of the world's two doubly-landlocked countries!",
  "year": "2011",
  "month": "1",
  "day": "21",
  "transcript": "THE WORLD\nAccording to a Group of\nAMERICANS\nwho turned out to be unexpectedly good at geography, derailing our attempt to illustrate their country's attitude toward the rest of the world.[Left to right, up to down.][North of Canada.] Hey so what projection should we use?\nI'll aim for \"Robinson.\"[North America.] Alaska; Canada; Hudson Bay; Québec; United States\nDid you know Maine is actually the US state closest to Africa?; Bermuda (British!)[Central America.] Baja California (Mexico); Mexico; Central America; Panama Canal; Gulf of Mexico; Cuba; Hispañola; POR.; Jamaica\nDo we have to label all the Virgin Islands?[South America.] Rest of South America (spanish-speaking); Brazil (portugese-speaking); French, and I think Dutch and English; Tierra del Fuego[Greenland.] Greenland (still too big!); Yeah but the Peters map is awful; Iceland[Europe.] British Isles; Ireland; Gibralter; Scandanavia; Western Europe; Eastern Europe; Black sea; Middle East[Africa.] Morocco; Algera; Sahara Desert; West Africa; Sudan; Rainforest DRC; Lake Victoria; Somalia; Angola; Mozambique; South Africa; Cape Horn; Madagascar[West of DRC.] So this is one of those things where you point out our ignorance and stereotypes?\nYeah – I mean, I freely admit I don't know the African map very well, which speaks volumes in itself.[West Asia.] Russia; Aral sea (Gone); Various former Soviet states; Afghanistan & Pakistan; India; Mostly Muslim; Mostly Hindu[Indian Ocea.] Sri Lanka; Boxing Day Quake\nWait, \"Boxing day\"? There's no way you're American.\nI read BBC News, OK?[East Asia.] Mongolia; Tibet (contested); China; Southeast Asia[Pacific Ocean.] Kamchatka Pennisula, but I admit I only know this one from Risk.\nKoreas; Japan, duh.; Taiwan (actually called \"The Republic of China.\" – it's complicated.); Phillipines; Malaysia; Indonesia; Sulawesi; Paupa New Guinea; Australia; Tasmania; New Zealand[South of Africa.] Should we include Antarctica?\nLet's not – these guys are looking impatient."
}