{
  "num": 852,
  "url": "https://xkcd.com/852",
  "title": "Local g",
  "img": "https://imgs.xkcd.com/comics/local_g.png",
  "alt": "In Rio de Janeiro in 2016, the same jump will get an athlete 0.25% higher (>1cm) than in London four years prior.",
  "year": "2011",
  "month": "1",
  "day": "26",
  "transcript": "[Cueball is sitting at a desk, working, with a a laptop in front of him. Megan is behind him. Cueball has turned his head to talk to Megan]\nCueball: Did you know that because of centrifugal* force and the shape of the Earth, \"gravity\" can vary by nearly half a percent between major cities?\n*Yes, centrifugal. xkcd.com/123[Closeup on Cueball, who is looking down at some notes.]\nCueball: That's not a lot, but it could affect, say, pole vaulting. In a 5m jump, it could make a difference of 2cm.[Zoomed out on Cueball, who is typing on his laptop. Megan is behind him, with her hand on her chin.]\nMegan: Huh, interesting.\nCueball: I'm going to write an article reevaluating vaulting records to take this into account.Three days later:\n[Cueball is sitting in an armchair. Megan is behind him, and is pointing behind her.]\nMegan: Good job. There's an angry mob of athletes outside.[Cueball looks off the balcony. A mob of athletes is out of frame.]\nAthlete: That record was mine!\nAthlete: How dare you cast doubt on our honor?\nAthlete: Have you no respect?!\nAthlete: Make him pay!\nCueball: Hey, the math doesn't lie. Suck it, jocks.[Megan stands next to Cueball, who is walking away to the right]\nMegan: Dude, don't provoke them.\nCueball: Whatever. The building's locked. Let 'em vent for a-\ncrash\nOff-panel Athlete: GET HIM![Megan stands next to Cueball. They are both in shock. Megan has her hand on her mouth.]\nCueball: Crap!\nCueball: How did the pole vaulters get up to our balcony?[Beat frame with only Megan. Cueball is out of frame.]\nMegan: ...[Beat frame with just Cueball.][Zoom in on Megan and Cueball, who is facepalming.]\nMegan: That might be the stupidest question I've ever heard.\nCueball: Right."
}