{
  "num": 878,
  "url": "https://xkcd.com/878",
  "title": "Model Rail",
  "img": "https://imgs.xkcd.com/comics/model_rail.png",
  "alt": "I don't know what's more telling--the number of pages in the Wikipedia talk page argument over whether the 1/87.0857143 scale is called \"HO\" or \"H0\", or the fact that within minutes of first hearing of it I had developed an extremely strong opinion on the issue.",
  "year": "2011",
  "month": "3",
  "day": "28",
  "transcript": "[Cueball to the left and his friend, who also looks like Cueball, are standing in the friend's rather large basement, where the celling is held up by six thin columns, and the walls are shown angling in towards a point of perspective, to display how big the room is.]\nFriend: I want to build a perfect HO-scale (~1/87) model train layout of my town.\nCueball: In your basement? Bad idea. Never make a layout of the area you're in.[Zoom in on the two friends without the basement visualized.]\nFriend: Why not?\nCueball: Because it'd include a little 10\" replica of your house.[Zoom in Cueball's friend who takes his hand to his chin.]\nFriend: So? That's be cool! I'd make tiny replicas of my rooms, my furniture—\nCueball (off-screen)l: —And your train layout?[Beneath this first row of the comic is the zoom-out of how the full model would look in the basement. The town lies beneath some small mountains. There is some water with a bridge over it continuing to the roads going through the city. There is no frame around this section, but instead there follows five zoom-outs, each one going from the friend's house, that proceeds to a circular frame. Within each of these is shown a nested model. Starting to the right of the main model, and then moving down, then left, and then down and right. Each layer has a broken arrow above the model between two vertical lines to indicate the scale, the length being written between the two parts of the arrow. Some foreign objects are also labeled to help understand the scale.][Layer 1, the model with the two friends standing to the left of it.]\n18 m[Layer 2, looks exactly as the model, but without the friends.]\n21 cm[Layer 3, with a mosquito shown for comparison. It stands over half the model covering the mountains.]\n2.4 mm [Layer 4, with a strand of spider silk (labeled) shown for comparison. The silk is much thicker than the roads, almost as thick as the mountains and much longer than the model. But the model still looks fairly much like the original one.]\n28 μm\nSpider web[Layer 5, with a cold virus (labeled) shown for comparison. It covers roughly a quarter of the model, taking up the water part of the model. At this level the whole model becomes notably \"fuzzy\" as individual atoms are discernible, and most of the features apart from the mountain is indiscernible. There may be two viruses. The other would then be to the right of the one in the water but above the model. The label stands between them.]\n320 nm\nCold virus [Layer 6, is simply spheres (atoms) at this point. The mountain near the back is the only noticeable feature, consisting of five atoms jutting out from the surface of atoms, which is by no mean flat.]\n37 Å [Beneath these six versions of the model is a caption:]\nThe Matryoshka limit: \nIt is impossible to nest \nmore than six HO layouts[Back to the two friends in the basement, still not showing the basement.]\nFriend: My God.\nCueball: Yeah. It's the second rule of model train layouts: No nesting.[Zoom in on the heads of the two friends.]\nFriend: ...What's the first rule?\nCueball: \"Do not talk about model train layouts.\" That rule was actually voted in by our friends and families.\nFriend: Philistines."
}