{
  "num": 915,
  "url": "https://xkcd.com/915",
  "title": "Connoisseur",
  "img": "https://imgs.xkcd.com/comics/connoisseur.png",
  "alt": "Our brains have just one scale, and we resize our experiences to fit.",
  "year": "2011",
  "month": "6",
  "day": "22",
  "transcript": "[White Hat is holding a wine glass down in one hand and holding a bottle of wine up in front of him with the other hand. He is looking at the label and talking with Cueball standing next to him with his own filled wine glass in one hand. He is looking down at the glass.]\nWhite Hat: How do you stand this cheap wine?\nCueball: Wine all tastes the same to me.[Close-up of White Hat.]\nWhite Hat: You've just never had good wine. If you paid more attention, you'd realize there's a whole world here.[Close-up on Cueball, who spreads his arms out, resulting in the wine in the glass sloshing so much that part of the wine is above the rim of the glass, some even hanging over the edge and a spray droplet hanging above the sloshing liquid.]\nCueball: But that's true of anything! Wine, house music, fonts, ants, Wikipedia signatures, Canadian surrealist porn—\nCueball: Spend enough time with any of them and you'll become a snobby connoisseur.[This panel has no border and is next to but aligned further down than the first three panels. It shows a zoom out of both White Hat and Cueball again. White Hat now has both glass and bottle held down at his side. Cueball holds his glass down, but tilted away from him. A small puddle of wine is on the floor next to Cueball.]\nWhite Hat: But some things do have more depth than others.\nCueball: If you locked people in a box for a year with 500 still frames of Joe Biden eating a sandwich, by the end they'd be adamant that some were great and some were terrible.\nWhite Hat: You're exaggerating.\nCueball: Oh, really?[This panel is below the feet of the two characters from the previous panel. It goes further to the left than those two, and is wider than the previous panels, but it does not go much past the middle, so there is a blank white space to the left of this panel, below the first and most of the second panel. It shows a box, with two star burst on the surface from where two voices emanate from the inside. Over the top left of the panels frame is a small frame with a caption:]\nA year later:\nThe voice from left side of the box: Sure, most closed-mouth frames are boring, but in #415, the way the man's jaw frames the mayo on his hand is pure perfection, and—\nThe voice from right side of the box: What a surprise- you praising a mayo frame. Listening to you, I'd think there was nothing else in The Sandwich. \nThe voice from right side of the box: Frankly, the light hitting J.B.'s collar through the lettuce would put #242 in my top ten even if he had no mayo on his hand at all."
}