{
  "num": 921,
  "url": "https://xkcd.com/921",
  "title": "Delivery Notification",
  "img": "https://imgs.xkcd.com/comics/delivery_notification.png",
  "alt": "You can arrange a pickup of your sword in Rivendell between the hours of noon and 7:00 PM.",
  "year": "2011",
  "month": "7",
  "day": "6",
  "transcript": "[The first panel is a UPS InfoNotice®. Most of the text on it is just scribbles, though the company logo and header is clear.][Cueball opens their door to see the InfoNotice® stuck on his door.]\nCueball: What! I've been here all day!\nCueball 2 (off-screen): Huh?\nCueball: They have my laptop.[Cueball and Cueball 2 are standing next to each other. Cueball has his arms to his sides, in annoyance.]\nCueball 2: So get it tomorrow.\nCueball: I fly out in the morning and they don't open till noon!\nCueball 2: Sucks.[Cueball stands, working on a laptop.]\nCueball: It's right there. I can see the UPS building on the map.\nCueball 2 (off-screen): Ok...[Dramatic zoom to the Cueball's upper torso and face, along with clenched fist.]\nCueball: My laptop is there. \nCueball: It's mine.\nCueball: I'm going to get it.[Even more dramatic zoom! Cueball's face fills the panel.]\nCueball 2 (off-screen): They won't let you.\nCueball: Who are they to keep from me what is mine?\nCueball 2 (off-screen): Dude, they—[Zoomed out on Cueball, who spins around, raising a finger.]\nCueball: A quest is at hand!\nCueball 2(off-screen): Security's gonna throw you out.\nCueball: I fear neither death nor pain. But I will not go unarmed.[Three inset panels overlap, in a montage format.]\n[Elves in long robes stand around a table, on which lies a broken sword.]\n Light the beacons and send word to the Elves. \n They must reforge the sword of my fathers.[An Elf beats the sword together on an anvil.][An Elf rides a horse, silhouetted by the full moon.]\n Ere dawn, I will go forth to the Sorting Depot.[The Elf knocks at the door, sword in scabbard held under arm.]\nKnock knock knock knock[Cueball opens the door, to find a second InfoNotice® stuck on top of the first. The Elf is gone.]"
}