{
  "num": 975,
  "url": "https://xkcd.com/975",
  "title": "Occulting Telescope",
  "img": "https://imgs.xkcd.com/comics/occulting_telescope.png",
  "alt": "Type II Kardashev civilizations eventually completely enclose their planetary system in a Dyson sphere because space is way too big to look at all the time.",
  "year": "2011",
  "month": "11",
  "day": "9",
  "transcript": "[Cueball is presenting his new telescope in front of a white board, pointing to the diagram of said telescope with a pointer. He is standing on a raised podium facing a crowd off-panel]\nCueball: The occulting observatory consists of two parts—the telescope and the discs.[A frame-less panel with a black center with white drawings that shows the diagram from the white board in the first panel. It shows a satellite  with solar panels above and below the main body which has a front end that looks wider like a telescope. The satellite is labeled with a small arrow pointing at the front end. 11 light waves are indicated as coming towards it from the right, and below these they are labeled. Three of the waves is blocked in the middle by a small vertical line which is also labeled with a small arrow. Above and below the diagram outside the black area Cueball is narrating.]\nCueball (narrating): When the telescope sees a star, a disc is carefully steered to block its light.\nLabel: Telescope\nLabel: Light from star\nLabel: Disc\nCueball (narrating): This procedure is repeated until all stars are covered.[Back to Cueball on the podium who now looks down on the audience from where a question emanates at the top of the left frame.]\nPerson #1 (off screen): Wait, all? Why?\nCueball: I'll feel better.[Close-up on Cueball. as two different persons talks to him, from the lower left frame.]\nPerson #2 (off-screen): I thought the point was to image extrasolar planets.\nCueball: The point is that there are too many stars. \nCueball: It's been freaking me out.\nPerson #2 (off-screen): What?\nPerson #3 (off screen): He has a point..."
}