{
  "num": 977,
  "url": "https://xkcd.com/977",
  "title": "Map Projections",
  "img": "https://imgs.xkcd.com/comics/map_projections.png",
  "alt": "What's that? You think I don't like the Peters map because I'm uncomfortable with having my cultural assumptions challenged? Are you sure you're not... ::puts on sunglasses:: ...projecting?",
  "year": "2011",
  "month": "11",
  "day": "14",
  "transcript": "What your favorite\nMap Projection\nsays about you\n[All of these are organized as Title, a copy of the particular projection underneath, and what it says about you under that.]Mercator\nYou're not really into maps.\nVan der Grinten\nYou're not a complicated person. You love the Mercator projection; you just wish it weren't square. The Earth's not a square, it's a circle. You like circles. Today is gonna be a good day!\nRobinson\nYou have a comfortable pair of running shoes that you wear everywhere. You like coffee and enjoy The Beatles. You think the Robinson is the best-looking projection, hands down.\nDymaxion\nYou like Isaac Asimov, XML, and shoes with toes. You think the Segway got a bad rap. You own 3D goggles, which you use to view rotating models of better 3D goggles. You type in Dvorak.\nWinkel-Tripel\nNational Geographic adopted the Winkel-Tripel in 1998, but you've been a W-T fan since long before \"Nat Geo\" showed up. You're worried it's getting played out, and are thinking of switching to the Kavrayskiy. You once left a party in disgust when a guest showed up wearing shoes with toes. Your favorite musical genre is \"Post–\".\nGoode Homolosine\nThey say mapping the Earth on a 2D surface is like flattening an orange peel, which seems enough to you. You like easy solutions.You think we wouldn't have so many problems if we'd just elect normal people to Congress instead of Politicians. You think airlines should just buy food from the restaurants near the gates and serve that on board. You change your car's oil, but secretly wonder if you really need to.\nHobo-Dyer\nYou want to avoid cultural imperialism, but you've heard bad things about Gall-Peters. You're conflict-averse and buy organic. You use a recently-invented set of gender-neutral pronouns and think that what the world needs is a revolution in consciousness.\nPlate Carrée (Equirectangular)\nYou think this one is fine. You like how X and Y map to latitude and longitude. The other projections overcomplicate things. You want me to stop asking about maps so you can enjoy dinner.\nA Globe!\nYes, you're very clever.\nWaterman Butterfly\nReally? You know the Waterman? Have you seen the 1909 Cahill Map it's based— ...You have a framed reproduction at home?! Whoa. ...Listen, forget these questions. Are you doing anything tonight?\nPeirce Quincuncial\nYou think that when we look at a map, what we really see is ourselves. After you first saw Inception, you sat silent in the theater for six hours. It freaks you out to realize that everyone around you has a skeleton inside them. You have really looked at your hands.\nGall-Peters\nI hate you."
}