{
  "num": 980,
  "url": "https://xkcd.com/980",
  "title": "Money",
  "img": "https://imgs.xkcd.com/comics/money.png",
  "alt": "There, I showed you it.",
  "year": "2011",
  "month": "11",
  "day": "21",
  "transcript": "[This transcript is only reproducing text visible on the front page comic.]\n[Title panel at the top left has one large heading, and then it is possible to read the first and third out of five lines (but not for instance the second line which is just the word \"almost\"):] \nMoney\nA chart of\nall of it\n[Below this there are 5 large panels, each with a series of plots, comparing the values of various things. The only clearly visible text is the title of each panel written in white on black background at the top of each panel]\n[The first section covers single coffees up to the hourly salaries of CEOs. It is located below the title panel and there are a lot of green groups marked by unreadable text.]\nDollars \n[The next section discusses values from around $1000 to $1,000,000, including a dissection of the song If I had $1000000. It is located directly below the Dollars section and has mainly orange groups (but also some green) marked by unreadable text.]\nThousands\n[The third section focuses on $1,000,000 to $1,000,000,000, with a large section on campaign contributions of American political presidential campaigns, values of expensive works of art, and J. K. Rowling. It is located to the right of the Thousands section below the Billions section and there are a lot of gray groups (but also some orange) marked by unreadable text.]\nMillions\n[The fourth section gets into larger scale finances, profits of various sectors, costs of natural disasters, and net worths of the richest people on the planet. Also, Donald Trump. It is located to the right of the Dollars section and above both the Millions and Trillions section and has mainly yellow groups (but also some gray and red) all marked by unreadable text. There are, however, a few large headings that can be read:]\nBillions\nEducation\nThe Economic (...?)\nUS household income\nFederal budget\n[In the last panel global financial status is described. It discusses derivatives, liquid assets, public debt by nation and GDP by continent, culminating with the total economic production of the human race to date. It is located below the Billions section to the right of the Millions section and has mainly cyan groups (but also one yellow) all marked by unreadable text.]\nTrillions \n[For the full transcript of the huge image see 980: Money/Transcript.]"
}