{
  "num": 984,
  "url": "https://xkcd.com/984",
  "title": "Space Launch System",
  "img": "https://imgs.xkcd.com/comics/space_launch_system.png",
  "alt": "The SLS head engineer plans to invite Shania Twain to stand under the completed prototype, then tell her, 'I don't expect you to date me just because I'm a rocket scientist, but you've gotta admit--this is pretty fucking impressive.'",
  "year": "2011",
  "month": "11",
  "day": "30",
  "transcript": "[Cueball, is holding something up to show it to Black Hat. It is small and rectangular with a black line in the middle (possible a rocket).]\nCueball: Check out the SLS — 130 tons to orbit. Finally, rockets that improve on the ones we had 40 years ago.\nBlack Hat: Are we getting Nazis to build those ones, too?[Text is written between two frames, with two smaller frames below. A line comes up to Cueballs first comment, showing that it is still the two from the first frame talking, but off-panel.]\nCueball (off-panel): What?\nBlack Hat (off-panel): When we first captured von Braun and his team, we had our engineers interview them, then we built the rockets. \nBlack Hat (off-panel): But our rockets kept exploding.\n[First small panel below the above text: A soldier with helmet and a machine gun is guarding von Braun who is tied to a chair, while being interviewed by an almost bald scientist (hair along the back of his head), who takes notes on a piece of paper.]\n[Second small panel below the above text: The same scientist standing with the paper, watches as a launching rocket explodes. The landscape behind shows a hill.][A black frame with white text above the white Saturn V rocket flying through space.]\nBlack Hat (off-panel): Eventually we gave up and had the German teams do it, and they built us the Saturn V Moon rocket.[Cueball is looking down, his hand with the thing he showed to Black Hat in the first panel hanging down. Black Hat looks at Cueball.]\nCueball: I'm… not sure what lesson to take from that.\nBlack Hat: \"If you want something done right, learning from the Nazis isn't enough. You have to actually put them in charge.\"\nCueball: That's a terrible lesson.\nBlack Hat: Then I guess you should get a Nazi to come up with a better one."
}