{
  "num": 989,
  "url": "https://xkcd.com/989",
  "title": "Cryogenics",
  "img": "https://imgs.xkcd.com/comics/cryogenics.png",
  "alt": "'Welcome to the future! Nothing's changed.' was the slogan of my astonishingly short-lived tech startup.",
  "year": "2011",
  "month": "12",
  "day": "12",
  "transcript": "[Megan staring down at a smartphone in her hand while talking to White Hat.]\nMegan: Everyone's carrying sensor-packed, always-connected computers everywhere. That wasn't true ten years ago.\nWhite Hat: It's all changing too fast, huh?\nMegan: No, too slowly.[Zoom in on Megan's upper part as she holds up the smartphone showing its screen.]\nMegan: There's so much potential here. These clumsy, poorly-designed toys are nothing compared to what lies ahead.[Megan climbs into a cryogenic chamber which stands on a base where a small box at the end of the chamber is connected to it through a bend tube. She leaves the smartphone on the floor in front of White Hat.]\nMegan: That's why I've worked to develop cryogenic freezing. \nMegan: I'm gonna skip forward 30 years and use this stuff when it's good.[Cueball is greeting Megan holding a fist up in front of him, as Megan with morning hair rises up from the open cryogenic chamber.]\n30 years later...\nCueball: Welcome to the future! Nothing's changed.\nMegan: What?\nMegan: Why??[Cueball still stands in front of Megan in the chamber, but the scene has rotated revealing a row of other cryogenic chambers behind. The chamber after Megan's is still closed, but the others are open and people emerging.]\nCueball: When cryogenic freezing was invented, all the engineers who were excited about the future froze themselves. So there's been no one building anything new.[The scene has rotated to look straight in on the long side of Megan's chamber, Cueball is standing to the left of the chamber. She holds the cover ready to close it again. Two voices comes from off-panel to the right.]\nCueball: But they're all waking up now!\nMegan: Sweet! I'm gonna jump forward to see what they do!\nEngineer 1 (off-panel): Me too!\nEngineer 2 (off-panel): Wait, uh, guys?"
}