{
  "num": 992,
  "url": "https://xkcd.com/992",
  "title": "Mnemonics",
  "img": "https://imgs.xkcd.com/comics/mnemonics.png",
  "alt": "'Sailor Moon's head exploded once' and 'Some men have explosive orgasms' both work for the Great Lakes from west to east (Paddle-to-the-Sea order).",
  "year": "2011",
  "month": "12",
  "day": "19",
  "transcript": "XKCD Presents:\nSome New Science Mnemonics(Pattern goes:\nSubject\nElements\nTraditional mnemonic\nContents of frame\nNew mnemonics)Order of Operations\nParentheses, Exponents, Division & Multiplication, Addition & Subtraction\nTraditional: Please Excuse My Dear Aunt Sally\n[Person having a shark delivered to his laptop.]\nPlease Email My Dad A Shark  \nor\nPeople Expect More Drugs And SexSI Prefixes\nBig: Kilo, Mega, Giga, Tera, Peta, Exa, Zetta, (Yotta)\nMilli, Micro, Nano, Pico, Femto, Atto, Zepto, (Yocto)\nTraditional: [I never learned one.]\n[Graph of the declining profits of the Zune.]\n[Karl Marx delivering a number of zeppelins to a bunch of confused proletarians.]\nProletarians (off-screen): Er. What do we do with them?\nKarl Marx: Rise!\nBig: Karl Marx Gave The Proletariat Eleven Zeppelins(, Yo)\nSmall: Microsoft Made No Profit From Anyone's Zunes(, Yo)Taxonomy\nKingdom, Phylum, Class, Order, Family, Genus, Species\nTraditional: King Philip Came Over For Good Sex\nKaty Perry: I'm not sure who doubts this, really.\nKaty Perry Claims Orgasms Feel Good Sometimes\nor\nKernel Panics Crash Our Family Game System.Geologic Periods\n(Precambrian), Cambrian, Ordovician, Silurian, Devonian, Carboniferous, Permian, Triassic, Jurassic, Cretaceous, Paleogene, Neogene\nTraditional: [I never learned one.]\n[A month's set of birth control pills.]\nPolyCystic Ovarian Syndrome Does Cause Problems That Judicious Contraceptves [sic] Partially NegateResistor Color Codes\nBlack Brown, Red, Orange, Yellow, Green, Blue, Violet, Gray, White\nTraditional: [none I care for]\n[Glenn Beck holding the traditional \"Nanobot Vaccine Chemtrail 9/11\" sign.]\n\"Big Brother Reptilian Overlords\", yelled Glenn, \"Brainwashing Via Ground water!!\";\nor\nBe Bold, Respect Others; You'll Gradually Become Versatile, Great Wikipedians!Planets\nMercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune\nTraditional: My Very Excellent Mother Just Served Us Nachos\n[A pregnant Mary attempting to explain things to an incredulous Joseph with black hair and full beard]\nMary's \"Virgin\" Explanation Made Joseph Suspect Upstairs Neighbor."
}